{
 "Sound Splitter": [
  "2019.3+",
  "This add-on, partly based on Tony's Enhancements by Tony Malykh, adds the ability to split audio from NVDA and other sounds onto separate audio channels.\nCommands:\n• Alt+NvDA+S: toggle sound splitter. If enabled, NVDA will be heard through the right channel.\nSound Splitter settings\nYou can configure add-on settings from NVDA menu/Preferences/Settings/Sound Splitter category.\n• Split NVDA sound and applications' sounds into left and right channels: checkinb this checkbox will enable sound splitting feature.\n• Switch left and right during sound split: by default, NVDA will be heard through the right channel if sound splitting is on. You can instead hear NVDA through the left channel by checking this checkbox.\nVersion 22.02\n• Initial version based on Tony Malykh's Tony's Enhancements add-on.",
  "https://addons.nvda-project.org/files/get.php?file=soundsplitter",
  "https://addons.nvda-project.org/addons/soundSplitter.zh_CN.html"
 ],
 "Quick Notetaker": [
  "2019.3 / 2021.2",
  "The Quick Notetaker add-on is a wonderful tool which allows writing notes quickly and easily anytime and from any app the user is using. Whether the user is watching a video for example, or participating in a meeting on Zoom, teams or Google meet, they can easily and smoothly open the notetaker and take a note. In order to create a quick note, NVDA + Alt + n key combination can be used, a floating window appears at the top left corner of the screen, so the note can be typed there.\nEvery note that is being Created can optionally get the active window title, and as such, the note content can get the context in which this note was created by having the note title as the active window title the user was using. This behavior can be changed from the add-on settings, where the user can decide whether the active window title is captured when creating a new note.\nThe Notetaker dialog\n• \nThe note edit area: When opening the Notetaker interface the focus will be in this edit area. Writing with Markdown (a markup language to easily produce HTML content) is supported also. For more info on Markdown visit the Markdown guide page.\n• \nPreview note: to view the note in an HTML window.\n• \nCopy: to copy the note as is to the clipboard.\n• \nCopy HTML code: to copy the HTML code representing the note. A useful feature for those who write in Markdown.\n• \nA checkbox to allow saving the note as Microsoft Word also, or updating the corresponding one if it exists.\n• \nA save and close button.\n• \nA discard button to discard changes when desired. When unsaved changes exist, a warning message is displayed to the user asking if they are sure they want to exit and discard their changes.\nThe Notes Manager interface\nOpening and closing this interface\n• \nNVDA + Alt + v will launch the Notes Manager interface.\n• \nUsing either the Escape key or the close button found at the bottom of this window will close this interface.\nThe notes list\nThe notes are organized in a tabular list which includes:\n. 1\nThe note title: If the note hasn’t got the active window title, the first line of the note will be the note title displayed in this list.\n. 2\nLast edited time stamp.\n. 3\nA preview text of the note content.\nThe options available in Notes Manager interface\n• \nView note: to view the note in an HTML window.\n• \nEdit note: opens the note to be edited using Notetaker interface.\n• \nCopy note: copies the note content as is to the clipboard.\n• \nCreate a Microsoft Word document: Creates a Microsoft Word document representing this note in case it has no such document.\n• \nOpen in Microsoft Word: opens the Microsoft Word document attached to this note in case it has a one.\n• \nCopy HTML code: copies the HTML code representing this note. A useful feature for those who write in Markdown.\n• \nDelete note: displays a warning before performing the note deletion.\n• \nNew note: the Notetaker interface can be reached from this interface to create a new note.\n• \nOpen settings: opening the add-on settings is also possible from here.\n• \nClose: to close the window.\nThe add-on settings\nThe add-on settings are a part of NVDA’s settings interface. To reach those settings, the user needs to open the NVDA menu using NVDA key + n, choose preferences > settings, and then arrow down until reaching Quick Notetaker category.\nUsing the settings interface the user can:\n• \nDefault documents directory: to choose the default directory where Quick Notetaker documents will be saved. The user can press the “Browse” button to change the path of this directory.\n• \nAsk me each time where to save the note's corresponding Microsoft Word document: a checkbox (not checked by default) – to show the dialog for choosing the location where the document will be saved on each save or update operation for the note’s Microsoft Word document if such a one exists.\n• \nOpen the note's corresponding Microsoft Word document after saving or updating: a checkbox (not checked by default) – to allow the user to choose whether the Microsoft Word document will be opened after a save or update operation in case the note has such document.\n• \nCapture the active window title when creating a new note: a checkbox (checked by default) – to allow the note to get the active window title the user was using when they created the note. This title will be also the title of the Microsoft Word document for the note in case it has a one.\n• \nRemember the note taker window size and position: a checkbox (not checked by default) – to tell the add-on to remember the size and the position of the Notetaker dialog when creating or editing a note. As such, when the user opens the dialog next time, the position and the size will be the same as the last time the dialog was used. The default position of this dialog is at the top left corner of the screen.\n• \nAuto align text when editing notes (relevant for RTL languages): a checkbox (checked by default) – to control whether the text when creating or editing a note should be auto aligned according to the language used. This is mostly relevant for right to left languages. For example, if the language used is Arabic or Hebrew, then the text will be right aligned when this option is chosen, if the language is English or French, then the text will be left aligned.\nKeyboard shortcuts\n• \nNVDA + Alt + n: to open the Notetaker interface.\n• \nNVDA + Alt + v: to open the Notes Manager interface.\nKeyboard shortcuts in the different interfaces\nInterface\nCommand\nKeyboard shortcut\nNotetaker\nFocus the note edit area\nAlt + n\nNotetaker\nAlign text to the right\nControl + r\nNotetaker\nAlign text to the left\nControl + l\nNotetaker\nPreview note in an HTML window\nAlt + r\nNotetaker\nCopy\nAlt + p\nNotetaker\nCopy HTML code\nAlt + h\nNotetaker\nSave note as a Microsoft Word document\nAlt + w\nNotetaker\nUpdate the note corresponding Microsoft Word document\nAlt + w\nNotetaker\nSave and close\nAlt + s\nNotetaker\nDiscard\nAlt + d\nNotetaker\nOpen notes Manager\nAlt + m\nNotes Manager\nView note\nAlt + v\nNotes Manager\nEdit note\nAlt + e\nNotes Manager\nCopy note\nAlt + p\nNotes Manager\nOpen in Microsoft Word (if such a document exists)\nAlt + o\nNotes Manager\nCreate a word document for a saved note\nAlt + w\nNotes Manager\nCopy HTML code\nAlt + h\nNotes Manager\nDelete note\nAlt + d\nNotes Manager\nNew note\nAlt + n\nNotes Manager\nOpen settings\nAlt + s\nNotes Manager\nClose the interface\nAlt + c\nThe settings interface\nAsk me each time where to save the note's corresponding Microsoft Word document\nAlt + w\nThe settings interface\nOpen the note's corresponding Microsoft Word document after saving or updating\nAlt + o\nThe settings interface\nCapture the active window title when creating a new note\nAlt + c\nThe settings interface\nRemember the note taker window size and position\nAlt + r\nThe settings interface\nAuto align text when editing notes (relevant for RTL languages)\nAlt + t\nAcknowledgements\n• \nThe add-on comes bundled with Pandoc, a wonderful tool which allows converting documents between different formats. Without this tool the add-on won’t be able to offer the capabilities it offers.",
  "https://addons.nvda-project.org/files/get.php?file=quickNotetaker",
  "https://addons.nvda-project.org/addons/quickNotetaker.\"lng\".html"
 ],
 "Ignore Blanks Indentation Reporting": [
  "2021.1 and beyond",
  "This is an NVDA addon that alters the reporting of indentation by disregarding blank lines when deciding whether to report changes in indentation. It is best understood by contrasting with normal behaviour with an example.\nConsider this example:\ndef foo():\n    x = 42\n\n    return x\n\ndef bar():\nThe current behaviour of NVDA is to report indentation changes for any line where the indentation has changed, even if the line is blank. So, the example would be read like:\ndef foo():\ntab x = 42\nno indent blank\ntab return x\nno indent blank\ndef bar():\nThe disadvantage for this behaviour is that for most programming languages, like python, a blank line has no semantic significance and is just used to visually separate lines of code with no change to the code's meaning. Therefore, by reporting the change of indentation upon entering a blank line and then reporting it again after landing on the next line is just noise that makes it harder to focus on understanding the code.\nThis addon aims to improve on the behaviour by ignoring blank lines when computing indentation speech, thus the example is read like this instead:\ndef foo():\ntab x = 42\nblank\nreturn x\n\nno indent def bar():",
  "https://addons.nvda-project.org/files/get.php?file=ibir",
  "https://addons.nvda-project.org/addons/ignoreBlanksIndentationReporting.\"lng\".html"
 ],
 "Search With": [
  "2019.3 and beyond",
  "This addon helps you to search text, via various search engines. Let no text selected, and press the gesture of the addon, a dialog will be displayed, with an edit box to enter a search query, to search with Google press enter, or tab to search with other engins.\nAnd if you want to search for selected text, select some text and press once, a menu will be displayed with various search engines to choose. and you can if you like, press the gesture twice to search selected text with Google directly.\nThe Default gesture for the addon is: NVDA+ Windows+ S. If the keystroke do not work for you, or conflict with other keystroke, you can as always add a gesture or change the existent one going to: NVDA menu>preferences>inputGestures>Search With category.\nUsage\n• If you want to enter a search query, just press the addon gesture. A dialog will be displayed, with an edit field to enter the search term.\n• Want to search with Google? just press enter.\n• Otherwise tab to Other Engines button, and give it a space, a popup menu will show up, with various search engines to choose. Yahoo, Bing, DuckDuckGo, and Youtube. This is the default menu, and you may modify it from addon's setting panel.\n• Another way to use the addon, is by selecting some text. And on Pressing the addon's gesture, or any other you have assigned to it, a virtual menu will be displayed with various search engines, either the default menu, or any other you have tailed to your needs.\n• Choose one and press enter, the default browser will open displaying search results. or, if you want to search with Google directly, press the gesture twice, and you are done.\n• Want to trigger search menu specifically for clipboard or last spoken text? OK, then you can from input gestures dialog, assigned a gesture for:\n• Trigger search menu for clipboard text, and pressed twice searches that text by Google directly.\n• Trigger search menu for last spoken text, and pressed twice searches that text by Google directly.\n• Want to modify Search with menu? Yes you can do that from the setting panel, and adjust the menu to fit to your mood and needs.\n• You can from there, add to Search with menu, other available search engines. And you can if you like, remove an item from it, move item up, move item down, or return and set menu to default state.\n• If you want these modifications to be permanent, you have to save configuration after wards.\n• Want to search Google using other language options?\n• \nThen, go to Search With category in setting panels, from the cumbo box there, you can choose search Google either:\n• Using browser settings and language.\n• Using NVDA language.\n• Using windows language.\n• \nMoreover, you have the option to choose the default query in Search with dialog. From the Options for default query combo box in setting panel, you can choose either\n• Leave blank\n• Use clipboard text\n• Use last spoken text\n• \nAnd if clipboard or last spoken text is chosen, text in search box will be displayed selected, so that you can easily override it.\n• Lastly, especially for advanced users\n• You can through a check box in setting panel, choose if you want to preserve your data folder upon installing a new version. Be aware, choosing that you will not get new search engines, if any were included in the new addon version. And that's it, hope to search for good and find it, happy searching!",
  "https://addons.nvda-project.org/files/get.php?file=searchwith",
  "https://addons.nvda-project.org/addons/searchWith.\"lng\".html"
 ],
 "Event Tracker": [
  "2021.2 and beyond",
  "This add-on outputs information about objects for which events were fired. Properties recorded in debug log mode include object type, name, role, event, app module, and accessibility API specific information such as accName for IAccessible object and Automation Id for UIA objects.\nNotes:\n• This add-on is designed for developers and power users needing to track events coming from apps and various controls.\n• In order to use the add-on, NVDA must be logging in debug mode (configured from general settings/logging level, or restart with debug logging enabled).\n• It might be possible that add-ons loaded earlier than Event Tracker may not pass on the event to other add-ons, including Event Tracker. If this happens, Event Tracker will not be able to log events.\n• Events are handled from global plugins, app modules, tree interceptors, and NVDA objects, in that order.\nEvents and their information\nThe following events are tracked and recorded:\n• Focus manipulation: gain focus, lose focus, focus entered, foreground\n• Changes: name, value, state, description, live region\n• UIA events: controller for, element selected, item status, layout invalidated, notification, text change, tooltip open, window open\nFor each event, the following information will be recorded:\n• Event name\n• Object\n• Object name\n• Object role\n• Object value or state depending on events\n• App module\n• For IAccessible objects: acc name, child ID\n• For UIA objects: Automation Id, class name, notification properties if recording notification event information, child count for layout invalidated event",
  "https://addons.nvda-project.org/files/get.php?file=evttracker",
  "https://addons.nvda-project.org/addons/evtTracker.\"lng\".html"
 ],
 "PC Keyboard Braille Input for NVDA": [
  "2019.3 +",
  "This NVDA add-on allows braille to be entered via the PC keyboard. Currently, the following keyboard layouts are supported:\n• English QWERTY keyboard.\n• French (France).\n• German (Germany).\n• Italian (Italy).\n• Persian.\n• Portuguese (Portugal).\n• Spanish (Spain and Mexico).\n• Turkish.\nHow to configure\nThe add-on can be configured from its category in the NVDA's settings dialog, under NVDA's menu, Preferences submenu. A gesture for opening the add-on settings panel can be assigned from Input gestures dialog, configuration category.\nCheck the corresponding checkbox if you want to type using only one hand, or ensure it's not checked if you prefer to type using the standard mode (two hands).\nYou can also select if NVDA should speak a single typed dot (using )the feature of \"one hand mode\").\nكيفية الاستخدام\n. 1Press NVDA+0 to enable braille input. This gesture can be changed from Input gestures dialog, Braille category.\n. 2\nType braille by pressing keys together on the PC keyboard as if it were a braille keyboard.\n• \nIf you want to enter text using two hands, use the following keys if you work with a QWERTY English keyboard, or the keys located at the corresponding positions in other layouts:\n• f, d and s for dots 1, 2 and 3 respectively.\n• j, k and l for dots 4, 5 and 6 respectively.\n• Use the keys a and ; (semi-colon) for dots 7 and 8, respectively.\n• You can also use the keys on the row above; i.e. q, w, e, r, u, i, o and p.\n• \nIf you want to type text using one hand, you can compose characters pressing keys simultaneously or in several keystrokes, adding the dots corresponding to the desired character. Press g or h to type the character when you have added all its dots. If you make a mistake building a character, you can clear the dots before typing it by pressing t or y. The keys used in QWERTY English keyboard are the following:\n• Left hand: f, d, s, r, e, w, a, q for dots 1, 2, 3, 4, 5, 6, 7 and 8.\n• Right hand: j, k, l, u, i, o, ; (semicolon), p for dots 1, 2, 3, 4, 5, 6, 7 and 8.\n. 3\nYou can press most other keys as normal, including space, backspace, enter and function keys. Take care about not pressing alt+shift, since changing the keyboard layout may affect the entered dots.\n. 4Press space bar in combination with braille dots to move the system cursor (or report the current line), just if you were using a braille display. For example, space+dot1 to emulate upArrow, space+dot4+dot5+dot6 to emulate control+end, space+dot1+dot4 to report the current line, etc.\n. 5Press NVDA+0 to disable braille input.",
  "https://addons.nvda-project.org/files/get.php?file=pckbbrl",
  "https://addons.nvda-project.org/addons/pcKbBrl.\"lng\".html"
 ],
 "Windows Magnifier": [
  "2018.3 and beyond",
  "This add-on improves the use of Windows Magnifier with NVDA.\nFeatures\n• Allows to report the result of some native Magnifier keyboard commands.\n• Allows to reduce the cases where table navigation commands conflict with Magnifier's commands.\n• Adds some keyboard shortcuts to toggle various Magnifier options.\nSettings\nThe setting panel of Windows Magnifier add-on allows to configure how NVDA reacts to native Windows Magnifier commands. You may want to have more or less commands reported according to what you are able to see. This panel may be opened choosing Preferences -> Settings in the NVDA menu and then selecting the Windows Magnifier category in the Settings window. The keyboard shortcut NVDA+Windows+O then O also allows to open this settings panel directly.\nThe panel contains the following options:\n• \nReport view moves: controls what is reported when you move the view with Control+Alt+Arrows commands. The three options are:\n• Off: Nothing is reported.\n• With speech: a speech message indicates the position of the zoomed view on the dimension the view is being moved.\n• With tones: a tone is played and its pitch indicates the position of the zoomed view on the dimension the view is being moved.\nThis option only affects full view mode.\n• \nReport turn on or off: If checked, the Magnifier's state is reported when you use Windows++ or Windows+Escape commands to turn it on or off.\n• Report zoom: If checked, the Magnifier's zoom level is reported when you use Windows++ or Windows+- zoom commands.\n• Report color inversion: If checked, the color inversion state is reported when you use the control+Alt+I toggle command.\n• Report view change: If checked, the view type is reported when you use a command that changes the view type (Control+Alt+M, Control+Alt+F, Control+Alt+D, Control+Alt+L)\n• Report lens or docked window resizing: If checked, a message is reported when you use the resizing commands (Alt+Shift+Arrows). In docked window mode, the height or the width is reported. In lens mode, the new dimension cannot be reported for now. These resizing command do not seem to be available on all versions of Windows; if your Windows version does not support them, you should keep this option unchecked.\n• \nIn documents and list views, pass control+alt+arrows shortcuts to Windows Magnifier: There are three possible choices:\n• Never: The command is not passed to Windows Magnifier and standard NVDA table navigation can operate. When used in documents out of a table, the Control+Alt+Arrow command reports a \"Not in a table\" error message. This is the standard behaviour of NVDA without this add-on.\n• Only when not in table: In table or in list views, Control+Alt+Arrow commands perform standard table navigation. When used in documents out of a table, Control+Alt+Arrow commands perform standard Magnifier view move commands. If you still want to move Windows Magnifier view while in table or in list view, you will need to press NVDA+F2 before using Control+Alt+Arrow commands. This option is the best compromise if you want to use Control+Alt+Arrow for both Magnifier and table navigation.\n• Always: Control+Alt+Arrow commands moves the Magnifier's view in any case. This option may be useful if you do not use Control+Alt+Arrow to navigate in table, e.g. because you have changed table navigation shortcuts in NVDA or because you exclusively use Easy table navigator add-on for table navigation.\nCommands added by this add-on\nIn addition to native Magnifier commands, this add-on provide additional commands that allow to control Magnifier's options without opening its configuration page. All the commands added to control Magnifier options are accessible through the Magnifier layer command NVDA+Windows+O:\n• NVDA+Windows+O then C: Toggles on or off caret tracking.\n• NVDA+Windows+O then F: Toggles on or off focus tracking.\n• NVDA+Windows+O then M: Toggles on or off mouse tracking.\n• NVDA+Windows+O then T: Toggles on or off tracking globally.\n• NVDA+Windows+O then S: Toggles on or off smoothing.\n• NVDA+Windows+O then R: Switches between mouse tracking modes (within the edge of the screen or centered on the screen); this feature is only available on Windows 10 build 17643 or higher.\n• NVDA+Windows+O then X: Switches between text cursor tracking modes (within the edge of the screen or centered on the screen); this feature is only available on Windows 10 build 18894 or higher.\n• NVDA+Windows+O then V: Moves the mouse cursor in the center of the magnified view (command available in full screen view only).\n• NVDA+Windows+O then O: Opens Windows Magnifier add-on settings.\n• NVDA+Windows+O then H: Displays help on Magnifier layer commands.\nThere is no default direct gesture for each command, but you can attribute one normally in the input gesture dialog if you wish. The same way, You can also modify or delete the Magnifier layer access gesture (NVDA+Windows+O). Yet, you cannot modify the shortcut key of the Magnifier layer sub-commands.\nMagnifier's native commands\nThe result of the following Magnifier native commands may be reported by this add-on, according to its configuration:\n• Start Magnifier: Windows++ (on alpha-numeric keyboard or on numpad)\n• Quit Magnifier: Windows+Escape\n• Zoom in: Windows++ (on alpha-numeric keyboard or on numpad)\n• Zoom out: Windows+- (on alpha-numeric keyboard or on numpad)\n• Toggle color inversion: Control+Alt+I\n• Select the docked view: Control+Alt+D\n• Select the full screen view: Control+Alt+F\n• Select the lens view: Control+Alt+L\n• Cycle through the three view types: Control+Alt+M\n• Resize the lens with the keyboard: Shift+Alt+Left/Right/Up/DownArrow. Note: although this does not seem to be documented, this shortcut seems to have been withdrawn in recent Windows versions such as Windows 2004.\n• Move the magnified view: Control+Alt+Arrows (reporting only affects full screen mode)\nHere is also a list of other Magnifier native commands, just for information:\n• Control+Alt+mouseScrollWheel: Zooms in and out using the mouse scroll wheel.\n• Control+Windows+M: Opens the Magnifier's settings window.\n• Control+Alt+R: Resizes the lens with the mouse.\n• Control+Alt+Space: Quickly shows the entire desktop when using full screen view.\nNone of the Magnifier native commands can be modified.\nNotes\n• For computers equipped with an Intel graphic card, control+alt+arrow (left/right/up/down) are also shortcuts to modify the orientation of the screen. These shortcut are enabled by default and conflict with Windows Magnifiers shortcuts to move the view. You will need to disable them to be able to use them for the Magnifier. They can be disabled in the Intel control panel or in the Intel menu present in the system tray.\n• \nDepending on your Windows version, Alt+Shift+Arrow are Windows Magnifier shortcuts to resize the magnified view (lens or docked). When Magnifier is active (even in full screen mode), these shortcuts are captured by Magnifier and cannot be passed to the application, even if you press NVDA+F2 before. To use these shortcuts in the current application, you need to quit the Magnifier (Windows+Escape) and re-open it after (Windows++). For example in MS word, to decrease title level:\n• Press Windows+Escape to quit Magnifier.\n• Press Alt+Shift+RightArrow to decrease current title level.\n• Press Windows++ to re-open the Magnifier.\n• \nFor more information about Windows Magnifier's features and shortcuts, you may want to consult the following pages:\n• Use Magnifier to make things on the screen easier to see\n• Windows keyboard shortcuts for accessibility",
  "https://addons.nvda-project.org/files/get.php?file=winmag",
  "https://addons.nvda-project.org/addons/winMag.\"lng\".html"
 ],
 "Direct Link": [
  "2019.3 and beyond",
  "The purpose of the addon is to convert the Dropbox, Google Drive or oneDrive (both personal and business) links to a direct link, furthermore, it generates a direct link to a WhatsApp chat with the chosen selected phone number.\nUsage\n• Select or copy a shared Dropbox, Google Drive or oneDrive link\n• Press alt+NVDA+l to convert the link. The resulting URL will be in your clipboard.\n• Similarly for the phone number, copy or select the number you like to chat with or share and press the same shortcut (alt+NVDA+L).\n• if you like to open the resulted link in your browser, press alt+NVDA+shift+l.\nWhy the direct link?\nA direct link will allow you to get the well-known save dialog box directly if you open it in the browser, without being hassled by the hosting company download page and locating the download link. Moreover, the direct link can be used to stream a file or view a file in certain programs such as media players (if coming with URL support). Likewise, if WhatsApp is common in your country, rather than creating a new contact each time if you need to chat with someone, weather it is a customer or technical support, you can simply select the number or copy it and start chatting right away. Even more, you can share the WhatsApp link of your own number if people usually need to contact you in case you work as a freelancer.\nNotes\n• A link of a folder cannot be converted; the link has to be directing to a file.\n• Make sure the link you are sharing is public (anyone with the link can access) in order for it to be successfully converted.\n• You can change the hotkeys from the NVDA menu> preferences> input gestures.\n• If you find a certain format of a phone number that is not detected, you can email me with an example.\n• Certain type of files and sizes in Google Drive might take you to a page that says \"Google Drive can't scan this file for viruses.\" in that case, you have to click on download anyway link.",
  "https://addons.nvda-project.org/files/get.php?file=directlink",
  "https://addons.nvda-project.org/addons/directLink.\"lng\".html"
 ],
 "NVDA Unmute": [
  "2019.3 and beyond",
  "This add-on checks the status of the Windows audio system when NVDA starts. And, if it turns out that the sound is muted - the add-on forcibly turns it on.\nAt the same time, the volume level is checked separately for the NVDA process.\nThe add-on also checks the status of the speech synthesizer. If there are problems with its initialization, attempts are made to start the synthesizer, which is specified in the NVDA settings.\nThere is an additional opportunity to check on which audio device the NVDA sound is output. And, if this device differs from the default device, the output automatically switches to the audio device installed in the system as the main one.\nNote: If the add-on startup sound always plays even if the NVDA volume is online. That is, the add-on switches the output to the main audio device each time you start NVDA.\nThis occurs when the audio output device is in the NVDA settings is differ from the default output device or \"Microsoft Sound Mapper\".\nThis can be easily solved in one of the following ways:\n. 1After restarting NVDA, just save the current configuration using NVDA+Ctrl+C. The default audio device will be saved in the NVDA settings and switching will not occur each time when NVDA starts.\n. 2If you don't want to change the NVDA configuration - just disable the function of switching audio devices in the Unmute settings panel.\nAdd-on settings dialog\nTo open the add-on settings panel, follow these steps:\n• Press NVDA+N to open NVDA menu.\n• Then go to \"Preferences\" -> \"Settings...\" and in the categories list find and open \"Unmute Windows Audio\".\nThat's it, you can now use the Tab key to move between add-on settings.\nThe following options are available in the add-on settings dialog:\n. 1\nThe first slider in the add-on settings dialog allows you to specify the volume level of Windows, which will be set when you start NVDA if the sound was previously muted or was too low.\n. 2\nThe minimum Windows volume level at which the volume up procedure will be applied. This slider allows you to adjust the sensitivity level of the add-on.\nIf the volume level drops to less than the value specified here, the volume will be increased the next time you start NVDA.\nOtherwise, if the volume level remains higher than the value specified here, then when you restart NVDA, its level will not change.\nAnd, of course, if the sound was previously turned off, when restarts add-on will turn it on anyway.\n. 3\nThe following check box allows to enable re-initialization of the voice synthesizer driver.\nThis procedure will only start if it is detected at NVDA startup that the voice synthesizer driver has not been initialized.\n. 4\nIn this field you can specify the number of attempts to re-initialize the voice synthesizer driver. Attempts are performed cyclically with an interval of 1 second. A value of 0 means that attempts will be performed indefinitely until the procedure is successfully completed.\n. 5\nThe \"Switch to the default output audio device\" option allows to check at startup the audio device on which NVDA sound is output. And, if this device differs from the default device, the output automatically switches to the audio device installed in the system as the main one.\n. 6\nThe next checkbox turns on or off playing the startup sound when the operation is successful.\nThird Party components\nThe add-on uses the following third-party components:\n• For interaction with the Windows Core Audio API - PyCaw module that is distributed under the MIT license.\n• For getting the information about running processes and using the PyCaw component - psutil module that is distributed under BSD-3 license.",
  "https://addons.nvda-project.org/files/get.php?file=unmute",
  "https://addons.nvda-project.org/addons/unmute.\"lng\".html"
 ],
 "Check Input Gestures": [
  "2019.3 and beyond",
  "Find and fix input gestures conflicts in NVDA and add-ons. The general term \"input gestures\" includes keyboard commands, commands entered from Braille keyboards and gestures of touch screens.\nEach of the installed add-ons can make changes to the NVDA configuration by adding or reassigning existing input gestures. If the same input gestures are binded to several functions, it will be impossible to call some of them.\nSearch for duplicate gestures\nTo detect duplicate gestures, call the NVDA menu, go to the \"Tools\" submenu, then - \"Check Input Gestures\" and activate the menu item \"Search for duplicate gestures...\".\nAfter that, all input gestures used in NVDA will be checked in the following order:\n. 1globalCommands;\n. 2globalPlugins.\nIf the same input gestures will be detected, which are assigned to different functions, their list will be displayed in a separate dialog box.\nAfter pressing the Enter key on the selected list item, the corresponding NVDA function will be selected and opened in the standard \"Input Gestures...\" dialog, where you can delete or reassign the associated gesture.\nNote: As you know, features that don't have a text description do not appear in the \"Input Gestures...\" dialog. Therefore, after activating such an element, the corresponding warning will be displayed.\nGestures without description\nTo view the list of gestures binded with functions without a text description, if they are found in your NVDA configuration, you need to call the NVDA menu, go to the submenu \"Tools\", then - \"Gestures without description...\".\nSuch features do not appear in the standard NVDA \"Input Gestures...\" dialog, so it is not yet possible to delete or reassign associated gestures.\nHelp\nOne way to view this help page is to call up the NVDA menu, go to the \"Tools\" submenu, then - \"Check Input Gestures\", and activate \"Help\".\nNote: All features of the add-on are presented in the NVDA \"Input Gestures\" dialog and you can assign your own keyboard shortcuts to each of them.\nContributions\nWe are very grateful to everyone who made the effort to develop, translate and maintain this add-on:\n• Wafiqtaher - Arabic translation;\n• Angelo Miguel Abrantes - Portuguese translation;\n• Cagri Dogan - Turkish translation.",
  "https://addons.nvda-project.org/files/get.php?file=cig",
  "https://addons.nvda-project.org/addons/checkGestures.\"lng\".html"
 ],
 "NVDAUpdate Channel Selector": [
  "2019.1 / 2021.1",
  "This add-on allows you to download and install the latest NVDA version of the chosen type without visiting any webpage nor using your web browser. It is useful when, for example, you want to test new features in a NVDA snapshot and then return back to the most recent stable release. If you test regularly NVDA snapshots and you usually install them in your computer, you will save a lot of time with this add-on. If you prefer testing snapshots in portable mode keeping your installed copy of NVDA unchanged, this add-on is for you as well.\nUsage\nYou can change the NVDA update channel by going to NVDA menu, Preferences, Settings, Update channel category. Once you choose the desired channel and press OK, wait until the next automatic update check or go to NVDA help menu and choose \"Check for updates\" option. For now, these are the available channels:\n• Default: this is the default channel used by your NVDA version. Choosing this option means the same as disabling the add-on.\n• Stable: force update channel to stable. Useful when you want to return to a stable version from a snapshot.\n• Stable, rc and beta: this is the channel for beta releases. You will receive the first beta version once it is released. This channel allows you to update through betas and release candidates until you reach the next stable version.\n• Alpha (snapshots): choose this option to update to the latest alpha. Alpha snapshots allows you to test new features, but they are quite unstable. Please, be careful.\n• Disable updates (not recommended): this option disables the update channel. If you check for updates an error message will be displayed. Remember that you can disable automatic updates from the General settings category. Use this option only with testing purposes.\nInformation about available updates for each channel will be retrieved in the background once the settings panel is opened. Press tab to navigate to a read only edit field, where you can see this information. This information will be dynamically updated when you change the update channel from the combo box. If there is an update available for the selected channel, one or two links will appear next to the edit field:\n• Download: press spacebar on this link to open it in your web browser and download the latest installer.\n• View changelog: press spacebar on this link to open the What's new document in your web browser. For some channels, this link won't be displayed.",
  "https://addons.nvda-project.org/files/get.php?file=updchannelselect",
  "https://addons.nvda-project.org/addons/updateChannelSelector.\"lng\".html"
 ],
 "Proxy support for NVDA": [
  "2019.3 / 2021.1",
  "This add-on allows the NVDA screen reader to connect to the Internet through one or more proxy servers. To make it possible, it applies various patches to the standard Python library or modifies certain environment variables, depending on the chosen configuration. You will be able to update NVDA and their add-ons automatically from your corporate environment and even perform remote sessions, provided that your organization proxy server allows it.\nFeatures\n• Support for various proxy server types: http, socks4 and socks5.\n• Ability to redirect all traffic through the proxy server or only specific traffic (http, https, ftp).\n• Ability to redirect all traffic through a proxy server and, after that, redirect specific traffic through other servers (nested proxies).\n• Profile switch and config reset aware: if you usually work with a portable copy of NVDA, you can create various profiles for different environments (home, work, office1, office2) and manually activate them.\nUsage\nThis add-on adds a new category to the NVDA settings dialog called \"Proxy\". In this category, you will find four settings groups. The first one allows you to configure a general proxy for all traffic. The other groups allow you to configure proxy servers only for specific protocols. All groups have the following fields:\n• Host: hostname or ip address of the proxy server. Leave empty to disable that particular proxy.\n• Port: server port.\n• Username: optional. User name for server autentication.\n• Password: optional. Password for server autentication. Note that password is not required for socks4 servers.\nIn addition to the previous fields, the following options are available in the first settings group:\n• SOCKS proxy type: socks4, socks5 or http can be selected.\n• Use proxy for dns requests if possible: when this checkbox is checked, hostnames or domain names will be directly sent to and resolved on the proxy server. When it is unchecked, names will be resolved locally and the server will receive only the destination ip address. Note that not all socks4 proxy servers support this option.\nTipically, most users will only have to configure the first settings group. If you don't know your proxy details, ask your organization network administrator for more information.\nLimitations\n• Very limited IPV6 support.\n• UDP traffic is not supported on all proxy servers.\n• External DLL libraries won't respect the settings configured in this add-on.\n• Only basic autentication is supported for http proxy servers. Digest autentication is not supported.\n• In order to redirect all traffic (including https connections) through an http proxy, the server must support the CONNECT http method.\n• A \"direct connection\" mode can't be configured. If you disable a specific proxy, the system default will be used instead.",
  "https://addons.nvda-project.org/files/get.php?file=nvdaproxy",
  "https://addons.nvda-project.org/addons/nvdaproxy.\"lng\".html"
 ],
 "WordNav": [
  "2019.3 +",
  "WordNav NVDA add-on improves built-in navigation by word, as well as adds extra word navigation commands with different definition for the word.\nMost text editors support Control+LeftArrow/RightArrow commands for word navigation. However the definition of the word changes from one program to another. This is especially true of modern web-based text editors, such as Monaco. NVDA should know the definition of word in given program in order to speak words correctly. If NVDA doesn't know the exact definition, then either words are going to be skipped, or pronounced multiple times. Moreover, some web-based text editors position the cursor in the end of the word, instead of the beginning, making editing much harder for visually impaired users. In order to combat this problem I have created enhanced word navigation commands, that take the word definition from Notepad++ and they do not rely on program's definition of words, but rather parse lines into words on NVDA's side. The Control+LeftArrow/RightArrow gesture is not even sent to the program, thus ensuring the consistency of the speech.\nPlease note that a prototype of WordNav was formerly a part of Tony's enhancements add-on. Please either uninstall it or upgrade to Tony's enhancements latest stable version to avoid conflicts.\nCurrently WordNav supports four definitions of the word, assigned to different gestures:\n• Left Control+Arrows: Notepad++ definition, that treats alphanumeric characters as words, and adjacent punctuation marks are also treated as words. This should be the most convenient word definition for the majority of users.\n• RightControl+Arrows: Fine word definition splits camelCaseIdentifiers and underscore_separated_identifiers into separate parts, thus allowing the cursor to go into long identifiers.\n• LeftControl+Windows+Arrows: Bulky word definition treats almost all punctuation symbols adjacent to text as part of a single word, therefore it would treat paths like C:\\directory\\subdirectory\file.txt as a single word.\n• RightControl+Windows+Arros: Multiword definition, that groups several words together. The amount of words is configurable.\nGestures can be customized in WordNav settings panel.\nNotes\n• At this time WordNav doesn't modify Control+Shift+LeftArrow/RightArrow gestures to select words, since implementation of such commands are significantly more complicated.\n• If you would like to use virtual desktops feature of Windows 10, please remember to disable Control+Windows+Arrows keyboard shortcuts either in WordNav Settings panel, or in NVDA Input gestures dialog.\n• WordNav doesn't work reliably in VSCode, since due to its internal optimizations, VSCode presents only a few lines of file contents at a time, that change dynamically, and this occasionally interferes with WordNav algorithm.",
  "https://addons.nvda-project.org/files/get.php?file=wordnav",
  "https://addons.nvda-project.org/addons/wordNav.\"lng\".html"
 ],
 "Win Wizard": [
  "2019.3 and beyond",
  "This add-on allows you to perform some operations on the focused window or the process associated with it.\nKeyboard commands:\nAll these commands can be remapped from the Input gestures dialog in the Win Wizard category.\nHiding and showing hidden windows:\n• NVDA+Windows+numbers from 1 to 0 - hides currently focused window in the slot corresponding to the pressed number\n• NVDA+Windows+left arrow - moves to the previous stack of hidden windows.\n• NVDA+Windows+right arrow - moves to the next stack of hidden windows.\n• Windows+Shift+h - hides the currently focused window in the first available slot\n• NVDA+Windows+h - shows the last hidden window\n• Windows+Shift+l - shows the list of all hidden windows grouped by the stacks (please note that by default last hidden window is selected)\nManaging processes:\n• Windows+F4 - kills the process associated with the currently focused window\n• NVDA+Windows+p - opens dialog allowing you to set priority of the process associated with the currently focused window\nMiscellaneous commands:\n• NVDA+Windows+TAB - switches between top level windows of the current program (useful in foobar2000, Back4Sure etc.) Since this command moves the system focus it can be found in the System focus category of the Input gestures dialog.\n• CTRL+ALT+T - allows you to change title of the currently focused program",
  "https://addons.nvda-project.org/files/get.php?file=winwizard",
  "https://addons.nvda-project.org/addons/winWizard.\"lng\".html"
 ],
 "Console Toolkit": [
  "2019.3 and later",
  "Console Toolkit is NVDA add-on, that provides accessibility improvements for Windows console, also known as Command prompt. It also works well in Windows PowerShell. Some of the features may work in alternative terminals, such as Cygwin, PuTTY and Windows Terminal, however, the add-on has only been carefully tested with the default Windows Console. SSH users might find this add-on especially handy.\nSome of the features were previously part of Tony's enhancements add-on.\nDownloads\nConsole toolkit\nReal-time console speech\nThis option makes NVDA to speak new lines immediately as they appear in console output, instead of queueing new speech utterances. For example, if NVDA is busy speaking a line that appeared on the screen 1 minute ago, and now a new line appears, this option will cancel speaking the old line and start speaking the new line right away, thus providing a more real-time feedback on what's happening in console window.\nBeep on console updates\nBeep a low pitch impulse every time console text is updated.\nEnforce Control+V in consoles\nThis option makes Control+V shortcut to work inside ssh sessions.\nExperimental: command prompt editing\nNote: this feature is experimental. Please read this section carefully and make sure you understand how it works before reporting issues.\nPress NVDA+E to identify current prompt in console window and edit it in an accessible \"Edit prompt\" window. After editing you can either press Escape to update current command line, or Enter to update and immediately execute command. Alternatively you can press Alt+F4 to close edit prompt window without updating command line.\nThis feature has been tested in Windows command prompt cmd.exe as well as in bash shell over ssh connections, as well as in WSL and cygwin. It might also work in alternative Unix shells, however it hasn't been tested.\nHere is how add-on extracts current command.\n. 1It presses End key and then sends a control character, that is a rare Unicodecharacter not likely to be used anywhere.\n. 2Then it presses home key and sends another control character.\n. 3Then it waits for control characters to appear on the screen, which might take some time on slow SSH connections.\n. 4Command is what appears between two control characters.\n. 5When \"Use UI Automation to access the Windows Console when available\" option is enabled in NVDA settings, it sends one more control character in the beginning of the string. This is needed to parse multiline commands correctly: UIA implementation trims whitespaces in the end of each line, so in order to deduce whether there is a space between two lines, we need to shift them by one character. Please note, however, that this way we don't preserve the number of spaces between words, we only guarantee to preserve the presence of spaces.\n. 6Before editing add-on makes sure to remove control characters by placing cursor in the beginning and end and simulating Delete and Backspace key presses.\n. 7It presents command in \"Edit prompt\" window for user to view or edit.\n. 8\nAfter user presses Enter or Escape,it first erases current line in the console. This is achieved via one of four methods, the choice of the method is configurable. Currently four methods are supported:\n• Control+C: works in both cmd.exe and bash, but leaves previous prompt visible on the screen; doesn't work in emacs; sometimes unreliable on slow SSH connections\n• Escape: works only in cmd.exe\"),\n• Control+A Control+K: works in bash and emacs; doesn't work in cmd.exe\n• Backspace (recommended): works in all environments; however slower and may cause corruption if the length of the line has changed\n. 9\nThen add-on simulates keystrokes to type the updated command and optionally simulates Enter key press.\nTroubleshooting:\n• Verify that 'Home', 'End', 'Delete' and 'Backspace' keys work as expected in your console.\n• Verify that your console supports Unicode characters. Some ssh connections don't support Unicode.\n• Verify that selected deleting method works in your console.\nExperimental: capturing command output\nNote: this feature is experimental. Please read this section carefully and make sure you understand how it works before reporting issues.\nWhile in command line or in \"Edit prompt\" window, press Control+Enter to capture command output. This add-on is capable of capturing large output that spans multiple screens, although when output is larger than 10 screens capturing process takes significant time to complete. Add-on will play a long chime sound, and it will last as long as the add-on is capturing the output of currently running command, or until timeout has been reached. Alternatively, press NVDA+E to interrupt capturing.\nWhen \"Use UI Automation to access the Windows Console when available\" feature is enabled in NVDA settings, you can switch to other windows while capturing is going on. However, if this option is disabled, then NVDA is using a legacy console code, that only works when consoel is focused, and therefore switching to any other window will pause capturing.\nCommand capturing works by redirecting command output to less command. Default suffix that is appended to commands is: |less -c 2>&1 Please only change it if you know what you're doing. This add-on knows how to interact with the output of less command to retrieve output page by page.\nOn Windows less.exe tool needs to be installed separately. You can install it via cygwin, or download a windows binary elsewhere.\nIf you are using tmux or screen in Linux, please make sure that no status line is displayed in the bottom. In tmux run tmux set status off to get rid of status line, or modify your tmux.conf file.\nTroubleshooting:\n• After a failed output capturing attempt, press UpArrow in the console to check what command has actually been executed.\n• Revert back to default capturing suffix, mentioned above.\n• Try troubleshooting steps from \"command prompt editing\" section.",
  "https://addons.nvda-project.org/files/get.php?file=consoletoolkit",
  "https://addons.nvda-project.org/addons/consoleToolkit.\"lng\".html"
 ],
 "Quick Dictionary": [
  "2019.3 / 2020.3",
  "Welcome to NVDA Quick Dictionary addon, which will allow you to quickly get a dictionary article with the translation of a word or phrase into your chosen language by pressing a key combination. There are few basic keyboard shortcuts and they are all intuitive and convenient so you will remember them quickly.\nDictionary articles contain detailed information about a word, such as part of speech, gender, plural or singular, translation options, list of meanings, synonyms and detailed examples. Such information will be useful for people who are learning foreign languages, or seek to use in communication all the richness and diversity of their own language.\nThe add-on supports several online dictionary services. You can select the desired remote dictionary in the appropriate dialog box or by using keyboard shortcuts. Each available service has its own settings panel.\nThere are also advanced opportunities for working with profiles of the voice synthesizers. You can associate a voice synthesizer profile with a specific language, after that translations into this language will be automatically voiced by the selected synthesizer.\nBelow are all the features of the add-on and keyboard shortcuts to control them. By default all functions are called using two-layer commands. But for any of these methods you can always assign convenient for you keyboard shortcuts. You can do it in the NVDA \"Preferences\" -> \"Input gestures...\" dialog.\nReceiving a dictionary article\nIn order to get an article from the dictionary, you must first select the word you are interested in or copy it to the clipboard. Then just press NVDA+Y twice. There is also another way to get a dictionary entry: pressing NVDA+Y once switches the keyboard to add-on control mode, then just use the D key.\nAdd-on control mode\nTo access all the features of the add-on, you need to switch to add-on control mode, you can do this by pressing NVDA+Y once. You will hear a short low beep and will be able to use the other commands described below. When you press a key that is not used in the add-on, you will hear another signal notifying you of an erroneous command and the add-on control mode will be automatically turned off.\nAdd-on commands list\nBasic dictionary commands:\n• D - announce a dictionary entry for a selected word or phrase (same as NVDA+Y);\n• W - show dictionary entry in a separate browseable window;\n• S - swap languages and get Quick Dictionary translation;\n• A - announce the current source and target languages;\n• C - copy last dictionary entry to the clipboard;\n• E - edit text before sending;\n• U - download from online dictionary and save the current list of available languages;\n• function keys - select online dictionary service;\n• Q - statistics on the using the online service;\n• F - choose online service.\nVoice synthesizers profiles management:\n• from 1 to 9 - selection of the voice synthesizer profile;\n• G - announce the selected profile of voice synthesizers;\n• B - back to previous voice synthesizer;\n• R - restore default voice synthesizer;\n• Del - delete the selected voice synthesizer profile;\n• V - save configured voice synthesizer profile;\n• P - display a list of all customized voice synthesizers profiles.\nPress O to open add-on settings dialog.\nHelp on add-on commands\nYou can see a list of all the commands used in the add-on as follows:\n• Via the NVDA menu - by pressing NVDA+N, go to the submenu \"Tools\", then - \"Quick Dictionary\" and activate the menu item \"Help on add-on commands\".\n• Press the H key in add-on control mode (NVDA+Y).\nAdd-on help\nTo open the add-on help - press NVDA+N, go to the \"Tools\" submenu, then - \"Quick Dictionary\" and activate the menu item \"Help\".\nContributions\nWe are very grateful to everyone who made the effort to develop, translate and maintain this add-on:\n• Cagri Dogan - Turkish translation;\n• Wafiqtaher - Arabic translation.\nSeveral good solutions from other developments were used in the Quick Dictionary add-on. Thanks to the authors of the following add-ons:\n• Instant Translate - Alexy Sadovoy, Beqa Gozalishvili, Mesar Hameed, Alberto Buffolino and other NVDA contributors.\n• To work with voice synthesizers profiles were used ideas from the Switch Synth add-on (thanks to Tyler Spivey).",
  "https://addons.nvda-project.org/files/get.php?file=quickdictionary",
  "https://addons.nvda-project.org/addons/quickDictionary.\"lng\".html"
 ],
 "Numpad Nav Mode": [
  "unnown",
  "Numpad Nav Mode is an NVDA add-on, which allows you to easily switch your keyboard's numpad between NVDA's navigation controls and the non-screenreader Windows navigation controls.\nThe normal functions of the PC number pad, with numlock off, are: page up, page down, home, end, four-way arrow keys, and a delete key. But NVDA completely takes over the numpad, to provide review keys, mouse controls, and object navigation controls. This is true even in laptop keyboard mode, which duplicates those functions on non-numpad keys for those who do not have a numpad.\nHowever some users do have a numpad on their laptop, and would prefer to use it for Windows navigation purposes, especially because some laptops do not provide home, end, or other such keys. That is where this add-on can help. Additionally, some desktop users may sometimes find it convenient to use the numpad for those keyboard functions rather than the normal keys, which this add-on enables.\nHow it works\nWith numlock off, no matter what keyboard layout you are using, this add-on will let you press Alt+NVDA+NumpadPlus (which is usually the long key second up on the right), to quickly and easily switch between the normal NVDA navigation controls, and the classic Windows navigation controls. This key can be remapped under Input Gestures, in the Input section.\nNote that this add-on doesn't disable the use of numpad insert as an NVDA modifier, if you have it set as such. If you want that feature, please let me know, although you can manually turn off numpad insert as a modifier in NVDA keyboard settings.\nIf you would prefer to have NVDA start with the Windows nav mode active by default, you can configure that in NVDA configuration. Go to NVDA's preferences, then settings, and find the Numpad Nav Mode settings panel. There you will be able to select a checkbox to turn Windows Nav Mode on by default when you start NVDA. To get there quickly, press NVDA+N, P, S, then N one or more times until you hear \"Numpad Nav Mode\".",
  "https://addons.nvda-project.org/files/get.php?file=numpadNav",
  "https://addons.nvda-project.org/addons/numpadNavMode.\"lng\".html"
 ],
 "Zoom Accessibility Enhancements": [
  "2018.4 / 2020.2",
  "This add-on improves the experience of using Zoom for NVDA users by providing keyboard shortcuts to Handle alerts for Different events While In a meeting, make the process of remote control much more accessible and smoother, and more.\nkeyboard shortcuts for controlling alerts In meetings\n• \nNVDA + Shift + A: cycles between different modes of reporting alerts. The following modes are available:\n• Report all alerts mode, where all alerts are reported as usual\n• Beep for alerts, where NVDA will play a short beep for every alert displayed in Zoom\n• Silence all alerts, where NVDA will ignore all alerts\n• Custom mode, Where the user can customize which alerts they want to have and which not. This can be done using the settings dialog of the add-on, or by using the dedicated keyboard shortcuts for that\nThe following shortcuts can be used to toggle on / off the announcements of each type of alert (note that this will be effective when custom mode is selected):\n• NVDA + Ctrl + 1: Participant Has Joined/Left Meeting (Host Only)\n• NVDA + Ctrl + 2: Participant Has Joined/Left Waiting Room (Host Only)\n• NVDA + Ctrl + 3: Audio Muted by Host\n• NVDA + Ctrl + 4: Video Stopped by Host\n• NVDA + Ctrl + 5: Screen Sharing Started/Stopped by a Participant\n• NVDA + Ctrl + 6: Recording Permission Granted/Revoked\n• NVDA + Ctrl + 7: Public In-meeting Chat Received\n• NVDA + Ctrl + 8: Private In-meeting Chat Received\n• NVDA + Ctrl + 9: In-meeting File Upload Completed\n• NVDA + Ctrl + 0: Host Privilege Granted/Revoked\n• NVDA + Shift + Ctrl + 1: Participant Has Raised/Lowered Hand (Host Only)\n• NVDA + Shift + Ctrl + 2: Remote Control Permission Granted/Revoked\n• NVDA + Shift + Ctrl + 3: IM chat message received\nNote that you need to leave reporting all alert types selected (in Zoom accessibility settings) to have the add-on function as expected.\nKeyboard shortcut for Opening add on Dialogue\nNVDA + Z Opens the add-on dialog !\nUsing this dialog you can :\n• See which alerts are announced and which aren't\n• Select the types of the alerts you want to be announced\n• Choose alerts reporting mode\n• Save custom changes\nRemote control\nafter a remote control permission is granted, NVDA + O will move the focus in /Out of the remote controlled screen\nNote that the focus should be on one of the meeting controls to be able to remote control the other screen\nAn Important note\nCurrently the feature of custom alerts mode where the user can choose which alerts they want to have and which not works with Zoom only when the user interface language is set to english.",
  "https://addons.nvda-project.org/files/get.php?file=zoom",
  "https://addons.nvda-project.org/addons/zoomEnhancements.\"lng\".html"
 ],
 "Kill NVDA": [
  "2019.2 / 2019.3",
  "This add-on is designed to temporarily kill NVDA, so that you can recover if it freezes.\nUsage\n. 1Install this add-on.\n. 2Copy it to the logon screen with the button in General Settings.\n. 3When NVDA dies, press control alt delete, then activate the NVDA menu, Tools, Kill NVDA.\nAfter that, press escape. NVDA restarts, but you should be able to use your computer again.",
  "https://addons.nvda-project.org/files/get.php?file=killnvda",
  "https://addons.nvda-project.org/addons/killNVDA.\"lng\".html"
 ],
 "Time Zoner": [
  "2019.2.1 +",
  "An add-on for NVDA to announce the time in selected timezones.\nIntroduction\nFor a very long time now, Windows has had the ability to show multiple clocks from different timezones. Users can customize the clocks and they become instantly visible.\nUnfortunately, for users of screen readers such as NVDA or JAWS, there is no simple way to get this information. These screen readers don't support additional clocks, so blind computer users have to resort to other, third-party solutions, some of which are paid.\nA lot of the work I do involves working across timezones, and eventually I got tired of manually converting times in my head, especially for timezones that aren't aligned to the hour (such as India which is +5:30 UTC).\nFor these reasons, I've created this add-on for NVDA. The add-on lets you hear times in selected timezones through the use of the timezone ring.\nUsage\nThe add-on supports both the legacy and the Python 3 version of NVDA.\nOnce the add-on is installed, press NVDA+N to bring up NVDA's context menu. Arrow down to \"Preferences\" and then up to \"Time Zoner\".\nPress ENTER on \"Configure timezone ring\".\nYou will be presented with a dialog to set the timezones for which you want the time and date announced.\nSelect items in the timezone list to add them to your timezone ring. Deselect (or press the Remove button) to delete them from the ring.\nYou can also reorder the timezones in the ring by using the Move Up and Move Down buttons.\nUse the \"Filter\" box to search for specific timezones.\nCheck the \"Announce abbreviated timezones\" box to hear abbreviated timezone names such as IST or GMT. Uncheck the box to hear the full timezone names such as Asia/Kolkata or Europe/London.\nWhen you are finished configuring the timezones, press the Save button.\nFrom here on, you can press NVDA+Alt+T to announce times and dates in your timezone ring.\nWhen you first install the add-on, NVDA will default to your local timezone if it can get it.\nChange Log\nVersion 1.03, released on 03/21/2020\n• The add-on no longer crashes if the default timezone can't be set.\n• Fixed an issue with relative links in the documentation.\nVersion 1.02, released on 03/18/2020\n• When installing a new version of this add-on, the settings from a previous installation are no longer lost.\n• Other changes to conform to NVDA add-on standard compliance.\nVersion 1.01, released on 03/12/2020\n• The time and date are announced in the user's locale, meaning that 24-hour time is honored if set.\n• NVDA will announce either the abbreviated or full timezone depending on the user's setting in the Timezone Ring dialog. For example, it will either say Europe/London, or it will say GMT or BST. This setting is controlled by checking or unchecking the \"Announce abbreviated timezones\" checkbox.\n• Add-on includes translator comments (@ruifontes).\n• Add-on now includes header comments (@ruifontes).\n• The Escape key closes the Timezone Ring dialog (@ruifontes).\n• The menu item to open the Timezone Ring dialog is now named appropriately (@ruifontes).\n• NVDA now defaults to the local timezone on installation of this add-on, if the local timezone is available.\n• Support for multiple timezones through the use of a timezone ring.\n• This add-on now uses the key NVDA+Alt+T to prevent conflict with the Clock add-on.\n• The timezone selector dialog now has a filter box. NVDA will announce the number of results as the user starts typing into the filter field.\n• Python 2 support\n• The date and time is now announced in a separate thread to prevent hanging the NVDA thread in case retrieval takes a little while.\n• The timezone selector dialog now has a Cancel button and no longer prevents NVDA from shutting down.",
  "https://addons.nvda-project.org/files/get.php?file=tz",
  "https://addons.nvda-project.org/addons/timeZoner.\"lng\".html"
 ],
 "Tony's enhancements": [
  "2019.3",
  "This add-on contains a number of small improvements to NVDA screen reader, each of them too small to deserve a separate add-on.\nThis add-on is only compatible with NVDA versions 2019.3 and above.\nEnhanced table navigation commands\n• Control+Alt+Home/End - jump to the first/last column in the table.\n• Control+Alt+PageUp/PageDown - jump to the first/last row in the table.\n• NVDA+Control+digit - jump to 1st/2nd/3rd/... 10th column in the table.\n• NVDA+Alt+digit - jump to 1st/2nd/3rd/... 10th row in the table.\n• NVDA+Shift+DownArrow - read current column in the table starting from current cell down.\nDynamic keystrokes\nYou can assign certain keystrokes to be dynamic. After issuing such a keystroke, NVDA will be checking currently focused window for any updates and if the line is updated, NVDA will speak it automatically. For example, certain keystrokes in text editors should be marked dynamic, such as Jump to bookmark, jump to another line and debugging keystrokes,such as step into/step over.\nThe format of dynamic keystrokes table is simple: every line contains a rule in the following format:\n\nappName keystroke\nwhere appName is the name of the application where this keystroke is marked dynamic (or * to b marked dynamic in all applications), andkeystroke is a keystroke in NVDA format, for example, control+alt+shift+pagedown.\nReal-time console output\nThis option is disabled by default and must be enabled in the settings.\nThis option makes NVDA to speak new lines immediately as they appear in console output, instead of queueing new speech utterances.\nThere is also an option to beep on command line updates - this would give you a better idea when new lines are printed in the console.\nBeep when NVDA is busy\nCheck this option for NVDA to provide audio feedback when NVDA is busy. NVDA being busy does not necessarily indicate a problem with NVDA, but rather this is a signal to the user that any NVDA commands will not be processed immediately.\nNVDA volume\n• NVDA+Control+PageUp/PageDown - adjust NVDA volume.\nThis option controls the volume of NVDA speech as well as all the other sounds and beeps produced by NVDA. The advantage of this option compared to adjusting volume of a speech synthesizer, is that it affects the volume of all the beeps proportionally.\nBlocking double insert keystroke\nIn NVDA pressing Insert key twice in a row toggles insert mode in applications. However, sometimes it happens accidentally and it triggers insert mode. Since this is a special keystroke, it cannot be disabled in the settings. This add-on provides a way to block this keyboard shortcut. When double insert is blocked, insert mode can stil be toggled by pressing NVDA+F2 and then Insert.\nThis option is disabled by default and must be enabled in the settings.",
  "https://addons.nvda-project.org/files/get.php?file=tony",
  "https://addons.nvda-project.org/addons/tonysEnhancements.\"lng\".html"
 ],
 "Phonetic Punctuation": [
  "2019.3",
  "Phonetic punctuation is an NVDA add-on that allows to convert punctuation signs into audio icons. In general, it can also convert any regular expressions into audio icons.\nDemo\nYou can listen to a sample speech output with phonetic punctuation here (10 seconds audio): https://soundcloud.com/user-977282820/nvda-phonetic-punctuation-demo\nUsage\n. 1Make sure that your symbol level is set to appropriate value. If you're not sure, then press NVDA+P several times until you select \"Symbol level all\".\n. 2Make sure phonetic punctuation is enabled. Press NVDA+Alt+P to enable.\n. 3Phonetic punctuation rules can be configured via a dialog box in NVDA preferences menu.\n. 4Phonetic punctuation comes with a set of predefined audio rules. However, only a few of them are enabled by default. You can enable other rules, as well as add new rules in the configuration dialog.\n. 5Audio rules are saved in a file called phoneticPunctuationRules.json in NVDA user configuration directory.\nSupported voice synthesizers\nPhonetic punctuation depends on new NVDA speech framework, and as of today (October 2019), not all voice synthesizers have proper support for the new commands. This means that phonetic punctuation might not work correctly with some voice synthesizers.\nSynthesizers known to work well with Phonetic Punctuation:\n• Microsoft Speech API\n• eSpeak\n• Windows OneCore Voices\nSynthesizers known to have problems with PhoneticPunctuation:\n• IBMTTS: see this issue.\n• RHVoice: Break command is not supported.",
  "https://addons.nvda-project.org/files/get.php?file=phoneticpunc",
  "https://addons.nvda-project.org/addons/phoneticPunctuation.\"lng\".html"
 ],
 "Percentage Checker": [
  "2019.2 / 2019.3",
  "This add-on allows you to check how far - in percents - you are in the text or on a list. This information can be given either by spoken message, or by a beep. In addition you can jump to the given percentage or a line number in the text.\nKey Commands:\n• Shift+NVDA+j: Displays a dialog allowing you to jump to the given line number.\n• Shift+NVDA+p: Announces percentage in the current text or on a list. In addition if you are in a text the amount of words in the field would be spoken. In case of a list this would be amount of all list items.\n• Alt+NVDA+p: Presents your position in a text or on a list as a beep.\nThe two last commands can be pressed twice in quick succession to display a dialog allowing you to jump to a given percentage in a text. All these commands can be remapped from the input gestures dialog.",
  "https://addons.nvda-project.org/files/get.php?file=perChk",
  "https://addons.nvda-project.org/addons/percentageChecker.\"lng\".html"
 ],
 "Report Passwords": [
  "2019.3 +",
  "This add-on adds the option of speaking the text typed in protected controls like passwords, such as when logging into web-based email sites, where typed characters are spoken as asterisks.\nNote: NVDA has an option to configure if typed passwords will be spoken in Windows terminals. This add-on won't affect those kinds of controls.\nHow to configure\nThe add-on can be configured from its category in the NVDA's settings dialog, under NVDA's menu, Preferences submenu. A gesture for opening the add-on settings panel can be assigned from Input gestures dialog, configuration category.\nTip: If you have not configured NVDA to speak typed characters or words but want to hear typed text in passwords, you may create a configuration profile to enable the speaking of typed characters and passwords, and assign it to a gesture or create a trigger to enable it automatically in certain situations. For convenience, NVDA will ask if you want to create a dedicated profile when the add-on is installed.",
  "http://addons.nvda-project.org/files/get.php?file=rp",
  "https://addons.nvda-project.org/addons/reportPasswords.\"lng\".html"
 ],
 "Audio Themes": [
  "unknown",
  "This add-on creates a virtual audio display that plays sounds when focusing or navigating objects (such as buttons, links etc...) the audio will be played in a location that corresponds to the object's location in the visual display.\nThe add-on also enables you to activate, install, remove, edit, create, and distribute audio theme packages.\nUsage\nThis add-on enables you to perform three distinct tasks, including managing your installed audio themes, editing the currently active audio theme, and creating a new audio theme.\nYou can access these functions from the add-on's menu which is found in the main NVDA menu.\nManaging Your Audio Themes\n• The 'Manage Audio Themes' dialogue enables you to activate or deactivate audio themes, in addition to installing and removing audio themes.\n• In this dialogue there are some additional options including:\n• Play sounds in 3D mode: When you uncheck this box the add-on will play the sounds in mono mode (always in the centre of the audio display) regardless of the object location.\n• Speak role such as button, edit box , link etc.: When you uncheck this box NVDA will start announcing the role when focusing objects rather than ignoring it (which is the default behaviour when installing this add-on).\n• Use Synthesizer Volume: Checking this box will set the sound player of this add-on to use the active voice sound, thus making all audible output the same as the voice volume when ever you change that volume.\n• Audio Theme Volume Slider: Alternatively you can set the volume for the add-on using this slider. Setting it to 0 will mute all sounds, and 100 is the maximum volume.\nEditing The Active Audio Theme:\n• When you click on the 'Edit the active audio theme' option, a dialogue will open with a list containing all the sounds contained in the currently active theme. From this dialogue you can:\n• Change Selected: Selecting a sound from the list and clicking this button, will open a standard open file dialogue, select an ogg or wave audio file from your file system to replace the selected sound, and click OK to complete the process.\n• Remove Selected: This will remove the selected sound from the theme, click 'Yes' to confirm the removal process, and the selected sound will be removed.\n• Add New Sound: When clicking this button a new dialogue will be shown. From the first combo box in the newly opened dialogue select the object type you want to assign the sound to it, for example (button, link, tab, menu and so on), then click the 'Browse to an audio file' button to select the sound you want to assign for the previously selected object type. Optionally you can click the preview button to preview the sound, and finally clicking the OK button will apply the changes and assign the selected sound to the selected object.\n• Close: Will exit the dialogue without performing any action.\nCreating A New Audio Theme\n• If you have a good sound production skills you can apply them here and create an audio theme of your own, rather than editing an existing one. To do this you can follow these steps. - Collect your audio files in one place, they must be in ogg or wave format, and rename them to what ever make sense to you. For example when I was creating the default audio theme for this add-on, I grouped sounds according to interaction patterns, for example, the combo box, the drop down button, and the split button can all have the same sound, while the Check box, The toggle button, and the menu check item can have the same sound. - From the add-on menu click 'Create a new audio theme' - A dialogue will be opened asking you for some information about your new audio theme, including: * Theme Name : The name of your theme which will be shown in the audio themes manager. This must be a valid windows folder name. * Your Name: Enter your real name or a nick name.\n• Theme description : A Brief description about your audio theme. - Click OK to move to the next step. - In the next step a dialogue similar to the 'Audio Themes Editor' will be shown, and from their the process is the same as the Theme editing process, so refer to 'Editing The Active Audio Theme' section.\nCopyright:\nCopyright (c) 2014-2016 Musharraf Omer and Others\nAlthough this add-on was started as an independent project, it evolved to be an enhanced version of the 'Unspoken' add-on by Austin Hicks and Bryan Smart. The majority of this add-on's development went into creating the tools to manage, edit and create audio theme packages. So a big thank you to them for creating such a wonderful add-on, and making it available for us to build on top of their work.\nA Note on Third-party audio files:\nThe Default audio theme package in this add-on uses sounds from several sources, here is a breakdown for them: - Unspoken 3D Audio: An add-on for NVDA - TWBlue: A free and open source twitter client - Mushy TalkBack: An alternative talkback with better sounds.",
  "https://addons.nvda-project.org/files/get.php?file=ath",
  "https://addons.nvda-project.org/addons/AudioThemes.\"lng\".html"
 ],
 "Synth ring settings selector": [
  "2019.2",
  "This add-on allows the user to select which settings should appear on the synth settings ring.\nFeatures\nThis add-on provides the following features:\n• A category panel in the NVDA settings to select which settings you want to include in the synth settings ring.\n• save specific settings for each profile.\n• overrides the default synth driver settings that are shown in the synth settings ring.\nRequirements\nYou need NVDA 2019.2 or later.\nInstallation\nJust install it as a NVDA add-on.\nUsage\nTo enable or disable which settings are included, go to NVDA settings and select \"Synth ring settings selector\" category. In that category you can configure all supported features by this add-on. Settings included by default:\n• language.\n• voice.\n• variant.\n• rate.\n• rate boost.\n• volume.\n• pitch.\n• inflection.\nNote: This dialog shows the supported settings by the current synthesizer only. Settings not present here aren't modified in the add-on config.",
  "https://addons.nvda-project.org/files/get.php?file=synthrings",
  "https://addons.nvda-project.org/addons/synthRingSettingsSelector.\"lng\".html"
 ],
 "Debug Helper": [
  "unknown",
  "The purpose of this add-on is to make debugging things in NVDA easier. New features will be added based on user suggestions. All emails or GitHub issues with feedback or feature ideas are most welcome.\nKey Command\n• NVDA+Shift+F1: Inserts a mark line in the NVDA log.\nExplanation and Usage\nWhen you press the command key, the add-on inserts a line like the following in the NVDA log (at the Info level):\n-- Mark 1 --\nIt will also announce: \"Logged Mark 1!\"\nIf you press the key again, you will get:\n-- Mark 2 --\nand \"Logged Mark 2!\" will be spoken.\nLet us say for example that you were about to perform a series of tasks, that you know generate lengthy error content in the NVDA log. You are going to post the relevant portions of your log to a mailing list or the NVDA GitHub issue tracker. However you don't want to hunt through your entire log to find the relevant content. So you use this add-on to insert mark 1, right before you do the thing that causes the first error. If you know something else will generate further errors, or a different kind, you insert another mark to separate that error from the previous one, or so you can say \"this is what I was doing at mark 3, where some errors occurred.\" Another example: While using some application, something happens that causes an error (maybe you hear the Windows error sound). You want to go back and find that error later, but you don't want to stop working and save the log right now. So you use this add-on again, to insert a mark in your log. This time the mark will appear after the errors in your log, instead of before. But either way, the marks will help you narrow down the important sections of your log.\nThe mark lines shown above can be easily searched for with the find command in a text editor such as Notepad or Notepad++. Additionally, by default, there is a blank line inserted above each mark. Blank lines are also possible after the mark. Blank lines can be helpful if you are using NVDA's log viewer, or another text editor, and want to use the arrow keys to quickly read up/down through the log, to find a particular mark. It is easy to pick the word \"blank\" out of a bunch of text being spoken as you quickly move through the log. If you arrow really fast, you might need more than one blank line, which you can adjust in settings.\nNote: The mark count will survive the reloading of plugins (NVDA+Control+F3), but will start back at one if you restart NVDA.\nConfiguration:\nIn the Settings section of NVDA Preferences, you will find a \"Debug Helper\" category. In the settings dialog you can change the number of blank lines inserted before and after each mark line. The default is one line before, and zero after, although you can use 0 through 10 lines for either. Under the Tools category of NVDA's Input Gestures panel, you can change NVDA+Shift+F1 to a key sequence of your choice.\nChangelog\n• \nVersion 1.0.2 (2019-08-28)\n• Translation and code cleanup.\n• \nVersion 1.0.1 (2019-08-26)\n• Minor bugfix version to probably fix an install problem on certain versions of Windows.\n• \nVersion 1.0 (2019-08-22)\n• \nInitial release. Including following features:\n• Ability to generate numbered mark lines in the log (at info level).\n• Ability to add 0-10 blank lines before and after each mark line.\n• Configuration via NVDA settings dialog system.",
  "https://addons.nvda-project.org/files/get.php?file=debughelper",
  "https://addons.nvda-project.org/addons/debugHelper.\"lng\".html"
 ],
 "Notepad++": [
  "unknown",
  "This addon improves the accessibility of the notepad++ text editor. To learn more, and to read the documentation before installation, https://github.com/derekriemer/nvda-notepadplusplus visit the addons github page https://github.com/derekriemer/nvda-notepadplusplus",
  "https://files.derekriemer.com/NotepadPlusPlus-2019.09.0.nvda-addon",
  "https://addons.nvda-project.org/addons/notepadPlusPlus.\"lng\".html"
 ],
 "Beep Keyboard": [
  "2018.2 to 2019.2",
  "This add-on allows the user to configure NVDA to beeps with some keyboard events.\nFeatures\nThis add-on provides the following features you can use to adapt NVDA keyboard behavior:\n• Beep for uppercases when caps lock is on: if this feature is enabled, NVDA will beep when you typing an uppercase and caps lock is on. Don't make any more uppercase mistakes!\n• Beep for typed characters when shift is pressed: with this feature NVDA will beep if you type a character with shift key pressed.\n• Beep for toggle keys changes: with this feature, NVDA will beep higher if a toggle key goes on, and lower tone if it goes off. Please note that Windows has a toggle keys beep function built-in on Ease of Access Center. This native feature works well if you don't use laptop keyboard layout setting.\n• Announce toggle keys changes: just when \"Beep for toggle keys changes\" is on. You can enable or disable NVDA to announce toggle key status.\n• Beep for specified characters: NVDA will beep for all characters that you set in advanced settings.\n• Disable beeping on password fields: this feature is enabled by default to aboid security risks. Disable it if you want to hear beeps on password fields.\nRequirements\nYou need NVDA 2018.2 or later.\nInstallation\nJust install it as a NVDA add-on.\nUsage\nTo enable or disable features, go to NVDA settings and select beep keyboard category. In that category you can configure all supported features by this add-on.\n• \"Beep for uppercases when caps lock is on\" is enabled by default.\nIf you need more settings, open the advanced settings dialog that contains the following options:\n• Ignored characters with shift pressed: all characters here will be ignored to beeping when shift is pressed. Escape Sequences are allowed, e.g. \"\t\" for tab, \"\r\" for carriage return.\n• Beep always for the following characters: set here all characters that you want NVDA beeps for. Escape Sequences are allowed, e.g. \"\t\" for tab, \"\r\" for carriage return.\n• Select tone to configure: you can configure parameters for all tones. Select one here, and set the parameters in the next text boxes. When change selection, NVDA will beep for the current selected tone with the current parameters set in the dialog.\n• Tone pitch: tone pitch for the current selected tone.\n• Tone length: tone length for the current selected tone.\n• Tone volume: tone volume for the current selected tone.\n• Test tone: this button lets you to play a test with the current set parameters.\n• Press OK button to save settings or cancel to discard.",
  "https://addons.nvda-project.org/files/get.php?file=beepkeyboard",
  "https://addons.nvda-project.org/addons/beepKeyboard.\"lng\".html"
 ],
 "Developer Toolkit": [
  "2019.1 / 2020.1",
  "Developer toolkit (DTK) is an NVDA add-on that helps blind and visually impaired developers independently create visually appealing user interfaces and web content. It provides gestures that enable you to navigate through objects and obtain information about them, such as their size, position, and characteristics. To begin using DTK, place focus on a control, then press ALT+WINDOWS+K. To disable it, press ALT+WINDOWS+K again. When on the web, press NVDA+SPACE to put NVDA in Focus Mode and press NVDA+SHIFT+SPACE to disable Single Letter Navigation.\nGestures\nThe following gestures are available when DTK is enabled.\n• ALT+WINDOWS+K - Enable or disable DTK features.\n• LEFT ARROW - Move to previous sibling.\n• RIGHT ARROW - Move to next sibling.\n• UP ARROW - Move to parent.\n• DOWN ARROW - Move to first child.\n• CTRL+HOME - Move to top-most parent.\n• HOME - Move to the relative parent if one is assigned.\n• A - In web content, speak HTML attributes. Press twice quickly to copy to the clipboard.\n• B - Speak the position of the object's bottom edge. Press twice quickly to copy to the clipboard.\n• SHIFT+B - Speak the distance between the object's bottom edge and the relative parent's bottom edge. Press twice quickly to copy to the clipboard.\n• C - Speak the number of children contained inside the object. Press twice quickly to copy to the clipboard.\n• control+c - Switch between RGB, Hex, and Name color values.\n• CTRL+D - Enable or disable detailed messages.\n• F - In web content, speaks the object's font and formatting information. Press twice quickly to copy to the clipboard.\n• H - Speak the object's height. Press twice quickly to copy to the clipboard.\n• L - Speak the position of the object's left edge. Press twice quickly to copy to the clipboard.\n• n - Speak the object's name. Press twice quickly to copy to the clipboard.\n• CTRL+P - Set the relative parent for obtaining size/location of objects.\n• P - Speak the relative parent's name. Press twice quickly to copy to the clipboard.\n• R - Speak the position of the object's right edge. Press twice quickly to copy to the clipboard.\n• SHIFT+R - Speak the distance between the object's right edge and the relative parent's right edge. Press twice quickly to copy to the clipboard.\n• ALT+R - Speak the object's Role/control type. Press twice quickly to copy it to the clipboard.\n• S - Speak the number of siblings relative to the object. Press twice quickly to copy to the clipboard.\n• SHIFT+S - Speak the object's control states. Press twice quickly to copy it to the clipboard.\n• T - Speak the position of the object's top edge. Press twice quickly to copy to the clipboard.\n• V - Speak Developer toolkit version. Press twice quickly to copy to the clipboard.\n• W - Speak the object's width. Press twice quickly to copy to the clipboard.\nNotes\n• When using home or any modified version of the home key, using the numpad home key fails because NVDA will send the numpad7 keypress instead of a numpadHome keypress. Other keyboard add-ons that attempt to reassign numpad7 to the home key will fail in this add-on.\n• \nWhen using the relative parent feature, DTK will set the relative parent to the desktop under the following conditions.\n• The focused object and the relative parent are the same.\n• The relative parent is not a direct ancestor of the focused object.\n• \nDTK cannot access information such as CSS rules, padding, borders, or z-index. Doing so requires accessing them outside of the NVDA context, which presents a security concern for users.\nKnown issues\n• The customizable list of font attributes found in Developer toolkit settings may be cumbersome to use. This is a limitation found in NVDA's user interface library.",
  "https://addons.nvda-project.org/files/get.php?file=devtoolkit",
  "https://addons.nvda-project.org/addons/developerToolkit.\"lng\".html"
 ],
 "Add-ons documentation": [
  "2017.3 / 2019.2",
  "This add-on provides a quick way to access documentation for the add-ons you have installed. It creates, in the NVDA Help menu, two sub-menus. One, called \"Running add-ons documentation\", groups the documentation for each add-on and make available a list of commands for all running add-ons, with a table for each add-on. Other sub-menu called \"Disabled add-ons documentation\", lists the disabled add-ons, giving access to its documentation. Please, remember that the Synth and Braille drivers add-ons will not appear in any of the above categories. Note that you also can access the add-ons documentation through the Add-ons manager in NVDA, Tools menu. Here you have also the information about the state of an add-on. Also remember that you can access the NVDA and add-ons commands in the Input gestures dialog. However, in this dialog the add-ons commands are not grouped and you can not find a command containing \"windows\", by instance...",
  "https://addons.nvda-project.org/files/get.php?file=addonshelp",
  "https://addons.nvda-project.org/addons/addonsHelp.\"lng\".html"
 ],
 "Character Information": [
  "2017.3 / 2021.1",
  "This add-on allows to present in a message character information such as unicode name, number, category, etc.\nCommands\n• Numpad2 (all keyboard layouts) or NVDA+. (laptop layout): when pressed 4 times, displays information about the character of the current navigator object where the review cursor is situated.\nNotes\n• \nThis add-on provides also two gestures that are unassigned by default:\n• A script to display directly the review cursor character information. If you feel unconfortable with the four press gesture, you may assign to it a gesture in NVDA's input gesture dialog (\"Text review\" category).\n• A script to display character information for the character at the position of the caret (works only in places where there is a caret). It can be found in the \"system caret\" category of NVDA input gestures dialog.\n• \nThe provided information is in english since it is part of Unicode norm. If a local translation exists for this add-on, the information is also provided alongside with english.\n• The CLDR name (Unicode Common Locale Data Repository) is only supported with NVDA 2019.1 and above.\n• For the characters written with Microsoft proprietary fonts Symbol, Wingding (1, 2,, 3) and Webding, some additional information is provided: character name, font name and information of the corresponding unicode character.",
  "https://addons.nvda-project.org/files/get.php?file=chari",
  "https://addons.nvda-project.org/addons/charInfo.\"lng\".html"
 ],
 "Addon to count elements of selected text": [
  "2017.2 / 2019.1",
  "This addon announces the number of words, characters, paragraphs and lines of the selected text by pressing Control+Shift+F12.\nNote: In some applications, like Word, WordPad and DSpeech, it only announces word and characters, to avoid hanging NVDA.\nIn any text editor, or in a virtual document, for example in a web browser, PDF, email body, etc., select the desired text using the usual text selection commands and press Control+Shift+F12.\nThis command can be modified in the \"Input gestures\" dialog in the \"Text editing\" section.",
  "https://addons.nvda-project.org/files/get.php?file=wc",
  "https://addons.nvda-project.org/addons/wordCount.\"lng\".html"
 ],
 "Online image describer": [
  "2018.3 / 2020.2",
  "This addon aims at adding online image recognition engines to NVDA.\nThere are two types of engines. OCR and image describer.\nOCR extract text from image.\nImage describer describe visual features in image in text form, such as general description, color type landmarks and so on.\nInternet connection is required to use this addon, since image describe services are provided by API endpoints on the Internet.\nThey are called engines in this addon.\nThere are three types of engine for this addon.\n• Online OCR engine\n• Online image describer engine\n• Windows 10 OCR engine (offline)\nYou also need to choose the source of recognition image.\n• Current navigator object\n• Current foreground window\n• The whole screen\n• Image data or file from clipboard\n• Image file pathname or image url from clipboard\nKeyboard commands\nAfter choosing these types, you can start recognition with one gesture.\nNVDA+Alt+P Perform recognize according to source and engine type setting, Then read result. If pressed twice, open a virtual result document.\nThere are four additional gestures left unassigned. Please assign them before using.\nCycle through different recognition engine types.\nCycle through different recognition source types.\nCancel current recognition\nThis gesture can be useful if you think you have waited for too long and want to cancel.\nAlso sometimes you do not want to be disturbed by recognition message because you need to review some messages arrived after recognition start.\nShow previous result in a virtual result document.\nThough there is a feature to copy result to clipboard. Character position information cannot be preserved, so this gesture is added to solve this problem.\nThere are also four old gestures are left unassigned for users who prefer gestures in previous versions.\nIt is recommended to use new gesture and switch engine type according to your need.\nRecognize current navigator object with online OCR engine Then read result. If pressed twice, open a virtual result document.\nRecognizes image in clipboard with online OCR engine. Then read result. If pressed twice, open a virtual result document.\nRecognize current navigator object Then read result. If pressed twice, open a virtual result document.\nRecognizes image in clipboard . Then read result. If pressed twice, open a virtual result document.\nEngine Configuration\nYou can choose recognition engines and configure them in detail in Online Image Describer category in NVDA settings dialog.\nThe author of addon have registered account with free API quota and set up a proxy server on www.nvdacn.com to make this addon easier to test at first. Test quota is limited and may be cancelled by API provider anytime.\nIt is highly recommended to register your own key according to guide in each engine.\nThe following settings are applicable to all engines.\n• Copy recognition result to the clipboard: if enabled, recognition result text will be copied to clipboard after recognition.\n• Use browseable message for text result: if enabled, recognition result text will be shown in a popup window instead of speech or braille message.\n• Swap the effect of repeated gesture with none repeated ones: by default, a virtual result document is shown only if you press the corresponding gesture twice, if you use that frequently you can enable this option so that you only need to press once to get a result viewer.\n• Enable more verbose logging for debug purposes: some logs are essential for debugging but affects performance and takes up a lot of space. Only turn this on if specifically instructed to by the addon author or an NVDA developer.\n• Proxy type: which type of proxy you are using. If you do not know what a proxy is just leave it as is.\n• Proxy address: full URL of your proxy. If you do not know what a proxy is just leave it as is. If you choose to use proxy your proxy will be verified before saving , after verification, there will be a prompt to tell you result.\nThe following settings means the same in all engines, describe them here to save space.\n• \nAPI Access Type: this controls how you get access to the corresponding API endpoints.\n• If you choose \"Use public quota\", you are using free quota in an account registered by addon author.\n• If you choose \"Use your own API key\", this addon will use quota from your own account.\n• \nAPP ID, API key or API Secret Key: if you want to use quota from your own account corresponding access tokens is required. Some engines only need API key. Some engines require two tokens. These are only valid if you choose \"use your own API key\" in API Access type.\nNote that the quality and accuracy of results are affected by many factors.\n• Models and techniques used by engine provider\n• Quality of uploaded image\n• Is navigator object hidden behind something else\n• Screen resolution\nOnline image description\nHere are three engines available.\nMicrosoft Azure Image Analyser\nThis engine extracts a rich set of visual features based on the image content.\nThis engine is english only. If you want description in other languages, you can use Microsoft Azure Image Describer\nVisual Features include:\n• Adult - detects if the image is pornographic in nature (depicts nudity or a sex act). Sexually suggestive content is also detected.\n• Brands - detects various brands within an image, including the approximate location. The Brands argument is only available in English.\n• Categories - categorizes image content according to a taxonomy defined in documentation.\n• Color - determines the accent color, dominant color, and whether an image is black&white.\n• Description - describes the image content with a complete sentence in supported languages.\n• Faces - detects if faces are present. If present, generate coordinates, gender and age.\n• ImageType - detects if image is clip art or a line drawing.\n• Objects - detects various objects within an image, including the approximate location. The Objects argument is only available in English.\n• Tags - tags the image with a detailed list of words related to the image content.\nSome features also provide additional details:\n• Celebrities - identifies celebrities if detected in the image.\n• Landmarks - identifies landmarks if detected in the image.\nMicrosoft Azure Image describer\nThis engine generates a description of an image in human readable language with complete sentences. The description is based on a collection of content tags, which are also returned by the operation.\nMore than one description can be generated for each image. Descriptions are ordered by their confidence score.\nThere are two settings for this engine.\n• Language: the language in which the service will return a description of the image. English by default.\n• Maximum Candidates: maximum number of candidate descriptions to be returned. The default is 1.\nOnline OCR\nOnline engines rely on the use and presence of the following services.\nhttps://www.nvdacn.com\nhttps://ocr.space/ocrapi\nhttps://azure.microsoft.com/en-us/services/cognitive-services/\nhttp://ai.qq.com\nhttp://ai.baidu.com\nhttp://ai.sogou.com/\nhttps://intl.cloud.tencent.com\nEngines\nThere are five engines available.\nTencent Cloud OCR\nThis API is sponsored by Tencent Cloud and Aceessibility Research Association, with a quota of 15000 per day.\nThis engine support 19 languages.\n• Chinese-English mix\n• Japanese\n• Korean\n• Spanish\n• French\n• German\n• Portuguese\n• Vietnamese\n• Malay\n• Russian\n• Italian\n• Dutch\n• Swedish\n• Finnish\n• Danish\n• Norwegian\n• Hungarian\n• Thai\n• Latin\nHere is the settings of this engine.\n• Language: Text language for recognition. Auto detection by default.\nOCR space\nThis one is a paid API with free quota provided by OCR Space\nIt supports 24 languages\n• Arabic\n• Bulgarian\n• Chinese(Simplified)\n• Chinese(Traditional)\n• Croatian\n• Czech\n• Danish\n• Dutch\n• English\n• Finnish\n• French\n• German\n• Greek\n• Hungarian\n• Korean\n• Italian\n• Japanese\n• Polish\n• Portuguese\n• Russian\n• Slovenian\n• Spanish\n• Swedish\n• Turkish\nHere are settings for this engine:\n• Language: text language for recognition. English by default.\n• Detect image orientation: if set to true, the API autorotates the image correctly.\n• Scale image for better quality: if set to true, the API does some internal upscaling. This can improve the OCR result significantly, especially for low-resolution PDF scans.\n• Optimize for table recognition: if set to true, the OCR logic makes sure that the parsed text result is always returned line by line. This switch is recommended for table OCR, receipt OCR, invoice processing and all other type of input documents that have a table like structure.\nIf you want to use your own key, you also need to specify API Key.\nYou can get your own free API key by registering onOCR space\nHere is a simple guide.\nFind the link \"Register for free API key\"\nClick on it and you will find a form to fill in.\nThe form asks you to enter the following data\n• Email Address\n• First Name\n• Last Name\n• How do you plan to use the OCR API?\nAfter filling it and submit. You may also need to pass a captcha\nThen you will receive a confirmation e-mail\nFind the link named \"Yes, subscribe me to this list.\" in that e-mail. Access that link and you will receive API key by e-mail soon.\nMicrosoft Azure OCR\nThis engine uses OCR API in Microsoft Azure Cognitive Services Computer Vision.\nIt supports 24 languages including\n• Chinese Simplified\n• Chinese Traditional\n• Czech\n• Danish\n• Dutch\n• English\n• Finnish\n• French\n• German\n• Greek\n• Hungarian\n• Italian\n• Japanese\n• Korean\n• Norwegian\n• Polish\n• Portuguese\n• Russian\n• Spanish\n• Swedish\n• Turkish\n• Arabic\n• Romanian\n• Serbian Cyrillic\n• Serbian Latin\n• Slovak\nHere are settings for this engine:\n• Language: text language for recognition. Auto detection by default.\n• Detect image orientation: if set to true, the API autorotates the image correctly.\nIf you use your own key, you should get a subscription key for using Microsoft Computer Vision API from the link below:\nStep 1: Create an account on Azure website\nPlease note that the key must be created for the Computer Vision API. The first \"GET API key\" button you encounter with single key navigation. Currently Microsoft provides the option to create a trial key for 7 days. You can also sign up for a free azure account for more trail. Signing up requires a credit card. If you already have a subscription account, you can skip this step.\nStep 2: Deploy Cognitive Services\nNow you have an azure account.\nFirst login on Azure Portal\nWait until you get the message Portal is Ready you are logged into azure portal.\nFind the link called All resources after All services button and activate it.\nWait until you get the message Blade All resources are ready , your focus will be an edit box, then press shift tab find a menu item called add and activate it.\nWait until you get the message Search the Marketplace, type Cognitive Services and press down arrow.\nWait until you get the message List of options Cognitive Services one of five, then press enter.\nWait until you get the message Blade Cognitive Services is ready press tab or b to find a button named Create activate it.\nWait until you get the message Blade Create is ready, your focus will be an edit box, type a name for this resource. Note that Your resource name can only include alphanumeric characters, '', '-', and can't end with '' or '-'.\nI choose NVDA_OCR.\nPress tab to go to Subscription combo box. Usually you can leave it as is.\nPress tab to go to Location combo box. Choose one close to your current location.\nBe sure to remember this since location is required in engine configuration.\nPress tab to go to Pricing tie combo box. Usually a free tie like F0 is adequate. If that is not enough you can choose other tier after reading full pricing details in View full pricing details link.\nPress tab to go to Create new Resource group edit box. You should create one if you do not have any Resource group. Press tab find Create new button.\nThen press tab go to Create Button to create this resource.\nWait until you get the message Deployment succeeded.\nThen find Go to resource button sometimes you need go up to activate Notifications button before you can find Go to resource button.\nWait until you get the message Blade Quick Start is busy.\nFind the link named keys, then activate it.\nWait until you get the message Blade Manage keys is ready.\nFind edit box named key 1 or key 2. The content of that edit box is the API key required in engine configuration. Press Ctrl-C to copy it for engine configuration\nThen you can fill in these two settings required if you use your own API key.\n• Azure resource Region: the region you choose when deploying Cognitive Services in Azure Portal.\n• API key: the key you get after successfully deploying Cognitive Services in Azure Portal, KEY 2 is recommended.\nBaidu OCR\nThis one is also a paid API with free quota provided by Baidu.\nBaidu OCR supports 10 languages including\n• Chinese and English mixture\n• English\n• Portuguese\n• French\n• German\n• Italian\n• Spanish\n• Russian\n• Japanese\n• Korean\nThis engine can also get position of every character\nHere are its settings:\n• \nGet position of every character allows you to do more precise operation on some inaccessible application. Enabling this will make recognition slightly slower.\n• \nUse Accurate API: if is enabled will use a different endpoint. That accurate endpoint takes longer time but has higher quality and (If you use your own API key its price is also higher).\nIt has four endpoints with separate quota limit.\n• Basic OCR without any information about text location. Currently 50000 times a day.\n• Basic OCR with information about text location. Currently 500 times a day.\n• Accurate OCR without any information about text location. Currently 500 times a day.\n• Accurate with information about text location. Currently 50 times a day.\nIf you press the gesture which only read result, you are using endpoints without any information about text location.\nIf you press the gesture which shows an result viewer, you are using endpoints with information about text location.\nThough it provides a quite generous free quota, its website is Chinese only and not quite accessible.\nTencent AI OCR\nThis API is free to use with frequency limit about two query per second.\nIf you want to bypass the limit you can register your own API key. The website of this API is Chinese only and not quite accessible.\nThere is no information about language support in the document. According to my test Chinese and English and their mixture is supported.\nThere is no additional configuration for this API.",
  "https://addons.nvda-project.org/files/get.php?file=oid-dev",
  "https://addons.nvda-project.org/addons/onlineOCR.\"lng\".html"
 ],
 "Weather Plus": [
  "2017.3 to beyond",
  "• This plugin adds local temperature and forecasts to 24 hours up to 2 additional days and hourlyforecast for NVDA.\n• Copyright (C) Adriano Barbieri\n• Released under the GNU GPL (General Public License) v2\n• Weather Plus works through the use and presence of the following services:\n• https://www.weatherapi.com/\n• http://www.geonames.org/\n• http://veloroutes.org/elevation/\n• http://www.nvda.it/\nUSAGE:\n• Press NVDA+w to get the information about current temperature and weather conditions.\n• Press NVDA+shift+W to get 24 hours forecast and forecast up to 2 days.\n• Press NVDA+shift+W twice to get hourlyforecast of temperature and atmospheric conditions.\n• Press NVDA+shift+control+w to set a temporary city.\n• Press NVDA+shift+control+alt+w to open the Weather Plus settings dialog.\n• Press NVDA+alt+w to get the date and time, when the weather report was updated.\n• Press control+shift+w to toggle between Fahrenheit, Celsius or Kelvin temperature scales.\nWeather Plus setup:\n• You must set the Weather Plus addon before its first use! Go to the Preferences submenu, Weather Plus Settings submenu and choose one of the following options:\n• Set and Manage Your Cities... - Displays or allows to set the current city from a list.\n• Set a temporary city... - Displays and allows to set one temporary city from a list if available.\n• Documentation - Opens the help file for the current language.\n• Check for Update... - Notifies about the availability of the new version.\nTo add a new city: press the following item:\n• Set and Manage Your Cities... - Displays or allows to set the current city from a list.\n• The following message is displayed only for the first time! Settings Preset None F1: help placing, F2: last TAB selection, F3: list and edit box, F4: control duration Weather Forecast, F5: volume controls.\n• In the edit box, enter a City or choose one from the list, if available. Note: The F5 key is available if the sound effects are activated.\n• After pressing enter on the item \"Set and Manage Your Cities...\", you will find other buttons as follows:\n• Test - Test the validity of the city and find the data of it.\n• Add - Adds the current city into your list. This button can be activated if you select a city from the list, when the city entered passed the test.\n• Details - Displays information about the current city. This button is activated if you select a city from the list, or it has passed the test.\n• Define - Allows you to define the area, in order to adapt the sound effects. This button can be activated if the audio effects are installed and activated, and you select a city from the list.\n• Preset - Presets a city as the default, will be used every time you restart the plugin. This button is activated if you select a city previously inserted in the list and not preset, or it has passed the test.\n• Remove - Deletes the current city from your list. This button can be activated if you select a city previously inserted in the list.\n• Rename - Rename the current city. This button can be activated if you select a city previously inserted in the list.\n• Import new cities... - This button allows you to import cities from the another list of cities with the extension *.zipcodes; you can select the city you want to import, by turning on the checkbox associated with it.\n• Export your cities... - It allows you to save the cities in the specified file with the extension *.zipcodes. This button is activated if you have added and saved at least one city into the list.\n• hourly forecast setting... - This button allows you to choose the contents of the hourly forecast report.\n• Scale of temperature measurement: Use the radio button to select between Celsius (by default), Fahrenheit and Kelvin.\n• Degrees shown as: Use the radio button to select between: Celsius - Fahrenheit - Kelvin (by default) C - F - K or Unspecified.\n• Combo box: Weather Forecasts up to days: 1; you can choose between 1 to 3 (1 days by default)\n• Combo box: API response language: English, en; you can choose the language of the weather conditions text.\n• To perform the following actions, toggle the following checkboxes:\n• Copy the weather report and weather forecast, including city details to clipboard; checkbox not checked (by default)\n• Enable audio effects (only for the current weather conditions); this checkbox also allows you to manage the installation of sound effects; if the sound effects are installed and the checkbox is activated, the F5 key and the volume setting becomes available.\n• There will also be available an additional checkbox: \"Use only weather effects\".\n• You can change the overall volume or change the last heard sound effect and filter out the others sounds in your environment. Checkbox is not checked by default.\n• Use only weather effects - This option is available if sound effects are enabled; if is enabled, allows to listen only weather effects such as rain, wind, thunder, etc., filtering out all environmental ones. (unchecked by default)\n• Enable the reading of the hours in 24-hour format. - If this checkbox is unchecked, announces the time in 12-hour format for example, 12 AM - 12 PM. Checkbox is checked (by default)\n• Enable help buttons in the settings window; checkbox checked (by default)\n• Read wind information; checkbox not checked (by default). If this checkbox is enabled, you can also activate the following checkboxes:\n• Add wind direction; indicates the provenance of the wind. Checkbox checked (by default)\n• Add speed of the wind; indicates the speed in kilometers or miles per hour. Checkbox checked (by default)\n• Add speed in meters per second of the wind; checkbox checked (by default)\n• Add wind gust speed of the wind; checkbox checked (by default)\n• Add perceived temperature; checkbox checked (by default)\n• Read atmospherical information; checkbox not checked (by default). If enabled, you can also check the following checkboxes:\n• Add humidity value; indicates the humidity in percent. Checkbox checked (by default)\n• Add visibility value; indicate in kilometres or miles the distance visible. Checkbox checked (by default)\n• Add atmospheric pressure value; indicates the atmospheric pressure in millibars or inches of mercury. If it's checked, enable an additional checkbox that allows you to indicate the pressure in millimeters of mercury. Checkbox checked (by default)\n• Add status of barometric pressure; check box checked (by default)\n• Add cloudiness value; check box checked (by default)\n• Add precipitation value; check box checked (by default)\n• Add ultraviolet radiation value; check box checked (by default)\n• Read astronomical information; indicates the time of sunrise and sunset and the time of moonrise and moonset. Checkbox not checked (by default)\n• Use the comma to separate decimals; if enabled, uses the comma as a decimal separator, otherwise, use the point. Checkbox not checked (by default)\n• Check for upgrade; if is activated this alerts when there is an update of the addon. Checkbox checked (by default)\n• Press the OK button to confirm the action or the Cancel button to cancel the action.\n• If you have modified the cities list, by pressing \"Cancel\", you will be remembered and you can still save it. Note: your settings will be save in the file named:\n• \"Weather.ini\": startup settings of Weather Plus.\n• \"Weather.volumes\": custom audio volume levels, regardless of the overall volume.\n• \"Weather.zipcodes\": list of cities with their zip code and definitions.\n• \"Weather.default\": Your default city.\n• \"Weather_searchkey\": search key saved.",
  "https://addons.nvda-project.org/files/get.php?file=wetp",
  "https://addons.nvda-project.org/addons/Weather_Plus.\"lng\".html"
 ],
 "BrowserNav": [
  "2018.1 / 2019.1",
  "BrowserNav addon for NVDA\nThis add-on provides NVDA users powerful navigation commands in browser mode. For example, with BrowserNav you can find vertically aligned paragraphs, that is paragraphs with the same horizontal offset. This can be used to read hierarchical trees of comments or malformed HTML tables. You can also find paragraphs written in the same font size or style. BrowserNav also provides new QuickNav commands: P for next paragraph and Y for next tab.\nUsage in browsers\nBrowserNav can be used to navigate by horizontal offset from the left edge of the screen, by font size, or by font style.\n• When navigating by horizontal offset, you can easily find paragraphs that are vertically aligned on the page. IN particular, you can press NVDA+Alt+DownArrow or UpArrow to jump to the next or previous paragraph that has the same offset. For example, this can be useful when browsing hierarchical trees of comments (e.g. on reddit.com) to jump between first level comments and skipping all the higher level comments.\n• When navigating by font size, you can easily find paragraphs written in the same font size, or smaller/greater font size.\n• You can also navigate by font size with the constraint of same font style.\nBrowserNav works in any browser supported by NVDA.\nKeystrokes:\n• NVDA+Alt+UpArrow or DownArrow: Jump to previous or next paragraph with the same horizontal offset or font size.\n• NVDA+alt+LeftArrow: Jump to previous paragraph with lesser offset or greater font size.\n• NVDA+Alt+RightArrow: Jump to next paragraph with greater offset or smaller font size.\n• NVDA+O: Switch rotor setting between horizontal offset, font size, font size with font style.\n• P or Shift+P: Jump to next or previous paragraph.\n• Y or Shift+Y: Jump to next or previous tab.\nSource code\nSource code is available at https://github.com/mltony/nvda-browser-nav.",
  "https://addons.nvda-project.org/files/get.php?file=browsernav",
  "https://addons.nvda-project.org/addons/browsernav.\"lng\".html"
 ],
 "Outlook extended": [
  "2018.3 and beyond",
  "This addon improves the use of Microsoft Outlook by vocalizing some commands and adding extra commands.\nCommands\n• Alt+1 to Alt+9, Alt+0, Alt+-, Alt+=: Reports the header field 1 to 12 in a message, calendar item or task window. If pressed twice, moves the focus to this field if possible. If pressed three times, copies its content to the clipboard.\n• NVDA+shift+I (desktop layout) / NVDA+control+shift+I (laptop layout): Reports the information bar in a message, calendar item or task window. If pressed twice, moves the focus to it. If pressed three times, copies its content to the clipboard.\n• NVDA+shift+A (desktop layout) / NVDA+control+shift+A (laptop layout): Reports the number and the names of attachments in a message window. If pressed twice, moves the focus to it.\n• NVDA+shift+M (desktop layout) / NVDA+control+shift+M (laptop layout): Moves the focus to the message body.\n• Control+Alt+Left and Control+Alt+Right: in the address book search result list, navigates between the fields of the currently selected line.\n• Control+Q: in the message list, marks the selected message or group of messages as read.\n• Control+U: in the message list, marks the selected message or group of messages as unread.\nNotes\nAll the gestures can be modified in the NVDA command gestures dialog. You may want to modify them especially in the following situations:\n• The default gestures to mark messages as read or unread are the ones for Outlook english version. If they differ from the ones of your Outlook local version, you will have to change them accordingly.\n• The default gestures to read headers correspond to Alt combined with the keys of the first row of the alpha-numeric keyboard. You may need to re-map the gestures tor read header 11 and 12 if they do not match your local keyboard layout.",
  "https://addons.nvda-project.org/files/get.php?file=outlookextended",
  "https://addons.nvda-project.org/addons/outlookExtended.\"lng\".html"
 ],
 "Training Keyboard commands": [
  "unknown",
  "This addon is aimed to train NVDA commands in a game like way, for either keyboard layout modes desktop or laptop layout.\nAll commands data is scraped from keyCommands.html file in locale documentation folder in NVDA.\nThis addon does not have any default gesture or shortcut.\nYou have to assign a specific gesture to it via: NVDA menu>preferences>inputGestures>trainingKeyboardCommands.\nUsage\n• You choose the keyboard layout mode you want to train, and begin play\n• A question or command and it's description will be displayed, and you have to pick the right related keys or answer\n• If you have chose the right answer, your score wi be added one point\n• If the answer was wrong, the score will not change, and go on with no loose\n• At any time, if you want to exit, you will be asked if you want to save the remaining questions for next round\n• If in a later time you choose a layout wit saved questions, you will be asked if you want to resume the remaining questions from previous round\n• Answering all questions, about 95 for each layout, you will be declared a winner deserving NVDA addon's cup.",
  "https://addons.nvda-project.org/files/get.php?file=trainingkbdcmd",
  "https://addons.nvda-project.org/addons/trainingKeyboardCommands.\"lng\".html"
 ],
 "Columns Review": [
  "2017.3 and beyond",
  "Columns Review is an add-on to enhance NVDA experience with lists.\nIts features include:\n• customizable actions on column header and/or content (available actions are read, copy, spell and show in browse mode);\n• ability to cycle between columns in ten-by-ten intervals;\n• simplified header management (mouse clicks);\n• on-demand reading of relative current item position (i.e.: item 7 of 10);\n• customizable gestures with or without numpad;\n• \"0 items\" announcement when list is empty (not working in Win8/10 folders, unfortunately);\n• say all support;\n• report of selected items (amount and item names);\n• list search (with item multiselection, if checked/supported).\nGestures\nDefault keys for columns, headers and position are NVDA+control, but you can customize them from add-on settings (not \"Input gestures\" dialog!).\nNote that your keyboard could have problems processing some key combinations, so try all add-on gestures and adjust them for better results.\nSee also add-on preferences for numpad mode, keyboard layout (without numpad), and the four available actions for columns.\n• NVDA+control+digits from 1 to 0 (keyboard mode) or from 1 to 9 (numpad mode): by default, read the chosen column if pressed once, copy it if pressed twice;\n• NVDA+control+numpadMinus (numpad mode): like NVDA+control+0 in keyboard mode, read or copy the 10th, 20th, etc column;\n• NVDA+control+- (keyboard mode, EN-US layout): in a list with 10+ columns, change interval and process columns from 11 to 20, from 21 to 30, and so on (change last char according to your layout, from settings);\n• NVDA+control+numpadPlus (numpad mode): like previous command;\n• NVDA+control+enter (numpadEnter in numpad mode): open header manager;\n• NVDA+control+delete (numpadDelete in numpad mode): read relative current item position (i.e.: item 7 of 10);\n• Arrows and NVDA+tab (in empty list): repeat \"0 items\" message;\n• NVDA+downArrow (desktop layout) or NVDA+a (laptop layout): start say all (this gesture depends on original one under \"Input gestures\"/\"System caret\");\n• NVDA+shift+upArrow (desktop layout) or NVDA+shift+s (laptop layout): report amount and names of current selected list items (like previous command for customization);\n• NVDA+control+f: open find dialog (not customizable);\n• NVDA+f3: find next occurrence of previously entered text (not customizable);\n• NVDA+shift+f3: find previous occurrence (not customizable).\nSupport\nThis add-on provide a general support for more common lists (see below), and some specific applications. Main author (Alberto Buffolino) cannot guarantee compatibility/functionality for those applications he not uses, like Outlook and Windows Mail, but he'll be happy to collaborate with their users or accept a pull request for them.\nLists supported are:\n• SysListView32;\n• DirectUIHWND (present in 64-bit systems);\n• WindowsForms10.SysListView32.* (applications that use .NET);\n• multi-column treeview like as that presents in RSSOwlnix;\n• Mozilla table (tipically, Thunderbird message list, thread-grouping supported).",
  "https://addons.nvda-project.org/files/get.php?file=cr",
  "https://addons.nvda-project.org/addons/columnsReview.\"lng\".html"
 ],
 "TextNav": [
  "unknown",
  "TextNav allows you to find text that you want to read on a web page in just a single keystroke. More precisely, it adds a keystroke to jump to next or previous text paragraphs - that is a paragraph containing one or more sentences. This feature might be useful to quickly find the textual part of a web page or to skip over menus, advertisements and other not important page elements.\nKeystrokes:\n• Alt+Shift+Down arrow: Go to next text paragraph.\n• Alt+Shift+Up arrow: Go to previous text paragraph.",
  "https://addons.nvda-project.org/files/get.php?file=textnav",
  "https://addons.nvda-project.org/addons/textnav.\"lng\".html"
 ],
 "AudioChart": [
  "unknown",
  "AudioChart add-on for NVDA allows you to play excel time series as a continuous sound.\nUsage\nSelect a cell or a column of cells containing time series in Microsoft Excel.\nKeystrokes\n• NVDA+A: Play audio chart.\n• NVDA+A twice quickly: Show calibration dialog window. In laptop layout, press NVDA+Control+Shift+A instead.\nSource code\n     https://github.com/mltony/nvda-audio-chart/",
  "https://addons.nvda-project.org/files/get.php?file=audiochart",
  "https://addons.nvda-project.org/addons/AudioChart.\"lng\".html"
 ],
 "BluetoothAudio": [
  "unknown",
  "Bluetooth Audio is an NVDA add-on that improves sound quality when working with bluetooth headphones or speakers.\nMost bluetooth devices enter standby mode after a few seconds of inactivity. That means that when NVDA starts speaking again, the first split second of sound will be lost. Bluetooth Audio add-on prevents bluetooth devices from entering standby mode by constantly playing a silent sound, that is inaudible to a human ear.\nWarning: using Bluetooth Audio add-on might reduce battery life of your bluetooth device.",
  "https://addons.nvda-project.org/files/get.php?file=btaudio",
  "https://addons.nvda-project.org/addons/BluetoothAudio.\"lng\".html"
 ],
 "Calibre": [
  "unknown",
  "An NVDA add-on with some accessibility enhancements for the interface of Calibre eBook Management\n• F10 brings the focus to the toolbar. Then you can navigate it with standard keys (tab and arrows); enter to activate item and key applications to display the context menu; escape to exit the toolbar.\n• F12 search the current book in Google\n• NVDA+Alt+End says the total of books in the current library view and the number of books selected\n• NVDA+Control+H open the context menu for settings of the current column\n• I in library view reads the book information.\nKeystrokes can be customized in Preferences of NVDA > Input gestures when calibre are open. Also you can define in preferences the way NVDA reads the table headers in the library (rows and columns, columns only or none).\nTake a look at the documentation of Calibre for know more Keyboard shortcuts.\nCovered by the GNU General Public License. See the file COPYING.txt for more details.",
  "https://addons.nvda-project.org/files/get.php?file=cae",
  "https://addons.nvda-project.org/addons/calibre.\"lng\".html"
 ],
 "ToolbarsExplorer": [
  "unknown",
  "This add-on makes easier to use toolbars in applications, providing an exploration model derived by object navigation, with simplified gestures.\nCommands\n• Alt+applications: starts toolbars exploration\n(you can remap it via NVDA gesture manager, under Object navigation).\nDuring exploration, following gestures are available:\n• Left/right arrow: moves to previous/next toolbar;\n• Up/down arrow: scrolls up/down items in current toolbar;\n• Enter: activates toolbar or its item;\n• Space: simulates left mouse click on toolbar or its item;\n• Applications/shift+F10: simulates right mouse click on toolbar or its item;\n• Escape: exits from exploration.\nAdditionally, you can perform actions on toolbars or its items using any gesture provided by NVDA, as exactly as when you move to objects with standard object navigation.\nNotes\nExploration is terminated explicitly pressing escape, and implicitly:\n• performing an action on toolbar or its item (with space, applications/shift+F10, enter);\n• pressing a gesture that moves out of current toolbar objects (alt, windows, tab, NVDA+F1, object navigation gestures, etc).\nOther gestures not containing alt, windows or escape (as h, 1, shift, shift+h, control+z) simply does nothing.\nSuggestions\n• The add-on may fail in Mozilla applications the first time after add-on installation/update; please restart NVDA and Mozilla applications to resolve;\n• In LibreOffice, best configuration is probably default or single toolbar, set it on view menu/toolbar position.",
  "https://addons.nvda-project.org/files/get.php?file=tbx",
  "https://addons.nvda-project.org/addons/toolbarsExplorer.\"lng\".html"
 ],
 "Input Lock": [
  "unknown",
  "Do you have kids or pets at home? Do you have a cat and It likes very much climbing your table and walking over your keyboard? Do you accidentally move the mouse to random parts in the screen while using your laptop? Then Input Lock is for you! You will be able to leave your computer alone and turned on without risk.\nOnce installed, you will be able to lock your keyboard, touch screen, if your laptop has one, mouse and Braille display.\nUsage\nThis addon adds two extra gestures to NVDA. By default they are unassigned, so you will have to configure them from Input gestures dialog. Read the NVDA User Guide for more information.\nWhen you press the toggle input lock gesture, NVDA will say \"Input locked\". Your input devices will be blocked until you press the same gesture again. In that moment, NVDA will say \"Input unlocked\" and everything will work as usual.\nIf you press the toggle mouse block gesture, your mouse will be locked. Press this command again to unlock it. While mouse is locked, you can use NVDA gestures to move it, and click with left and right buttons, but You can't move the mouse itself. Mouse clicks can also be disabled from Input lock category in NVDA settings dialog (NVDA 2018.2 and later) or from add-on settings dialog for older versions, available under preferences menu. In addition, from these settings you can control wether mouse locks when NVDA is started or not.\nNote: when mouse clicks are blocked, you can't use any NVDA gestures to work with the mouse.\nLimitations and known problems\nInput Lock has the following known problems:\n• The shortcuts control+alt+del and windows+l can be used even when the keyboard is locked.\n• NVDA unlocks the keyboard and other input methods when the computer wakes up from standby mode or the session is restored from the Windows lock screen.\n• On some laptops, the touchpad still accepts user input after mouse is blocked.",
  "https://addons.nvda-project.org/files/get.php?file=inputlock",
  "https://addons.nvda-project.org/addons/inputLock.\"lng\".html"
 ],
 "Add-on Updater": [
  "2021.3 +",
  "This add-on brings NVDA Core issue 3208 to life: ability to check for, download, and apply add-on updates.\nTo check for updates after installing this add-on, go to NVDA menu/Tools/Check for add-on updates. If updates are available, a list of add-on updates will be shown, with each entry consisting of description, current version, and the new version. Select Update, and NVDA will download and apply updates in sequence, with a prompt to restart your NVDA shown afterwards.\nThe following add-ons provide built-in update feature and thus updates will not be checked via this add-on:\n• Braille Extender\n• WeatherPlus\nIMPORTANT NOTES:\n• This is a proof of concept add-on. Once the relevant feature is included in NVDA, this add-on will be discontinued.\n• If the new add-on updates specify a compatibility range (minimum and last tested NVDA versions) and if the NVDA version you are running does not fall within the compatibility range according to NVDA, add-on updating will not proceed.\n• Not all add-ons come with development releases. If you are not getting updates after choosing to install development versions of an add-on, switch to stable channel for affected add-ons.\n• On some systems (particularly computers joined to a corporate domain), add-on update check functionality may not work properly, therefore add-on updates must be downloaded manually.\nVersion 22.02\n• NVDA 2021.3 or later is required.\n• On Windows 10, add-on update toast notifications are localized.\nVersion 22.01\n• NVDA 2021.2 or later is required.\n• On server systems running Windows Server 2016 and later, add-on updates will be presented in a dialog instead of using toast notifications.\nVersion 21.10\n• It is again possible to check for add-on updates on some systems, notably after a clean Windows installation.\nVersion 21.09\n• NVDA 2021.1 or later is required.\n• on Windows 10 and later, it is possible to select add-on update notification between a toast message and an update dialog. This can be configured from Add-on Updater settings found in NVDA Settings screen.\n• Add-on Updater will no longer check minimum Windows release information for add-ons as add-ons such as Windows App Essentials provide better Windows compatibility information.\nVersion 21.07\n• On Windows 10 and later, a toast notification will be shown when add-on updates are available. Note that you cannot click this notification - you must open NvDA menu/Tools/Check for add-on updates to review updates.\n• When legacy add-ons dialog is shown at startup, you can now review legacy add-ons and reasons just like add-on updates.\n• Improved add-on update check internals, including use of add-on metadata collection provided by the community to validate add-on compatibility. Among other things, this eliminates add-on releases for adding update checks for new add-ons.\nVersion 21.05\n• NvDA will no longer play error tones if trying to check updates while using NVDA 2021.1 alpha snapshots, caused by changes to wxPython GUI toolkit.\nVersion 21.03\n• NVDA 2020.4 or later is required.\n• NVDA will present an error dialog if errors occur while checking for add-on updates such as loss of Internet connection.\nVersion 20.11\n• NVDA 2020.3 or later is required.\n• Resolved more coding style issues and potential bugs with Flake8.\n• NVDA will no longer play error tones or appear to do nothing when using the add-on while NVDA is running from source code. A message about this fact will be recorded in the log instead.\nVersion 20.07\n• NVDA 2020.1 or later is required.\n• If one or more legacy add-ons (such as Screen Curtain) are installed, Add-on Updater will present a message asking you to disable or uninstall the add-ons listed.\n• You can now save, reload, or reset Add-on Updater settings by pressing Control+NVDA+C, Control+NVDA+R once, or Control+NVDA+R three times, respectively.\nVersion 20.06\n• Resolved many coding style issues and potential bugs with Flake8.\nVersion 20.04\n• NVDA will no longer appear to do nothing or play error tones when trying to update add-ons through Add-on Updater.\n• Resolved an issue where \"check for add-on updates\" item wasn't present in NVDA Tools menu.\nVersion 20.03\n• NVDA 2019.3 or later is required.\n• When installing add-on updates, Add-on Updater will no longer check for compatibility range. NVDA itself will check add-on compatibility.\nVersion 19.11\n• When add-on updates are available, NVDA will announce how many updates are available.\nVersion 19.09\n• Requires NVDA 2019.2 or later.\n• Timeout errors seen when attempting to download some add-on updates (notably add-on files hosted on GitHub) has been resolved.\nVersion 19.04\n• Requires NVDA 2019.1 or later.\n• When installing add-on updates, both minimum and last tested versions will be checked.\nVersion 19.01\n• Requires NVDA 2018.4 or later.\n• Improved responsiveness when checking for add-on updates.\n• Made the add-on more compatible with Python 3.\nVersion 18.12.2\n• Python 3 ready.\n• Fixed compatibility with recent NVDA alpha snapshots where add-on updates would not download.\nVersion 18.12.1\n• Added localizations.\nVersion 18.12\n• Updates for disabled add-ons can be checked. They will stay disabled after updating them.\n• During updates, if an add-on requires specific NVDA version and/or Windows release, these will be checked, and if one of these does not match, an error message will be shown and update will be aborted, resulting in no changes to already installed add-on version.\n• When automatic update check is enabled and when updates are ready, NVDA will present the updates list instead of asking if you wish to review updates.\nVersion 18.10\n• Initial stable release (still marked as proof of concept).",
  "https://addons.nvda-project.org/files/get.php?file=nvda3208",
  "https://addons.nvda-project.org/addons/addonUpdater.\"lng\".html"
 ],
 "Access8Math": [
  "unknown",
  "This NVDA addon provides the function of reading math content. Although the original NVDA already equipped this feature by applying MathPlayer, some functions still needed to be improved, such as not providing or incomplete specific language translation, not providing specific language navigation and browsing and many more.\nNavigation interactive mode can segment a math content into smaller partial fragments for speaking, and select the read fragment and method through a series of keyboard key operations. This function can better understand the structure and items of long math content. The hierarchical relationship with the item.\nReading feature\n• Read math content written in MathML in web browser(Mozilla Firefox, Microsoft Internet Explorer and Google Chrome) or read Microsoft Word math content written in MathType. (MathPlayer installed only)\n• Interaction: Press space or enter on the MathML math object to enter navigation interactive mode. It means you can browse part of the sub-content in the math content and move between sub-contents or zoom the size of the sub-content\n• \nPressing \"Space\" in math content to open \"Access8Math interaction window\" which contains \"interactive\" and \"copy\" button.\n• interaction: Into math content to navigate and browse. Also, you can partially explore the subparts in expression and move or zoom the content between the subpart.\n• copy: Copy MathML object source code.\n• \nText review: Press the numeric keyboard 1-9 during navigation to read the mathematical content of the serialized text word by word and line by line\n• Analyze the overall mathematical meaning of the content: analyze the structure of MathML, and when it meets a specific rule, read it aloud in the mathematical meaning of the rule\n• Analyze the mathematical meaning of the content item: When navigating and browsing, it will prompt the meaning of the content under its upper content. For example, there are two score items, and moving between them will enroll the item as the denominator or numerator\nnavigation interactive mode command：\n• \"Down Arrow\": Zoom in on a smaller subpart of the math content.\n• \"Up Arrow\": Zoom out to a larger subpartthe of the math content .\n• \"Left Arrow\": Move to the previous math content.\n• \"Right Arrow\": Move to the next math content.\n• \"Home\": Move back to the top.(Entire math content)\n• \"Ctrl+c\": Copy object MathML source code\n• \"Numpad 1~9\": Reading the math content into serialized text using NVDA Reviewing Text.\n• \"ESC\": Exit the navigation mode.\nWriting feature\nWriting mixed content (text content and mathematical content):\nwrite mixed content\nUse delimiter(start delimiter \"(\" and end delimiter \")\", LaTeX block) to determine the area between the text content and the mathematical content, that is, the data in LaTeX block is mathematical content (LaTeX), and the data outside LaTeX block is text content.\nPress alt+h in edit field to convert an HTML document with mixed text data and mathematical data and can be reviewed or exported. The data in the LaTeX block will be converted to MathML for presentation with normal text.\n• review: Open the converted HTML document through a program that opens the .HTML extension by default.\n• export: Pack the converted HTML document into a zip file.\nPress alt+m key in edit field to pop up the markup command window, select \"LaTeX\" and press enter, the LaTeX block will be added to the current cursor and the cursor will be automatically moved into it for quick input the content.\nPress alt+l key in edit field to pop up the LaTeX command window, select the LaTeX command item to be added and press enter to add the corresponding LaTeX syntax at the current cursor and automatically move the cursor to the appropriate input point for quick Enter the content.\nLaTeX command window\n• Select the LaTeX command item and press f1~f12 to set the shortcut\n• Select the LaTeX command item and press d to remove the shortcut that has been set\n• Select the LaTeX command item and press enter to add the corresponding LaTeX syntax at the current cursor\nEdit cursor navigation move\n• In edit field, press alt+left arrow key to move to the start point of the previous data block\n• In edit field, press alt+down key without moving, but only read the content of the current data block\n• In edit field, press alt+right arrow key to move to the start point of the next data block\n• In edit field, press alt+home to move to the start point of the current data block\n• In edit field, press alt+end to move to the end point of the current data block\nEdit cursor navigation move and select\n• In the editing area, press alt+shift+left arrow key to move to the previous data block and select\n• In the editing area, press alt+shift+down key to move to the current data block and select\n• In the editing area, press alt+shift+right arrow to move to the next data block and select\nPress alt+s in edit field to turn on or off the shortcut mode. When the shortcut mode is on, press f1~f12 to quickly insert LaTeX syntax. When the shortcut mode is on, press shift+f1~f12 to read out the LaTeX commands currently bound to the shortcut.\nIn edit field and the cursor is in the LaTeX block, press alt+i to enter navigation interactive mode\nPress NVDA+shift+space in edit field to turn on or off the edit single letter navigation mode. When the edit single letter navigation mode is turned on, you can move the edit cursor with single letter navigation\nThe following keys by themselves jump edit cursor to the next available block, while adding the shift key causes them to jump edit cursor to the previous block:\n• l: move to the next LaTeX block\n• t: move to the next text block\nmixed content example: The solution of the quadratic equation in one variable (ax2+bx+c=0) is (\frac{-b\\pm\\sqrt{b2-4ac}}{2a}).\nsettings\nAll Access8Math menus are centralized in tools -> Access8Math.\nread feature settings\n• \nGeneral Settings dialog:\n• Language: Access8Math speaking language\n• Item interval time: Setting pause time between items. Values from 1 to 100, the smaller the value, the shorter the pause time, and the greater the value, the longer the pause time.\n• Showing Access8Math interaction window when entering interaction mode: Whether to show \"Access8Math interaction window\" when pressing the space key on the math object.\n• Analyze the mathematical meaning of the content: perform semantic analysis on the mathematical content, and when it meets a specific rule, using that rule to speak.\n• Reading pre-defined meaning in dictionary when navigating in interactive mode: When the pattern is definied in the dictionary, use dictionary to read the meaning of subpart in the upper layer part.\n• Reading of auto-generated meaning when navigating in interactive mode: When the pattern is not difined or incomplete in dictionary, use automatic generation function to read the meaning of subpart in the upper layer part.\n• Using a beep to alert no move: When navigating in interactive mode, It will hint by beep. If it is not checked, it will hint by speaking \"no move\".\n• Using NVDA+gesture to active action: Whether shortcut key needs to be added with NVDA key when write mixed content in edit field\n• \nRule Settings dialog box: select whether rules are actived.\nlocalization\n• \"Unicode dictionary\" allows customizing the reading method for each symbol text.\n• \"Mathematics Rules\" allows customizing the reading method for each type of mathematics.\n• \"Add a new language\" can add languages: that were not originally provided in the built-in. After adding, there will be more newly added language families in the general settings and can be used to define the reading method through the \"unicode dictionary\" and \"mathematics rules\" to reach localization\nMath Rules\nAccess8Math establishes 46 mathematical rules according to the mathematical type and logic to decide the reading math method and order. According to different local math reading logic, the math reading text and order can be changed. The method is as follows:\nEdit: After entering the \"math rule\", the window lists 46 math rules. Choose any math rule and select the \"Edit\" to enter the editing entry.\nThe \"editing entry\" can be divided into two major blocks, the \"Serialized ordering\" and the \"Child role\".\n• Serialized ordering: Math rule is divided into multiple blocks according to the reading order. In this area, the reading order of child node and the delimitation text of start, inter- and the end can be changed. Taking the fractional rule mfrac as an example, this rule is divided into five reading blocks. The order 0, 2, and 4 represent the initial prompt, the project segmentation prompt, and the end prompt, respectively, and the meanings text can be changed in each field. Order 1 and 3 adjust the reading sequence of child node which can be changed in the drop-down menu.\n• Child role: The next-level sub-item of the mathematical rule. Taking the fractional rule mfrac as an example, the rule contains the numerator and the denominator. The sub-content in the upper sub-content meaning can be changed in the child-node role field.\nExample: You can check the reading method of this math rule after editing. After clicking, a math content is preset the corresponding math rules for confirming whether the reading method is as expected.\nRecover default: Restores the list of math rules to their initial presets.\nImport: Import math rules files, which can be used to load math rules files.\nExport: Save the math rules file to the specified path to share or keep.\nexample\nMath contents in Wiki are all written by MathML.\n• Quadratic equation: https://en.wikipedia.org/wiki/Quadratic_equation\n• Matrix multiplication: https://en.wikipedia.org/wiki/Matrix_multiplication\n• Cubic function: https://en.wikipedia.org/wiki/Cubic_function\nQuadratic equation\n• LaTeX: (ax2+bx+c=0)\n• MathML: -b±b2-4ac2a\ngithub: https://github.com/tsengwoody/Access8Math\nPlease report any bugs or comments, thank you!\nAccess8Math v3.0 Update\n• Write mathematical content in AsciiMath\n• Write mathematical content in LaTeX\n• Writing mixed content (text content and mathematical content)\n• Use shortcut keys to move the cursor to different types of blocks in edit field\n• Use command menu to select commands in edit field\n• Set shortcuts in the LaTeX command menu\n• Review and export content in edit field to HTML\nAccess8Math v2.6 Update\n• Auto entering interactive mode when showing Access8Math interaction window.\n• You can choose how to hint no movement in interactive mode: beep or speech 'no move' two way.\n• The content of the current item will be repeated again When there is no movement.\nAccess8Math v2.5 Update\n• Adding Russian translation of rules and UI. Thanks to the translation work of Futyn-Maker.\n• Fixing compound symbol translation failed bug.\n• Removing duplicates of lowercase letters and added general uppercases in en unicode.dic(0370~03FF).\nAccess8Math v2.4 Update\n• Fix bug.\nAccess8Math v2.3 Update\n• Compatibility with Python3\n• refactoring module and fix code style\n• Adding one symbol vector rule\nAccess8Math v2.2 Update\n• fix bug incorrect speech when a single node has more characters.\n• Fix compatibility issue in NVDA 2019.2, thanks to pull requests of CyrilleB79.\n• Fix bug in unicode dict has duplicate symbols.\n• Add translations in French, thanks to the translation work of CyrilleB79.\n• Adjust keyboard shortcut.\nAccess8Math v2.1 Update\n• In \"General Settings\", you can set whether \"Access8Math interaction window\" is automatically displayed when entering interactive mode.\n• In interactive mode, \"interaction window\" can be displayed manually via ctrl+m when \"interaction window\" are not showed.\n• Fix multi-language switching bug.\n• Add translations in Turkish, thanks to the translation work of cagri (çağrı doğan).\n• Compatibility update for nvda 2019.1 check for add-on`s manifest.ini flag.\n• Refactoring dialog window source code.\nAccess8Math v2.0 Update\n• Add multi-language new-adding and customizing settings,and add three windows of \"unicode dictionary\", \"math rule\", \"New language adding\"\n• The \"unicode dictionary\" can customize the reading way of each math symbolic text.\n• \"math rule\" can customize the reading method and preview the modification through the sample button before completed.\n• \"New language adding\" allows adding language not provided in the built-in system. The newly language will be added to the general settings, and multi-language customization can be achieved through reading definition of \"unicode dictionary\" and \"mathematical rules\".\n• improved in interactive mode, you can use the number keys 7~9 to read sequence text in the unit of line.\nAccess8Math v1.5 update log\n• In \"general setting\" dialog box add setting pause time between items. Values from 1 to 100, the smaller the value, the shorter the pause time, and the greater the value, the longer the pause time.\n• Fix setting dialog box can't save configure in NVDA 2018.2.\nAccess8Math v1.4 update log\n• Adjust settings dialog box which divided into \"general setting\" and \"rules setting\" dialog box. \"General Settings\" is the original \"Access8Math Settings\" dialog box, and \"Rule Settings\" dialog box is for selecting whether specific rules are enabled.\n• \nNew rules\n• vector rule: When there is a \"⇀\" right above two Identifier, the item is read as \"Vector...\".\n• frown rule：When there is a \" ⌢ \" right above two Identifier, the item is read as \"frown...\".\n• \nFix bug.\nAccess8Math v1.3 update log\n• \nNew rule\n• positive rule: Read \"positive\" rather than \"plus\" when plus sign in first item or its previous item is certain operator.\n• square rule: When the power is 2, the item is read as \"squared\".\n• cubic rule: When the power is 3, the item is read as \"cubed\".\n• line rule: When there is \"↔\" right above two Identifier, the item is read as \"Line ...\".\n• line segment rule: When there is \"¯\" right above two Identifier, the item is read as \"Line segement ...\".\n• ray rule: When there is a \"→\" right above two Identifier, the item is read as \"Ray ...\"\n• \nAdd interaction window: Pressing \"Space\" in math content to open \"Access8Math interaction window\" which contains \"interaction\" and \"copy\" button.\n• interaction: Into math content to navigate and browse.\n• copy: Copy MathML object source code.\n• \nAdd zh_CN UI language(.po).\n• Adjust inheritance relationship between rules to ensure proper use of the appropriate rules in conflict.\n• Fix bug.\nAccess8Math v1.2 update log\n• \nNew rule\n• negative number rule: Read 'negative' rather than 'minus sign' when minus sign in first item or its previous item is certain operator.\n• integer add fraction rule: Read 'add' between integer and fraction when fraction previous item is integer.\n• \nProgram architecture improve\n• add sibling class\n• add dynamic generate Complement class\n• \nFix bug\nAccess8Math v1.1 update log\n• In navigation mode command, \"Ctrl+c\" copy object MathML source code.\n• \nSettings dialog box in Preferences:\n• Language: Access8Math reading language on math content.\n• Analyze the mathematical meaning of content: Semantically analyze the math content, in line with specific rules, read in mathematical meaning of that rules.\n• Read defined meaning in dictionary: When the pattern is definied in the dictionary, use dictionary to read the meaning of subpart in the upper layer part.\n• Read of auto-generated meaning: When the pattern is not difined or incomplete in dictionary, use automatic generation function to read the meaning of subpart in the upper layer part.\n• \nAdd some simple rule. Single rules are simplified versions of various rules. When the content only has one single item, for better understanding and reading without confusion, you can omit to choose not to read the script before and after the content.\n• Update unicode.dic.\n• Fix bug.",
  "https://addons.nvda-project.org/files/get.php?file=access8math",
  "https://addons.nvda-project.org/addons/access8math.\"lng\".html"
 ],
 "Text Information": [
  "unknown",
  "This add-on allows for getting information based on selected text. Simply select something and use a keystroke to get information. You should, hopefully, be presented with something that fits the context.\nnote: This package is distributed under the terms of the GNU General Public License, version 2 or later. Please see the file COPYING.txt for further details.\nkeystrokes\nnote: These keystrokes asume your using the english keyboard layout, and might not work otherwise. If there's a problem, first try changing them in the input gestures dialog.\n• NVDA+; (semicolon): provides information based on the text that's selected\n• NVDA+SHIFT+; (semicolon): provides information about text on the clipboard\n• NVDA+control+; (semicolon): speaks the last reported information. Press twice to get it displayed in a dialog.\nsupported services\nCurrently, the following features are supported:\n• IP address information using the IPInfoDB API. An API key is provided, however I by no means guarantee it'll always work. You can generate your own, and enter it at the top of init.py, replacing the old one.\n• english dictionary definitions from the princeton wordnetweb. Note: these definitions are not the best, and the database lacks definitions for simple words, e.g. could, you, etc.\n• ISBN lookups via the google books API\n• credit card type verification\nNote: Regular expressions are used to verify data. There are currently some that aren't used, phone numbers and emails. This might be changed in the future.\ncontributing\nContributions are appreciated. You can either submit a PR, or get in contact with the following info:\ntwitter: @cartertemm\nemail: crtbraille@gmail.com",
  "https://addons.nvda-project.org/files/get.php?file=txtinfo",
  "https://addons.nvda-project.org/addons/textInformation.\"lng\".html"
 ],
 "SentenceNav": [
  "unknown",
  "SentenceNav is an NVDA add-on that allows you to read text by sentences, as opposed to by paragraphs or words.\nPlease note that \"Jump to next  paragraph with text\" feature has been move to TextNav add-on that needs to be installed separately.\nKeystrokes\n• Alt+Down arrow: Go to next sentence.\n• Alt+Up arrow: Go to previous sentence.\n• NVDA+Alt+S: Speak current sentence.\n• Alt+Windows+Down arrow: Go to next phrase.\n• Alt+Windows+Up arrow: Go to previous phrase.",
  "https://addons.nvda-project.org/files/get.php?file=sentencenav",
  "https://addons.nvda-project.org/addons/sentenceNav.\"lng\".html"
 ],
 "BrailleExtender": [
  "2019.3 and beyond",
  "BrailleExtender is an NVDA add-on that provides various features at braille level. Currently, the following features are implemented:\n• reload two favorite braille display with shortcuts.\n• automatic review cursor tethering in terminal role like in PuTTY, Powershell, bash, cmd.\n• auto scroll.\n• switch between several input/output braille tables.\n• mark the text with special attributes through dot 7, dot 8 or both.\n• use two output braille tables simultaneously.\n• display tab signs as spaces.\n• reverse forward scroll and back scroll buttons.\n• say the current line during text scrolling either in review mode, or in focus mode or both.\n• translate text easily in Unicode braille and vice versa. E.g.: z <--> ⠵.\n• convert cell description to Unicode braille and vice versa. E.g.: 123 <--> ⠇.\n• lock braille keyboard.\n• launch an application/URL with gesture.\n• braille dictionaries.\n• type with one-hand from braille keyboard.\n• display undefined characters from braille tables (including emojis) using altenative representations.\n• enter any character from braille keyboard (including emojis).\n• skip blank lines during text scrolling.\n• and much more!\nFor some braille displays, it extends the braille display commands to provide:\n• offer complete gesture maps including function keys, multimedia keys, quick navigation, etc.;\n• emulate modifier keys, and thus any keyboard shortcut;\n• offer several keyboard configurations concerning the possibility to input dots 7 and 8, enter and backspace;\n• add actions and quick navigation through a rotor.\nOnce the add-on is installed, read the documentation and go through the settings using the BrailleExtender submenu (located in the NVDA menu).\nLet's explore some common features\nRepresentation of undefined characters\nThe extension allows you to customize how an undefined character should be represented within a braille table. To do so, go to the — Representation of undefined characters — settings. You can choose between the following representations:\n• Use braille table behavior (no description possible)\n• Dots 1-8 (⣿)\n• Dots 1-6 (⠿)\n• Empty cell (⠀)\n• Other dot pattern (e.g.: 6-123456)\n• Question mark (depending on output table)\n• Other sign/pattern (e.g.: ??)\n• Hexadecimal\n• Hexadecimal, HUC8\n• Hexadecimal, HUC6\n• Decimal\n• Octal\n• Binary\nYou can also combine this option with the “describe the character if possible” setting.\nNotes:\n• To distinguish the undefined set of characters while maximizing space, the best combination is the usage of the HUC8 representation without checking the “Show punctuation/symbol name for undefined characters if available” option.\n• To learn more about the HUC representation, see https://danielmayr.at/huc/\n• Keep in mind that definitions in tables and those in your table dictionaries take precedence over character descriptions, which also take precedence over the chosen representation for undefined characters.\nGetting Current Character Info\nThis feature allows you to obtain various information regarding the character under the cursor using the current input braille table, such as: the HUC8 and HUC6 representations; the hexadecimal, decimal, octal or binary values; A description of the character if possible; the Unicode braille representation and the braille pattern dots.\nPressing the defined gesture associated to this function once shows you the information in a flash message and a double-press displays the same information in a virtual NVDA buffer.\nOn supported displays the defined gesture is ⡉+space. No system gestures are defined by default.\nFor example, for the '&' character, we will get the following information:\n&: 0x26, 38, 0o46, 0b100110\nand (AMPERSAND [Po])\n⢿ (1234568)\n⣥⣺⡧, ⠿⠺⠏⠏\nAdvanced braille input\nThis feature allows you to enter any character from its HUC8 representation or its hexadecimal/decimal/octal/binary value. Moreover, it allows you to develop abbreviations. To use this function, enter the advanced input mode and then enter the desired pattern. Default gestures: NVDA+Windows+i or ⡊+space (on supported displays). Press the same gesture to exit this mode. Alternatively, an option allows you to automatically exit this mode after entering a single pattern. If you want to enter a character from its HUC8 representation, simply enter the HUC8 pattern. Since a HUC8 sequence must fit on 3 or 4 cells, the interpretation will be performed each time 3 or 4 dot combinations are entered. If you wish to enter a character from its hexadecimal, decimal, octal or binary value, do the following:\n. 1Enter ⠼\n. 2\nSpecify the basis as follows:\n• ⠭ or ⠓: for a hexadecimal value\n• ⠙: for a decimal value\n• ⠕: for an octal value\n• ⠃: for a binary value\n. 3\nEnter the value of the character according to the previously selected basis.\n. 4Press Space to validate.\nFor abbreviations, you must first add them in the dialog box — Advanced input mode dictionary —. Then, you just have to enter your abbreviation and press space to expand it. For example, you can define the following abbreviations: \"⠎⠺\" with \"sandwich\", \"⠋⠛⠋⠗\" to \"🇫🇷\".\nHere are some examples of sequences to be entered for given characters:\nCharacter\nHUC8\nHexadecimal\nDecimal\nOctal\nBinary\n👍 (thumbs up)\n⣭⢤⡙\n⠭1f44d or ⠓1f44d\n⠙128077\n⠕372115\n⠃11111010001001101\n😀 (grinning face)\n⣭⡤⣺\n⠭1f600 or ⠓1f600\n⠙128512\n⠕373000\n⠃11111011000000000\n🍑 (peach)\n⣭⠤⠕\n⠭1f351 or ⠓1f351\n⠙127825\n⠕371521\n⠃11111001101010001\n🌊 (water wave)\n⣭⠤⠺\n⠭1f30a or ⠓1f30a\n⠙127754\n⠕371412\n⠃11111001100001010\nNote: the HUC6 input is currently not supported.\nOne-hand mode\nThis feature allows you to compose a cell in several steps. This can be activated in the general settings of the extension's preferences or on the fly using NVDA+Windows+h gesture by default (⡂+space on supported displays). Three input methods are available.\nMethod #1: fill a cell in 2 stages on both sides\nWith this method, type the left side dots, then the right side dots. If one side is empty, type the dots correspondig to the opposite side twice, or type the dots corresponding to the non-empty side in 2 steps.\nFor example:\n• For ⠛: press dots 1-2 then dots 4-5.\n• For ⠃: press dots 1-2 then dots 1-2, or dot 1 then dot 2.\n• For ⠘: press 4-5 then 4-5, or dot 4 then dot 5.\nMethod #2: fill a cell in two stages on one side (Space = empty side)\nUsing this method, you can compose a cell with one hand, regardless of which side of the Braille keyboard you choose. The first step allows you to enter dots 1-2-3-7 and the second one 4-5-6-8. If one side is empty, press space. An empty cell will be obtained by pressing the space key twice.\nFor example:\n• For ⠛: press dots 1-2 then dots 1-2, or dots 4-5 then dots 4-5.\n• For ⠃: press dots 1-2 then space, or 4-5 then space.\n• For ⠘: press space then 1-2, or space then dots 4-5.\nMethod #3: fill a cell dots by dots (each dot is a toggle, press Space to validate the character)\nIn this mode, each dot is a toggle. You must press the space key as soon as the cell you have entered is the desired one to input the character. Thus, the more dots are contained in the cell, the more ways you have to enter the character.\nFor example, for ⠛, you can compose the cell in the following ways:\n• Dots 1-2, then dots 4-5, then space.\n• Dots 1-2-3, then dot 3 (to correct), then dots 4-5, then space.\n• Dot 1, then dots 2-4-5, then space.\n• Dots 1-2-4, then dot 5, then space.\n• Dot 2, then dot 1, then dot 5, then dot 4, and then space.\n• Etc.",
  "https://addons.nvda-project.org/files/get.php?file=brlext",
  "https://addons.nvda-project.org/addons/brailleExtender.\"lng\".html"
 ],
 "IndentNav": [
  "unknown",
  "This add-on allows NVDA users to navigate by indentation level or offset of lines or paragraphs. In browsers it allows to quickly find paragraphs with the same offset from the left edge of the screen, such as first level comments in a hierarchical tree of comments. Also while editing source code in many programming languages, it allows to jump between the lines of the same indentation level, as well as quickly find lines with greater or lesser indentation level.\nUsage in browsers\nIndentNav can be used to navigate by offset from the left edge of the screen. IN particular, you can press NVDA+Alt+DownArrow or UpArrow to jump to the next or previous paragraph that has the same offset. For example, this can be useful when browsing hierarchical trees of comments (e.g. on reddit.com) to jump between first level comments and skipping all the higher level comments.\nStrictly speaking, IndentNav can be used in any application, for which NVDA provides a tree interceptor object.\nKeystrokes:\n• NVDA+Alt+UpArrow or DownArrow: Jump to previous or next paragraph with the same offset.\n• NVDA+alt+LeftArrow: Jump to previous paragraph with lesser offset.\n• NVDA+Alt+RightArrow: Jump to next paragraph with greater offset.\nUsage in text editors\nIndentNav can also be useful for editing source code in many programming languages. Languages like Python require the source code to be properly indented, while in many other programming languages it is strongly recommended. With IndentNav you can press NVDA+Alt+DownArrow or UpArrow to jump to next or previous line with the same indentation level. You can also press NVDA+Alt+LeftArrow to jump to a parent line, that is a previous line with lower indentation level. In Python you can easily find current function definition or class definition. You can also press NVDA+Alt+RightArrow to go to the first child of current line, that is next line with greater indentation level.\nIf your NVDA is set to express line indentation as tones, then IndentNav will quickly play the tones of all the skipped lines. Otherwise it will only crackle to roughly denote the number of skipped lines.\nKeystrokes:\n• NVDA+Alt+UpArrow or DownArrow: Jump to previous or next line with the same indentation level within the current indetnation block.\n• NVDA+Alt+Control+UpArrow or DownArrow: Force-jump to previous or next line with the same indentation level. This command will jump to other indentation blocks (such as other Python functions) if necessary.\n• NVDA+alt+LeftArrow: Jump to parent - that is previous line with lesser indentation level.\n• NVDA+Alt+RightArrow: Jump to first child - that is next line with greater indentation level within the same indentation block.",
  "https://addons.nvda-project.org/files/get.php?file=indentnav",
  "https://addons.nvda-project.org/addons/indentNav.\"lng\".html"
 ],
 "Mozilla Apps Enhancements": [
  "unknown",
  "This add-on provides NVDA enhancements for Mozilla aps.\nFirefox\n• NVDA+A (desktop) or NVDA+Control+A (laptop) Reads the page address. If pressed twice quickly, copies it to clipboard.\n• NVDA+End (desktop) or NVDA+Shift+End (laptop) Reads the status bar. If pressed twice quickly, copies it to clipboard.\n• NVDA+F8 Shows a list of opened tabs. If pressed twice quickly, shows buttons of tool bar.\n• NVDA+Control+N Reads the last notification and it takes the system focus to it if it is possible. By pressing two times quickly shows the history of notifications.\n• NVDA+F6 Brings the focus to the document.\nThunderbird\n• In a message window:\n• Control+Shift+(1-4) Reads the sender and recipients of the message. If pressed twice quickly, opens the options menu.\n• Control+Shift+5 Reads the subject of the message.\n• Control+Shift+6 Reads date of the message.\n• Control+Shift+A Brings the focus to the list of attachments, if any. (These scripts are also available in the list of messages if you activate the preview pane.)\n• In the bar of fast filtering:\n• Press down Arrow to display more options, enter to check/unchek the selected option.\n• In messages list:\n• If the preview pane is active, press NVDA+downArrow (desktop) or NVDA+A (laptop) to read the message without leaving the list.\n• Control+NVDA+1-9 moves between columns.\n• NVDA+H Displays a dialog in which you can change the order of the columns in the message list.\nKeystrokes can be customized in Preferences of NVDA > Input gestures when Firefox or Thunderbird are open.",
  "https://addons.nvda-project.org/files/get.php?file=moz",
  "https://addons.nvda-project.org/addons/mozillaScripts.\"lng\".html"
 ],
 "sayCurrentKeyboardLanguage": [
  "unknown",
  "This addon was created following a request from a member on the nvda-addons mailing list.\nIt provides a keyboard shortcut, NVDA + F4, which allows to retrieve and give the language of the current keyboard.\nIf pressed twice, gives the default language of the system.\nAt the first version of this module, it had been proposed as simple globalPlugin to paste in the configuration directory of NVDA, it was then transformed into addon.\nNotes\nIf the NVDA + F4 keyboard shortcut conflicts with another command, you can change it by going to the Preferences menu of NVDA, in the \"Input gestures\" submenu.\nYou will then find the script in the \"System status\" category.\nCompatibility\n• This add-on is compatible with the versions of NVDA ranging from 2014.3 until 2019.3.",
  "https://addons.nvda-project.org/files/get.php?file=ckbl",
  "https://addons.nvda-project.org/addons/sayCurrentKeyboardLanguage.\"lng\".html"
 ],
 "Object Location Tones": [
  "2019.3 and beyond",
  "• Note: this add-on is deprecated and will become end of life in 2021.\nAfter installing this add-on and restarting NVDA (or when you enable this add-on), as you navigate to different controls, you'll hear tones to indicate where the object is located on screen. To turn object location tones off, uninstall or disable this add-on from add-ons manager.\nImportant notes:\n• If using Audio Themes or similar add-ons, it is advised to disable Object Location Tones add-on.\n• If a control is offscreen, tones will not be played.",
  "https://addons.nvda-project.org/files/get.php?file=objLoc",
  "https://addons.nvda-project.org/addons/objLocationTones.\"lng\".html"
 ],
 "Lambda Add-On for NVDA": [
  "unknown",
  "This project is an appModule for the LAMBDA Software. It has been inspired by the work of Peter Lecky at the Comenius University. LAMBDA (Linear Access to Mathematic for Braille Device and Audio-synthesis) is a software that helps blind people to read and write math using a braille display and/or a speech synthesizer. LAMBDA is the result of an EU-Project. For more information about LAMBDA please visit https://www.lambdaproject.org/.\nThe current version of the addon has braille tables for Italian and Spanish languages and its interface is available in most of the NVDA's official languages, because it is translated by the NVDA translations community. If you are a non-italian user of LAMBDA and you would like to contribute with the porting of the braille table in your language, feel free to contact the author (see below) or subscribe the project mailing list.\nPlease note: This addon has been developed by Alberto Zanella as a voluntary activity. Nor the author or the contributors are involved in selling and / or development of the software Lambda. If you need more information about Lambda, or you need support on how to use it, please contact your local distributor. If you are encountering any difficulties when using or installing this addon, please contact the author or use the \"Issues\" link on the Github project page.\nOfficial Github Repository\nAddon Features:\nSpeech support:\n• Dialogs and menus are properly reported;\n• Natural speech support for math formulas using the Lambda math engine, i.e. \"compound root 3 sep compound root 3 x plus 24, close compound root, minus 3 equals 0\";\n• implemented the Reading by character, words, lines and Say All;\n• Speaks when a block of text is selected or extended (using CTRL+B and SHIFT+CTRL+B);\n• Speaks when moving in the text editor using standard Windows commands and Lambda-specific commands;\n• Both Extended and Short speech modes are supported (you can select it using the Tools menu in Lambda);\n• Special dialogs like structure mode, calculator, and matrix window are now correctly reported and NVDA reads correctly when moving the cursor around or when new text is typed ;\n• Typing echo uses the Lambda text processor, so symbols and markers will be correctly reported.\nBraille support:\n• The addon installs (inside the user profile directory) and activates a custom braille table. This table may be different for different languages. Custom braille tables were made from ones in the Lambda plugin for JAWS (jbt file). Then symbols and markers are represented using the same dots patterns;\n• The addon creates an NVDA profile for a standard braille configuration. By this, the output is set to the custom braille table only when the Lambda application is active;\n• Dialogs and menus are properly reported in braille;\n• The content of the editor is correctly rendered in braille and the user is able to move using braille scrolling keys or cursor routing keys;\n• Starting from the addon version 1.1.0, there are two ways in which the text in the Lambda editor is rendered: \"Flat mode\" and \"non-Flat Mode\". When the \"Flat mode\" is on, NVDA will use the Display Model to retrieve information from the editor and to determine the caret position. This is specially beneficial when the user needs to move around on the screen, even in white spaces. When the \"Flat Mode\" is set to \"off\", text rendering on the braille display is more stable, since NVDA uses Windows API to retrieve it. However when the the caret is moved in white spaces next to the end of the line of text, the braille display does not follow the real cursor as long as a non-white space is added by the user.\nThe \"flat mode\" is active by default. You can toggle \"flat mode\" on or off by pressing NVDA+SHIFT+F.\nWe strongly recommend to disable the Flat Mode if you are using custom DPI in Windows (Custom sizing option), especially when you have screen settings with more than 96 dpi (larger than 100%).\n• The structure of dialog boxes is easier, repeated information has been removed;\n• The selection will be marked properly using dots 7 and 8, and marking is properly refreshed while standard Windows commands (SHIFT+ARROWS) or Lambda specific commands (CTRL+B, CTRL+SHIFT+B) are pressed.\nBefore starting to use this addon.\nThis addon creates an NVDA profile named \"lambda\" which is associated with the \"lambda.exe\" application. The profile automatically sets all braille options: the custom braille table, the focus tethering and flat mode settings.\nIf a previous profile with the same name is present in your system, the addon will not override it and you have to manually adjust your configuration profile.\nTo stave off this situation, if you have specific settings you'd like to preserve, you can use the \"Revert LAMBDA Profile Wizard\". The shortcut to start this tool is NVDA+alt+r (when focused in LAMBDA).\nAn easy option is also to delete old versions of the \"lambda\" profile after the installation of the addon. To do so, open the NVDA menu, select the \"Configuration profiles\" menu Item and press ENTER.\nIn the Configuration profiles dialog, you'll be able to locate and delete the \"lambda\" profile. The profile will be re-created the next time the Lambda application is started.\nDeleting the \"lambda\" profile should be an easy solution also when the addon runs into any problem. For instance, if the braille table is not properly set, instead of manually configuring the profile, you can simply delete it. The addon will create a new one the next time you'll load the Lambda editor.\nEach time the Lambda editor is started, this addon checks if a profile with the name \"lambda\" exists. If it doesn't, it automatically generates a profile with the following form:\nfilename : userData\\profiles\\lambda.ini :\n\n[braille]\n    readByParagraph = False\n    tetherTo = focus\n    translationTable = path-to-the-addon-brailleTable-dir\tableName\n\n[lambda]\n    brailleFlatMode = True\nWhere :\n• path-to-the-addon-brailleTable-dir : is the absolute path of the addon directory + \"\brailleTables\"\n• tableName : depends on the active NVDA language. Currently only the italian and Spanish braille tables, \"lambda-ita.utb\" and \"lambda-esp.utb\" respectively, is present.\nAddon Keyboard Shortcuts:\n• NVDA+Shift+f: Toggle braille flat mode on or off;\n• NVDA+alt+r: Open the \"Revert LAMBDA Profile Wizard\";\n• NVDA+d: Duplicate lines (use this instad of control+d).\nKnown issues:\nDue to a bug present in LAMBDA, the add-on provides an extra-logic that reports white spaces. This logic may fail in the following situations:\n• When words like \"space\", \"spazio\" \"Espacio\" etc. are inserted into the text, they may be reported by NVDA as the local NVDA language translation.\n• Blank lines are not reported by the LAMBDA speech engine. The user will hear the translation of the word \"space\" instead. This could be both a blank line or a line containing only the word \"space\".\nUseful tips\nThis is a set of tips that will help you on using the addon in a more eficient way.\n• Character-by-character reporting: Normally, when working with maths you would like NVDA to report things you're writing character by character. To do this, there are a couple of simple steps: ensure to have the focus on the LAMBDA's window or one of its variants (the six dots representation, for example); press NVDA+2 (number two) or navigate to NVDA menu>Preferences>Keyboard settings and check the box to Speak typed characters; go to LAMBDA>Options>Voice paramethers and ensure the checkbox \"echo\" is ON, otherwhise NVDA won't receive anything from the speech engine while you are typing. And done, NVDA will speak written characters, but don't worry, only in LAMBDA or its special windows, the settings for the rest of applications will be left as they were.\nAddon mailing list:\nTo report bugs, suggestions or if you want to contribute you can subscribe the Addon Group (in English). You can subscribe from the website: https://groups.io/g/lambda-nvda.",
  "https://addons.nvda-project.org/files/get.php?file=lambda",
  "https://addons.nvda-project.org/addons/lambda.\"lng\".html"
 ],
 "Speak Passwords": [
  "2019.3",
  "This addon allows NVDA to speak typed characters and words while typing into password fields. However, navigation in password fields is unchanged.\nUsage\nPasswords are spoken automatically when this addon is installed, controlled by \"Speak typed characters\" and \"Speak typed words\".\nTo stop passwords from being spoken, disable Speak typed characters/words or disable/uninstall the add-on.",
  "https://addons.nvda-project.org/files/get.php?file=spp",
  "https://addons.nvda-project.org/addons/speakPasswords.\"lng\".html"
 ],
 "Clipspeak": [
  "2018.3 / 2019.3",
  "Clipspeak is an addon that allows NVDA to automatically announce clipboard operations (such as cut, copy and paste), along with other common editing operations such as select all, undo and redo. In order to prevent announcement in inappropriate situations, Clipspeak performs checks on the control and the clipboard in order to make an informed decision as to whether such an announcement is necessary. Because of this, Clipspeak's announcements may be inaccurate. By default, Clipspeak's gestures are mapped to those commonly used by English versions of Windows, I.E.:\n• CTRL+A: Select all\n• CTRL+Z: Undo\n• CTRL+Y: Redo\n• CTRL+X: Cut\n• CTRL+C: Copy\n• CTRL+V: Paste\nIf these are not the shortcuts commonly used for these tasks on your version of Windows, you will need to remap these gestures in the input gestures configuration.",
  "https://addons.nvda-project.org/files/get.php?file=cs",
  "https://addons.nvda-project.org/addons/clipspeak.\"lng\".html"
 ],
 "Review Cursor Copier": [
  "unknown",
  "This NVDA add-on provides various commands for copying the text under the review cursor to the clipboard. Currently, the following commands are implemented:\n• Copy the line under the review cursor\n• Copy the word under the review cursor\n• Copy from the start of the current line to the review cursor\n• Copy from the review cursor to the end of the current line\n• Copy from the start of the current word to the review cursor\n• Copy from the review cursor to the end of the current word\nNone of these commands have key bindings by default. Please use the input gestures dialog located under the NVDA settings menu to set them. All of the commands provided by this add-on can be found under the \"text review\" category. More information about setting and modifying input gestures can be found in the NVDA user guide.\nLicense\nThis work is licensed under the GNU General Public License, version 2.",
  "https://addons.nvda-project.org/files/get.php?file=rccp",
  "https://addons.nvda-project.org/addons/reviewCursorCopier.\"lng\".html"
 ],
 "Mush Client": [
  "unknown",
  "This add-on enhances the mush Client for use with NVDA.\nFrom the add-on description:\nThis add-on provides the following accessibility improvements for Mush Client:\n. 1The NVDA navigator object is now automaticly set to the output window of Mush Client in order to make reviewing output easier.\n. 2Two new hotkeys (NVDA-8 and NVDA-9) toggle the \"speech interrupt for typed characters\" and \"speech interrupt for enter key\" settings respectively.\n. 3Additionally, NVDA-Enter and numbpad-Enter will set the position of the NVDA navigator object to the last line of text in the output window and speak it.\n. 4The \"report Dynamic Content Changes\", \"caret moves review cursor\", \"speech interrupt for typed characters\", and \"speech interrupt for enter key\" settings are now automatically saved to a separate configuration file when the Mush Client window loses focus and restored when it receives focus again.\nNote: since most people will be using Mush Client with a speech plugin for auto-speaking incoming text, NVDA's \"report Dynamic Content Changes\" setting is disabled by default to avoid speaking incoming lines twice. If you want to turn on the automatic speaking of incoming lines by NVDA, toggle this setting on with the NVDA-5 hotkey.",
  "https://addons.nvda-project.org/files/get.php?file=mush",
  "https://addons.nvda-project.org/addons/mushClient.\"lng\".html"
 ],
 "mIRC": [
  "unknown",
  "This is an enhanced version of the mIRC app module that comes with NVDA.\nFrom add-on description:\nThis add-on is an enhanced version of the mIRC App Module included in NVDA.\n. 1The NVDA navigator object is now automaticly set to the output window of mIRC in order to make reviewing output easier.\n. 2Two new hotkeys (NVDA-8 and NVDA-9) toggle the \"speech interrupt for typed characters\" and \"speech interrupt for enter key\" settings respectively.\n. 3Additionally, NVDA-Enter and numbpad-Enter will set the position of the NVDA navigator object to the last line of text in the output window and speak it.\n. 4The \"report Dynamic Content Changes\", \"caret moves review cursor\", \"speech interrupt for typed characters\", and \"speech interrupt for enter key\" settings are now automaticly saved to a special configuration file when the mIRC window loses focus and restored when it receives focus again.\nNote: NVDA's \"report Dynamic Content Changes\" setting is enabled by default. If you use a speech system for mIRC such as Talking IRC or mIRC With Speech, toggle this setting off with the NVDA-5 hotkey to prevent incoming lines from being spoken twice.",
  "https://addons.nvda-project.org/files/get.php?file=mirc",
  "https://addons.nvda-project.org/addons/mirc.\"lng\".html"
 ],
 "ObjPad": [
  "2020.1 / 2020.4",
  "This add-on provides quick commands to manage objects on screen, including navigation and other possibilities.\nCommands\n• Control+NVDA+TAB: Steps through arrow key modes (see below for details).\nArrow key modes\nThe add-on provides four ways to use arrow keys:\n• Classic (or normal mode): use arrow keys to move cursor.\n• Object nav: use arrow keys to move to next/previous/parent/first child objects.\n• Web: use arrow keys to cycle through elements and move between them.\n• Scan mode: use arrow keys to move through objects on screen regardless of hierarchy.\nThe following commands are available with arrow keys set to object nav:\n• Right arrow: next object.\n• Left arrow: previous object.\n• Up arrow: parent object.\n• Down arrow: first child object.\n• SPACE or ENTER: activate.\nWith web mode active (elements are normal or moving by object, link, form field, heading, frame, table, list, landmark):\n• Right arrow: next element.\n• Left arrow: previous element.\n• Up arrow: previous element type.\n• Down arrow: next element type.\n• SPACE or ENTER: activate.\nWith scan mode active:\n• Down arrow: next object or the next line.\n• Up arrow: previous object or previous line.\n• Right arrow: review next character.\n• Left arrow: previous character.\n• Control+right arrow: next word.\n• Control+left arrow: previous word.\n• SPACE or ENTER: activate.",
  "https://addons.nvda-project.org/files/get.php?file=objPad",
  "https://addons.nvda-project.org/addons/objPad.\"lng\".html"
 ],
 "Report Symbols": [
  "2019.3 +",
  "This add-on allows to listen the typed symbols (non alphanumeric or blank characters), even when the speaking of typed characters is turned off in NVDA.\nIt's based on the old ReportSymbols add-on, developed by the same author. You should uninstall it to use this version.\nPreferences menu\n• Report Symbols settings: Allows to set preferences for the speaking of typed symbols.\nNote: A gesture to open this dialog can be assigned from NVDA menu, Preferences submenu, Input gestures dialog, Configuration category.",
  "https://addons.nvda-project.org/files/get.php?file=rsy-o",
  "https://addons.nvda-project.org/addons/reportSymbols.\"lng\".html"
 ],
 "StationPlaylist": [
  "2021.2 +",
  "This add-on package provides improved usage of StationPlaylist Studio and other StationPlaylist apps, as well as providing utilities to control Studio from anywhere. Supported apps include Studio, Creator, Track Tool, VT Recorder, and Streamer, as well as SAM, SPL, and AltaCast encoders.\nFor more information about the add-on, read the add-on guide.\nIMPORTANT NOTES:\n• This add-on requires StationPlaylist suite 5.30 or later.\n• If using Windows 8 or later, for best experience, disable audio ducking mode.\n• Starting from 2018, changelogs for old add-on releases will be found on GitHub. This add-on readme will list changes from version 21.10 (2021) onwards.\n• While Studio is running, you can save, reload saved settings, or reset add-on settings to defaults by pressing Control+NVDA+C, Control+NVDA+R once, or Control+NVDA+R three times, respectively. This is also applicable to encoder settings - you can save and reset (not reload) encoder settings if using encoders.\nمفاتيح الاختصار\nMost of these will work in Studio only unless otherwise specified.\n• Alt+Shift+T من نافذة الاستوديو: للإعلان عن الوقت المنقضي للمسار أو التراك المشغل حاليا.\n• Control+Alt+T (مسح بإصبعين لأسفل بنمط SPL) من نافذة الاستوديو: للإعلان عن الوقت المتبقي للمسار أو التراك المشغل حاليا.\n• NVDA+Shift+F12 (two finger flick up in SPL touch mode) from Studio window: announces broadcaster time such as 5 minutes to top of the hour. Pressing this command twice will announce minutes and seconds till top of the hour.\n• Alt+NVDA+1 (two finger flick right in SPL mode) from Studio window: Opens alarms category in Studio add-on configuration dialog.\n• Alt+NVDA+1 from Creator's Playlist Editor and Remote VT playlist editor: Announces scheduled time for the loaded playlist.\n• Alt+NVDA+2 from Creator's Playlist Editor and Remote VT playlist editor: Announces total playlist duration.\n• Alt+NVDA+3 from Studio window: Toggles cart explorer to learn cart assignments.\n• Alt+NVDA+3 from Creator's Playlist Editor and Remote VT playlist editor: Announces when the selected track is scheduled to play.\n• Alt+NVDA+4 from Creator's Playlist Editor and Remote VT playlist editor: Announces rotation and category associated with the loaded playlist.\n• Control+NVDA+f from Studio window: Opens a dialog to find a track based on artist or song name. Press NVDA+F3 to find forward or NVDA+Shift+F3 to find backward.\n• Alt+NVDA+R من نافذة الاستوديو: لخطوات إعدادات الإعلان عن البحث في المكتبة\n• Control+Shift+X من نافذة الاستوديو: لخطوات إعدادات ميقات البرايل.\n• Control+Alt+left/right arrow (while focused on a track in Studio, Creator, Remote VT, and Track Tool): Move to previous/next track column.\n• Control+Alt+Home/End (while focused on a track in Studio, Creator, Remote VT, and Track Tool): Move to first/last track column.\n• Control+Alt+up/down arrow (while focused on a track in Studio, Creator, Remote VT, and Track Tool): Move to previous/next track and announce specific columns.\n• Control+NVDA+1 through 0 (while focused on a track in Studio, Creator (including Playlist Editor), Remote VT, and Track Tool): Announce column content for a specified column (first ten columns by default). Pressing this command twice will display column information on a browse mode window.\n• Control+NVDA+- (hyphen while focused on a track in Studio, Creator, Remote VT, and Track Tool): display data for all columns in a track on a browse mode window.\n• NVDA+V while focused on a track (Studio's playlist viewer only): toggles track column announcement between screen order and custom order.\n• Alt+NVDA+C while focused on a track (Studio's playlist viewer only): announces track comments if any.\n• Alt+NVDA+0 from Studio window: Opens the Studio add-on configuration dialog.\n• Alt+NVDA+P from Studio window: Opens the Studio broadcast profiles dialog.\n• Alt+NVDA+F1: Open welcome dialog.\nالأوامر غير المعينة\nThe following commands are not assigned by default; if you wish to assign them, use Input Gestures dialog to add custom commands. To do so, from Studio window, open NVDA menu, Preferences, then Input Gestures. Expand StationPlaylist category, then locate unassigned commands from the list below and select \"Add\", then type the gesture you wish to use.\n• التحول إلى نافذة الأستديو من أي برنامج آخر.\n• نمط التحكم في تطبيق SPL.\n• Announcing Studio status such as track playback from other programs.\n• Announcing encoder connection status from any program.\n• نمط SPL المساعد من الأستوديو.\n• الإعلان عن الوقت متضمن الثواني من SPL Studio.\n• الإعلان عن درجة الحرارة\n• الإعلان عن عنوان المسار التالي إذا كان مجدول.\n• الإعلان عن عنوان المسار المشغل حاليا\n• تحديد المسار الحالي لبدأ تحليل وقت المسار\n• إجراء تحليل وقت المسار\n• Take playlist snapshots.\n• البحث عن نص بأعمدة محددة\n• البحث عن مسارات تقع بين معدل وقت معين عبر باحث عن معدلات الوقت.\n• تشغيل أو تعطيل حالة بث البيانات بسرعة\nAdditional commands when using encoders\nThe following commands are available when using encoders:\n• F9: connect the selected encoder.\n• F10 (SAM encoder only): Disconnect the selected encoder.\n• Control+F9: Connect all encoders.\n• Control+F10 (SAM encoder only): Disconnect all encoders.\n• F11: ينتقل بين تشغيل وتعطيل الرجوع لنافذة الاستوديو بعد الاتصال بالخادم.\n• shift+F11: ينتقل بين تشغيل وتعطيل إمكانية تشغيل أول مسار بعد الاتصال بالخادم.\n• Control+F11: التبديل بين تشغيل وتعطيل المراقبة الخلفية للتشفير المحدد.\n• Control+F12: opens a dialog to select the encoder you have deleted (to realign encoder labels and settings).\n• Alt+NVDA+0 and F12: Opens encoder settings dialog to configure options such as encoder label.\nفضلا عن ذلك, إتاحة أوامر لمراجعة الأعمدة وتشمل:\n• Control+NVDA+1: موقع التشفير\n• Control+NVDA+2: encoder label.\n• Control+NVDA+3 من sam encoder: تنسيق التشفير.\n• Control+NVDA+3 from SPL and AltaCast Encoder: Encoder settings.\n• Control+NVDA+4 from SAM Encoder: Encoder connection status.\n• Control+NVDA+4 from SPL and AltaCast Encoder: Transfer rate or connection status.\n• control+nvda+5 من تشفير SAM: وصف حالة الاتصال\nمساعد نمط أوامر SPL\nThis layer command set allows you to obtain various status on SPL Studio, such as whether a track is playing, total duration of all tracks for the hour and so on. From any SPL Studio window, press the SPL Assistant layer command, then press one of the keys from the list below (one or more commands are exclusive to playlist viewer). You can also configure NVDA to emulate commands from other screen readers.\nThe available commands are:\n• A: التشغيل الآلي.\n• C (Shift+C in JAWS layout): Title for the currently playing track.\n• C (JAWS layout): Toggle cart explorer (playlist viewer only).\n• D (R in JAWS layout): Remaining duration for the playlist (if an error message is given, move to playlist viewer and then issue this command).\n• E: Metadata streaming status.\n• Shift+1 through Shift+4, Shift+0: Status for individual metadata streaming URL's (0 is for DSP encoder).\n• F: Find track (playlist viewer only).\n• H: مدة الموسيقى للساعة الحالية.\n• Shift+H: Remaining track duration for the hour slot.\n• I (L in JAWS layout): Listener count.\n• K: Move to the marked track (playlist viewer only).\n• Control+K: Set the current track as the place marker track (playlist viewer only).\n• L (Shift+L in JAWS layout): Line in.\n• M: الميكروفون\n• N: لتشغيل المسار التالي.\n• P: حالة التشغيل (المسار يعمل أم متوقف).\n• shift+P: حدة المسار الحالي.\n• R (Shift+E in JAWS layout): Record to file enabled/disabled.\n• shift+r: مراقبة حالة التقدم في البحث بالمكتبة.\n• S: Track starts (scheduled).\n• Shift+S: Time until selected track will play (track starts in).\n• T: Cart edit/insert mode on/off.\n• U: وقت الاستوديو\n• W: حالة التقس ودرجة الحرارة إذا كانت معدة.\n• y: حالة قائمة التشغيل المعدلة.\n• F8: Take playlist snapshots (number of tracks, longest track, etc.).\n• Shift+F8: Request playlist transcripts in numerous formats.\n• F9: Mark current track for start of playlist analysis (playlist viewer only).\n• F10: Perform track time analysis (playlist viewer only).\n• f12: الانتقال بين الملف الحالي وملف لم يتم تعريفه من قبل.\n• F1: نمط المساعدة\n• shift+f1: فتح دليل المستخدم على الإنترنت\nنمط التحكم في تطبيق SPL\nهو عبارة عن نمط يزودك بمجموعة من المفاتيح كي تتمكن من التحكم في التطبيق من أي مكان. اضغط أمر نمط التحكم في SPL وسينطق NVDA, \"نمط التحكم في Station PlayList Studio.\" اضغط أي من الأوامر التي سيلي ذكرها للتحكم في مختلف إعدادات الاستوديو بالتطبيق كالتحكم في تشغيل أو تعطيل الميكروفون, أو تشغيل المسار التالي.\nوالأوامر التي يتيحها هذا النمط هي:\n• P: Play the next selected track.\n• U: Pause or unpause playback.\n• S: Stop the track with fade out.\n• T: Instant stop.\n• M: Turn on microphone.\n• Shift+M: Turn off microphone.\n• A: Turn on automation.\n• Shift+A: Turn off automation.\n• L: Turn on line-in input.\n• Shift+L: Turn off line-in input.\n• R: Remaining time for the currently playing track.\n• Shift+R: Library scan progress.\n• C: Title and duration of the currently playing track.\n• Shift+C: Title and duration of the upcoming track if any.\n• E: Encoder connection status.\n• I: Listener count.\n• Q: Studio status information such as whether a track is playing, microphone is on and others.\n• Cart keys (F1, Control+1, for example): Play assigned carts from anywhere.\n• H: Layer help.\nTrack and microphone alarms\nBy default, NVDA will play a beep if five seconds are left in the track (outro) and/or intro, as well as to hear a beep if microphone has been active for a while. To configure track and microphone alarms, press Alt+NVDA+1 to open alarms settings in Studio add-on settings screen. You can also use this screen to configure if you'll hear a beep, a message or both when alarms are turned on.\nالباحث عن المسارات\nIf you wish to quickly find a song by an artist or by song name, from track list, press Control+NVDA+F. Type or choose the name of the artist or the song name. NVDA will either place you at the song if found or will display an error if it cannot find the song you're looking for. To find a previously entered song or artist, press NVDA+F3 or NVDA+Shift+F3 to find forward or backward.\nملحوظة: الباحث عن المسارات حساس لحالة الأحرف.\nمستكشف التنويهات\nوفقا لإصدار البرنامج, يتيح لك برنامج SPL تعيين مفتاح ل96 تنويه. يتيح لك NVDA سماع أي تنويه معين لهذه الأوامر.\nTo learn cart assignments, from SPL Studio, press Alt+NVDA+3. Pressing the cart command once will tell you which jingle is assigned to the command. Pressing the cart command twice will play the jingle. Press Alt+NVDA+3 to exit cart explorer. See the add-on guide for more information on cart explorer.\nتحليل وقت المسار\nللحصول على مدة المسارات المحددة لتشغيلها, قم بتحديد المسار الحالي لبدأ عملية تحليل الوقت (من مساعد spl اضغط على f9), ثم اضغط على f10 بعد الانتهاء من التحديد.\nColumns Explorer\nBy pressing Control+NVDA+1 through 0, you can obtain contents of specific columns. By default, these are first ten columns for a track item (in Studio: artist, title, duration, intro, outro, category, year, album, genre, mood). For playlist editor in Creator and Remote VT client, column data depends on column order as shown on screen. In Studio, Creator's main track list, and Track Tool, column slots are preset regardless of column order on screen and can be configured from add-on settings dialog under columns explorer category.\nTrack column announcement\nYou can ask NVDA to announce track columns found in Studio's playlist viewer in the order it appears on screen or using a custom order and/or exclude certain columns. Press NVDA+V to toggle this behavior while focused on a track in Studio's playlist viewer. To customize column inclusion and order, from column announcement settings panel in add-on settings, uncheck \"Announce columns in the order shown on screen\" and then customize included columns and/or column order.\nPlaylist snapshots\nYou can press SPL Assistant, F8 while focused on a playlist in Studio to obtain various statistics about a playlist, including number of tracks in the playlist, longest track, top artists and so on. After assigning a custom command for this feature, pressing the custom command twice will cause NVDA to present playlist snapshot information as a webpage so you can use browse mode to navigate (press escape to close).\nPlaylist Transcripts\nPressing SPL Assistant, Shift+F8 will present a dialog to let you request playlist transcripts in numerous formats, including in a plain text format, an HTML table or a list.",
  "https://addons.nvda-project.org/files/get.php?file=spl",
  "https://addons.nvda-project.org/addons/stationPlaylist.\"lng\".html"
 ],
 "mp3DirectCut": [
  "unknown",
  "unknown",
  "https://addons.nvda-project.org/files/get.php?file=mp3dc",
  "https://addons.nvda-project.org/addons/mp3DirectCut.\"lng\".html"
 ],
 "Crash Hero": [
  "unknown",
  "Note: this add-on is primarily useful for developers, or people running test versions of NVDA. Use this add-on to let NVDA prompt you for more information after a crash. ",
  "https://addons.nvda-project.org/files/get.php?file=crh-dev",
  "https://addons.nvda-project.org/addons/crashHero.\"lng\".html"
 ],
 "Tip of the Day": [
  "unknown",
  "This addon is supposed to help you learn how to use NVDA by giving you tips every day.\ninstructions:\nOnce the addon is installed, when NVDA reboots for the first time, it will ask you to select how comfortable with using NVDA you are. You should select your comfort level, for example if you are a novice with computers, select beginner.\nThen, NVDA will show you a tip of the day. You can press the forward and back buttons to change what tip you are seeing, and then press close or escape when you are done. To find these buttons, you can press tab once the dialog is up until you find the buttons, and press enter or space to press them. When you are done, either press escape from the edit field, or press the close button. To get a tip at any time, select the tip of the day option from the NVDA menu.\nTo change your comfort level with your computer so the addon can give you more targeted tips, select the tip of the day option from the NVDA preferences menu. The add-on will ask you how comfortable you are with NVDA once the add-on is installed and when NVDA reboots.",
  "https://addons.nvda-project.org/files/get.php?file=tod",
  "https://addons.nvda-project.org/addons/tipOfTheDay.\"lng\".html"
 ],
 "SpeechPlayer in Espeak": [
  "unknown",
  "SpeechPlayer in Espeak\nA hybrid of speechPlayer and eSpeak, containing the Edward voice.",
  "https://addons.nvda-project.org/files/get.php?file=spie",
  "https://addons.nvda-project.org/addons/speechPlayerInEspeak.\"lng\".html"
 ],
 "Golden Cursor": [
  "2019.3 and beyond",
  "This add-on allows you to move the mouse using a keyboard and save mouse positions for applications.\nKey commands\n• Control+NVDA+L: view saved mouse positions for an application if any.\n• Shift+NVDA+l: save a tag or a label for the current mouse position in the currently focused application.\n• Windows+NVDA+C: change mouse movement unit.\n• Windows+NVDA+R: toggle mouse restriction.\n• Windows+NVDA+S: toggle reporting of mouse position in pixels.\n• Windows+NVDA+J: move mouse to a specific x and y position.\n• Windows+NVDA+P: report mouse position.\n• Windows+NVDA+M: sswitch mouse arrows on or off.\n• Windows+NVDA+arrow keys (or just arrow keys if mouse arrows is on): move mouse.\nNote: these gestures can be reassigned via NVDA's Input Gestures dialog under Golden Cursor ",
  "https://addons.nvda-project.org/files/get.php?file=gc",
  "https://addons.nvda-project.org/addons/goldenCursor.\"lng\".html"
 ],
 "Day of the week": [
  "unknown",
  "This add-on allows you to know the day related to a particular date. It adds a submenu in the NVDA Tools menu named Day of the week, containing 2 items:\n• \nThe first one named Search a day, opens a dialog composed of 3 controls:\n• A listbox to choose or type your date;\n• An OK button to display a messageBox containing your day;\n• And the Cancel button to close the dialog.\n• \nThe second one named dayOfTheWeek add-on settings opens the parameters of the add-on to specify whether you want to report labels for date fields or not, it is composed of the following elements:\n• Enable accessibility of the date selector;\n• \nLevel of the announces of labels, you will then have 3 choices:\n• Long (it's the default choice);\n• Short (for short announcements);\n• Off (to disable labels announcements).\n• \nEnable announcement of the current date field value only, when moving vertically;\n• An OK button to save your configuration;\n• A Cancel button to cancel and close the dialog.",
  "https://addons.nvda-project.org/files/get.php?file=dw",
  "https://addons.nvda-project.org/addons/dayOfTheWeek.\"lng\".html"
 ],
 "VLC Media Player": [
  "unknown",
  "This addon provides some accessibility features for VLC Media Player.\n1. Allows navigating through the playback controls using Tab and Shift+Tab. To activate a selected control press enter.\n2. Reads status bar information (press I). The gesture can be set up in NVDA preferences.\n3. Says elapsed time when moving back and forward using VLC keystrokes: Control plus left/right arrow to skip 1 minute and Shift plus left/right arrows to skip 5 seconds. You can set the verbosity in the NVDA preferences. You can also assign a keyboard shortcut to toggle it.\n4. Announces state when change random mode (key R) and repeat mode (key L).\n5. \nThere are some layered windows and panels that NVDA is not able to focus it automatically when they are displayed. Press Control+Tab to try to bring them to the front.\n6. \nImportant note: This addon is optimized for versions of VLC 3.0 and higher; it will not work correctly with earlier versions.\n7. Covered by the GNU General Public License. See the file COPYING.txt for more details.",
  "https://addons.nvda-project.org/files/get.php?file=vlc",
  "https://addons.nvda-project.org/addons/vlc.\"lng\".html"
 ],
 "Windows App Essentials": [
  "2021.2 +",
  "Note: Originally called Windows 10 App Essentials, it was renamed to Windows App Essentials in 2021 to support Windows 10 and future releases such as Windows 11. Parts of this add-on will still refer to the original add-on name.\nThis add-on is a collection of app modules for various modern Windows apps, as well as enhancements and fixes for certain controls found in Windows 10 and later.\nThe following app modules or support modules for some apps are included (see each app section for details on what is included):\n• Calculator\n• Cortana\n• Mail\n• Maps\n• Microsoft Solitaire Collection\n• Modern keyboard (emoji panel/dictation/voice typing/hardware input suggestions/clipboard history/modern input method editors)\n• Notepad (Windows 11)\n• People\n• Settings (system settings, Windows+I)\n• Weather\n• Miscellaneous modules for controls such as Start Menu tiles\nNotes:\n• This add-on requires Windows 10 21H1 (build 19043) or later and is compatible with Windows 11.\n• Although installation is possible, this add-on does not support Windows Enterprise LTSC (Long-Term Servicing Channel) and Windows Server releases.\n• Some add-on features are or will be part of NVDA screen reader.\n• For entries not listed below, you can assume that features are part of NVDA, no longer applicable as the add-on does not support unsupported Windows releases such as old Windows 10 versions, or changes were made to Windows and apps that makes entries no longer applicable.\n• Some apps support compact overlay mode (always on top in Calculator, for example), and this mode will not work properly with portable version of NVDA.\nFor a list of changes made between each add-on releases, refer to changelogs for add-on releases document.\nGeneral\n• NVDA can announce suggestion count when performing a search in majority of cases, including when suggestion count changes as search progresses. This is now part of NVDA 2021.3.\n• In addition to UIA event handlers provided by NVDA, the following UIA events are recognized: drag complete, drop target dropped, layout invalidated. With NVDA's log level set to debug, these events will be tracked, and for UIA notification event, a debug tone will be heard if notifications come from somewhere other than the currently active app. Events built into NVDA such as name change and controller for events are tracked from an add-on called Event Tracker.\n• When opening, closing, reordering (Windows 11), or switching between virtual desktops, NVDA will announce active virtual desktop name (desktop 2, for example).\n• NVDA will no longer announce Start menu size text when changing screen resolutions or orientation.\n• When arranging Start menu tiles or Action Center quick actions with Alt+Shift+arrow keys, NVDA will announce information on dragged items or new position of the dragged item.\n• Announcements such as volume/brightness changes in File Explorer and app update notifications from Microsoft Store can be suppressed by turning off Report Notifications in NVDA's object presentation settings.\nCalculator\n• NVDA will no longer announce graphing calculator screen message twice.\n• In Windows 10, history and memory list items are properly labeled.\nCortana\n• Textual responses from Cortana are announced in most situations.\n• NVDA will be silent when talking to Cortana via voice.\nMail\n• When reviewing items in messages list, you can now use table navigation commands to review message headers. Note that navigating between rows (messages) is not supported.\nMaps\n• NVDA plays location beep for map locations.\n• When using street side view and if \"use keyboard\" option is enabled, NVDA will announce street addresses as you use arrow keys to navigate the map.\nMicrosoft Solitaire Collection\n• NVDA will announce names of cards and card decks.\nModern keyboard\nThis includes emoji panel, clipboard history, dictation/voice typing, hardware input suggestions, and modern input method editors for certain languages. When viewing emojis, for best experience, enable Unicode Consortium setting from NVDA's speech settings and set symbol level to \"some\" or higher. When pasting from clipboard history in Windows 10, press Space key instead of Enter key to paste the selected item. NVDA also supports updated input experience panel in Windows 11.\n• In Windows 10, when an emoji group (including kaomoji and symbols group) is selected, NVDA will no longer move navigator object to certain emojis.\n• Added support for updated input experience panel (combined emoji panel and clipboard history) in Windows 11.\n• In Windows 11, it is again possible to use the arrow keys to review emojis when emoji panel opens.\nNotepad\nThis refers to Windows 11 Notepad version 11 or later.\n• NVDA will announce status items such as line and column information when report status bar command (NVDA+End in desktop layout, NvDA+Shift+End in laptop layout) is performed.\n• NVDA will no longer announce entered text when pressing Enter key from the document.\nPeople\n• When searching for contacts, first suggestion will be announced, particularly if using recent app releases.\nSettings\n• Certain information such as Windows Update progress is reported automatically, including Storage sense/disk cleanup widget and errors from Windows Update.\n• Progress bar values and other information are no longer announced twice.\n• Odd control labels seen in certain Windows installations has been corrected.\n• NVDA will announce the name of the optional quality update control if present (download and install now link in Windows 10, download button in Windows 11).\n• In Windows 11, breadcrumb bar items are properly recognized.\nWeather\n• Tabs such as \"forecast\" and \"maps\" are recognized as proper tabs (patch by Derek Riemer).\n• When reading a forecast, use the left and right arrows to move between items. Use the up and down arrows to read the individual items. For example, pressing the right arrow might report \"Monday: 79 degrees, partly cloudy, ...\" pressing the down arrow will say \"Monday\" Then pressing it again will read the next item (Like the temperature). This currently works for daily and hourly forecasts.",
  "https://addons.nvda-project.org/files/get.php?file=w10",
  "https://addons.nvda-project.org/addons/wintenApps.\"lng\".html"
 ],
 "Ventrilo": [
  "unknown",
  "This add-on enhances support for Ventrilo chat client. ",
  "https://addons.nvda-project.org/files/get.php?file=vent",
  "https://addons.nvda-project.org/addons/ventrilo.\"lng\".html"
 ],
 "Easy Table Navigator": [
  "2019.3 / 2021.1",
  "This plugin adds a layer command to use arrow keys to navigate table cells.\nCurrently supported tables are:\n• Browse mode (Internet Explorer, Firefox, etc.).\n• Microsoft Word.\nCommands\n• Toggles table navigator layer on and off (unassigned).",
  "https://addons.nvda-project.org/files/get.php?file=etn",
  "https://addons.nvda-project.org/addons/easyTableNavigator.\"lng\".html"
 ],
 "Clock and calendar Add-on for NVDA": [
  "2019.3 +",
  "This add-on enables the advanced clock, alarm timer and calendar functionality for NVDA.\nYou can configure NvDA to announce time and date in formats other than what Windows provides by default. Additionally, you can obtain the current day, week number, as well as the remaining days before the end of the current year, and you can also set automatic time announcement on specified interval. There's also a stopwatch and Alarm timer features built-in to the add-on that lets you time your tasks, such as copying files, installing programs, or cooking meals.\nNotes:\n• if you install the add-on as an update, during the installation process, the wizard detects if the old configuration is compatible with the new one and offers to correct it before installing, then you'll just have to validate the OK button to confirm that.\n• On Windows 10 and later, you can use Alarms and Clock app to manage stopwatch and timers.\nمفاتيح الاختصار\n• NVDA+F12: get current time\n• NVDA+F12 pressed twice quickly: get current date\n• NVDA+F12 pressed three times quickly: reports the current day, the week number, the current year and the remaining days before the end of the year\n• NVDA+Shift+F12: enter clock layer\nUnassigned commands\nThe following commands are not assigned by default; if you wish to assign them, use Input Gestures dialog to add custom commands. To do so, open NVDA menu, Preferences, then Input Gestures. Expand Clock category, then locate unassigned commands from the list below and select \"Add\", then enter the gesture you wish to use.\n• Elapsed and remaining time before the next alarm. pressing this gesture twice quickly will cancel the next alarm.\n• Stop currently playing alarm sound.\n• Display schedule alarms dialog box.\nLayered commands\nTo use layered commands, press NVDA+Shift+F12 followed by one of the following keys:\n• S: Starts, resets or stops the stopwatch\n• R: Resets stopwatch to 0 without restarting it\n• A: gives the elapsed and remaining time before the next alarm\n• T: opens schedule alarms dialog.\n• C: Cancel the next alarm\n• Space: Speaks current stopwatch or count-down timer\n• p: If an alarm is too long, allows to stop it\n• H: List all layered commands (Help)\nConfiguration and usage\nTo configure clock functionality, open NvDA menu, Preferences, then Settings, and configure the following options from Clock panel:\n• Time and date display format: use these combo boxes to configure how NVDA will announce time and date when you press NVDA+F12 once or twice quickly, respectively.\n• Interval: choose the time announcement interval from this combo box (off, every 10 minutes, 15 minutes, 30 minutes, or every hour).\n• Time announcement (enabled if interval is not off): choose between speech and sound, sound only, or speech only.\n• Clock chime sound (enabled if interval is not off): select the clock chime sound.\n• Quiet hours (enabled if interval is not off): select this checkbox to configure quiet hours range when automatic time announcement should not occur.\n• Quiet hours time format (enabled if quiet hours is enabled): select how quiet hours options are presented (12-hour or 24-hour format).\n• Quiet hours start and end times: select hour and minute range for quiet hours from hours and minutes combo boxes.\nTo schedule alarms, open NVDA menu, Tools, then select Schedule Alarms. The dialog contents include:\n• Alarm duration in: select alarm/timer duration between hours, minutes, and seconds.\n• Duration: enter alarm duration in the unit specified above.\n• Alarm sound: select the alarm sound to be played.\n• Stop and pause buttons: stop or pause a long alarm sound.\nClick OK, and a message will inform you the curretnly selected alarm duration.",
  "https://addons.nvda-project.org/files/get.php?file=cac",
  "https://addons.nvda-project.org/addons/clock.\"lng\".html"
 ],
 "Dual Voice": [
  "unknown",
  "This add-on allows you to use two synthesizers or voices to read text in your chosen voice language. ",
  "https://sourceforge.net/projects/dualvoice/files/latest/download",
  "https://addons.nvda-project.org/addons/dualvoice.\"lng\".html"
 ],
 "Clip Contents Designer": [
  "2019.3 +",
  "This add-on is used to add text to the clipboard, which can be useful when you want to join sections of text together ready for pasting. The clipboard content can also be cleared an shown in browse mode.\nKeyboard commands\n• NVDA+windows+c: Add selected text, Unicode braille characters which represent MathML objects, or the string which has been marked with the review cursor, to the clipboard.\n• NVDA+windows+x: Clear clipboard contents.\n• Not assigned: Copies to (or cuts from) the clipboard, with the possibility of being asked for a previous confirmation.\n• Not assigned: Shows the clipboard text as HTML in browse mode, or announces if clipboard is empty or has contents which can't be presented in a browseable message, for instance if files or folders are been copied from Windows Explorer.\n• Not assigned: Shows the textual clipboard contents as plain text in browse mode, or announces if clipboard is empty or has contents which can't be presented in a browseable message, for instance if files or folders are been copied from Windows Explorer.\nClip Contents Designer settings\nThis panel is available from NVDA's menu, Preferences submenu, Settings dialog.\nIt contains the following controls:\n• Type the string to be used as a separator between contents added to the clipboard: Allows to set a separator which can be used to find the text segments once the entire added text is pasted.\n• Add text before clip data: It's also possible to choose if the added text will be appended or prepended.\n• Select the actions which require previous confirmation: You can choose, for each action available, if it should be performed inmediately or after confirmation. Available actions are: add text, clear clipboard, emulate copy and emulate cut.\n• Request confirmation before performing the selected actions when: You can select if confirmations will be requested always, just if text is contained in the clipboard, or if clipboard is not empty (for example if you've copied a file, not text).\n• Format to show the clipboard text as HTML in browse mode: If you're learning HTML markup language, you may choose Preformatted text in HTML or HTML as shown in a web browser, to have an idea of how your HTML code will be rendered by NVDA in a browser. The difference between preformatted and conventional HTML is that the first option will preserve consecutive spaces and line breaks, and the second one will compact them. For example, write some HTML tags like h1, h2, li, pre, etc., select and copy the text to clipboard, and use clipContentsDesigner add-on to show the text in a browseable message.\n• Maximum number of characters when showing clipboard text in browse mode: Please, be aware that increasing this limit may produce issues if the clipboard contains large strings of text. The default limit is 100000 characters.\nNotes:\n• Confirmations won't be requested when a message box of NVDA is still opened. In those cases, actions will be inmediately performed.\n• Emulate copy and emulate cut commands mean that, when these features are enabled, the add-on will take control of control+c and control+x. This will allow to select if a confirmation should be requested before performing the actions corresponding to these keystrokes.\nChanges for 15.0\n• The command to add text to clipboard is again presented in the input gestures dialog.\n• Fixed gestures to copy and cut with Persian keyboard, thanks to Mohammadhosein Ghezelsofla.\nChanges for 14.0\n• Compatible with NVDA 2021.1.\nChanges for 13.0\n• Fixed an issue in visual layout of the settings panel, thanks to Cyrille Bougot.\n• Improved documentation.\n• Added a Clip Contents Designer category to assign input gestures to all commands available for this add-on.\n• Fixed bugs when using emulate copy in browsers if focus mode is active.\n• You can assign different gestures to show the clipboard textual contents as raw text or formatted in HTML. The Format to show the clipboard text in the settings panel has being modified accordingly, to select the two options available for HTML format.\nChanges for 12.0\n• Fixed bugs when using emulate copy in applications like LibreOffice Writer.\nChanges for 11.0\n• Now it's possible to add text marked with the review cursor using standard commands of NVDA (NVDA+f9 and NVDA+f10). NVDA+windows+f9 is no longer used, for a better integration with the new NVDA+shift+f9 command.\n• Requires NVDA 2019.3 or later.\nChanges for 10.0\n• Fixed a bug in the dialog used to show the clipboard text, when its title contains non latin characters.\n• Fixed a bug when using the emulate cut and copy features with an Arabic keyboard layout. This has been fixed by Abdel, added as an add-on author.\nChanges for 9.0\n• Added the possibility of showing the clipboard text in browse mode.\n• Added an option to choose if confirmations will be required if clipboard is not empty, for instance, if files or folders are been copied.\n• Requires NVDA 2018.4 or later.\nChanges for 8.0\n• The add-on settings are shown in the corresponding category of the NVDA Settings dialog.\n• Requires NVDA 2018.2 or later.\n• If needed, you can download the last version compatible with NVDA 2017.3.\nChanges for 7.0\n• In the dialog to configure the Emulate copy and Emulate cut functionalities at installation, if you choose no, the commands for these features will be removed, so that you can restore the normal behavior for control+c and control+x.\nChanges for 6.0\n• Added options to choose if available actions should be performed after confirmation.\n• Added Emulate copy and Emulate cut commands, which could be assigned from the Input gestures dialog.\n• Added a dialog to configure the Emulate copy and Emulate cut functionalities at installation. This allows to add the control+c and control+x commands to copy and cut, and be asked if you want to replace the clipboard contents when pressing these keystrokes.\n• Fixed documentation for script_add (Windows+NVDA+c).\nChanges for 5.0\n• The visual presentation of the dialog has been enhanced, adhering to the appearance of the dialogs shown in NVDA.\n• Requires NVDA 2016.4 or later.\nChanges for 4.0\n• Add-on settings are managed from NVDA configuration, so that standard profiles can be used to save different separators, and it's not needed to copy the settings for importing at reinstallation.\n• Now it's possible to choose if the added text will be appended or prepended, using the Add text before clip data check box from the Clip Contents Designer settings dialog.",
  "https://addons.nvda-project.org/files/get.php?file=ccd",
  "https://addons.nvda-project.org/addons/clipContentsDesigner.\"lng\".html"
 ],
 "Enhanced Touch Gestures": [
  "2021.2 +",
  "This add-on provides additional touchscreen gestures for NVDA. It also provides a set of gestures for easier browse mode navigation.\nNote: this add-on requires NVDA 2021.2 or later running on a touchscreen computer with Windows 8.1, 10 or 11.\nCommands\nAvailable everywhere\n• 4 finger double tap: toggle input help mode.\n• Four finger flick right: toggle touch keyboard (usually enables it).\n• Four finger flick left: toggle dictation (Windows+H; Windows 10 Version 1709 or later).\nObject mode\n• 3 finger flick down: read current window.\n• 3 finger flick left: report object with focus.\n• 3 finger flick right: report current navigator object.\n• 4 finger flick up: report title of the current window.\n• 4 finger flick down: report status bar text.\nWeb touch mode\nThis touch mode, available in browse mode, allows you to navigate the document by selected element. To switch to web mode, from browse mode documents, perform 3 finger tap. From this mode, flicking up or down with one finger cycles through available element navigation modes, while flicking right or left with one finger moves to next or previous chosen element, respectively. Once you move away from browse mode documents, object touch mode is used.\nSynth settings touch mode\nYou can use this mode to quickly change synthesizer settings such as choosing a voice and changing volume. In this mode, use two finger flick left or right to move between synth settings and use two finger flick up and down gestures to change values. This gestures mirrors that of synth settings ring commands on the keyboard.\nVersion 21.10\n• NVDA 2021.2 or later is required due to changes to NVDA that affects this add-on.\nVersion 21.08\n• Initial support for Windows 11.\nVersion 21.01\n• NVDA 2020.3 or later is required.\n• On Windows 10 Version 1709 and later, doing a four finger flick left will toggle dictation (Windows+H).\n• Remove dedicated touch interaction support toggle command from the add-on.\n• As touch interaction support can be toggled from NVDA's touch interaction settings panel, a dedicated Enhanced Touch Gestures settings panel has been removed.\nVersion 20.09\n• Removed ability to let NVDA turn off touch interaction for up to ten seconds (touch command passthrough).\n• Removed coordinate announcement beep feature.\nVersion 20.07\n• Added a keyboard command to toggle touch interaction or enable/disable touch passthrough (Control+Alt+NVDA+T).\n• As NVDA 2020.1 and later includes a touch command to perform right mouse click (one finger tap and hold), the command has been removed from this add-on. AS a result, NVDA 2020.1 or later is required.\n• The ability to let NVDA turn off touch interaction for up to ten seconds (touch command passthrough) is deprecated. In the future this feature will toggle touch interaction instead.\n• In NVDA development snapshots, due to touch interaction feature changes, touch command passthrough feature and Enhanced Touch Gestures settings panel will be disabled. The command used to enable touch command passthrough will toggle touch interaction instead.\n• Coordinate announcement beep feature is deprecated and will be removed in a future add-on release.\n• Coordinate announcement beep will not be heard while using touch keyboard.\n• NVDA will no longer appear to do nothing or play error tones while exploring modern input facility such as emoji panel via touch.\n• NVDA will present an error message if touch keyboard cannot be activated (four finger flick right).\nVersion 20.06\n• Resolved many coding style issues and potential bugs with Flake8.\nVersion 20.04\n• Right mouse click gesture (one finger tap and hold) is now part of NVDA 2020.1.\nVersion 20.01\n• NVDA 2019.3 or later is required.\n• Touch support toggle command (including touch passthrough) will no longer function if touch support is turned off completely.\nVersion 19.11\n• Added input help messages for additional touch commands.\nVersion 19.09\n• Touch support can now be disabled from everywhere, not just from profiles other than normal profile.\nVersion 19.07\n• Internal changes to support future NVDA releases.\nVersion 18.12\n• Internal changes to support future NVDA releases.\nVersion 18.08\n• Compatible with NVDA 2018.3 and future versions.\nVersion 18.06\n• Add-on settings is now found in new multi-category NVDA Settings screen under \"Enhanced Touch Gestures\" category. As a result, NVDA 2018.2 is required.\n• Fixed compatibility issues with wxPython 4.\nVersion 18.04\n• Resolves an issue where touch interaction category in NVDA Settings panel may cause error sounds to be heard due to changes made from this add-on.\nVersion 18.03\n• NVDA 2018.1 is required.\n• Because NVDA 2018.1 comes with touch typing checkbox, the checkbox is no longer included in this add-on.\nVersion 17.12\n• Requires NVDA 2017.4. Specifically, this add-on can now handle configuration profile switches.\n• As NVDA 2017.4 includes screen orientation announcement, this feature is no longer part of this add-on.\n• Added a hidden checkbox in Touch Interaction dialog to completely disable touch support (available if profiles other than normal configuration is active).\n• If using NVDA 2018.1 or later, Touch Interaction dialog will be listed twice under NVDA's preferences menu. The second item is the dialog that comes with the add-on.\n• In Touch Interaction dialog for the add-on, touch typing mode is no longer shown if using NVDA 2018.1 or later.\nVersion 17.10\n• Due to support policy from Microsoft, Windows 8 (original release) is no longer supported.\n• NVDA will no longer announce screen orientation twice when running NVDA 2017.4 development snapshots.\nVersion 17.07.1\n• Added an option in touch interaction dialog to manually toggle touch passthrough without use of a timer.\n• With manual passthrough mode off, if touch passthrough is turned on before the passthrough duration expires, touch interaction would be enabled.\nVersion 17.07\n• Added a new dialog named Touch Interaction under NVDA's preferences menu to configure how NVDA works with touchscreens.\n• After installing this version, when pressing keys on the touch keyboard, one must double tap the desired key. You can switch back to the old way by enabling touch typing from Touch Interaction dialog.\n• Added a command (unassigned) to allow NVDA to ignore touch gestures for up to 10 seconds.\n• Added an option in Touch Interaction dialog to allow NVDA to pause touch interaction between 3 to 10 seconds in order to perform touchscreen gestures directly (as though NVDA is not running; default is 5 seconds).\n• Added debug logging messages when performing right clicks (tap and hold) to be recorded in the NVDA log (requires NVDA 2017.1 or later).\n• Due to changes made when playing screen coordinates, NVDA 2017.1 or later is required.\nVersion 17.03\n• Fixed an issue where coordinate announcement beep did not play or an error tone played instead when using NVDA 2017.1 or later.\nVersion 16.12\n• Web touch mode works in Microsoft Edge, Microsoft Word and others where browse mode is used.\n• Added lists and landmarks to web touch mode elements.\nVersion 16.06\n• Initial stable version.",
  "https://addons.nvda-project.org/files/get.php?file=ets",
  "https://addons.nvda-project.org/addons/enhancedTouchGestures.\"lng\".html"
 ],
 "NV Speech Player. A Klatt-based speech synthesis engine written in c++": [
  "2019.3 +",
  "NV Speech Player is a free and open-source prototype speech synthesizer that can be used by NVDA. It generates speech using Klatt synthesis, making it somewhat similar to speech synthesizers such as Dectalk and Eloquence.\nLicence and copyright\nNV Speech Player is Copyright (c) 2014 NV Speech Player contributors NV Speech Player is covered by the GNU General Public License (Version 2). You are free to share or change this software in any way you like as long as it is accompanied by the license and you make all source code available to anyone who wants it. This applies to both original and modified copies of this software, plus any derivative works. For further details, you can view the license online at: http://www.gnu.org/licenses/old-licenses/gpl-2.0.html\nBackground\nThe 70s and 80s saw much research in speech synthesis. One of the most prominent synthesis models that appeared was a formant-frequency synthesis known as Klatt synthesis. Some well-known Klatt synthesizers are Dectalk and Eloquence. They are well suited for use by the blind as they are extremely responsive, their pronunciation is smooth and predictable, and they are small in memory footprint. However, research soon moved onto other forms of synthesis such as concatinative speech, as although this was slower, it was much closer to the human voice. This was an advantage for usage in mainstream applications such as GPS units or telephone systems, but not necessarily so much of an advantage to the blind, who tend to care more about responsiveness and predictability over prettiness.\nAlthough synthesizers such as Dectalk and Eloquence continued to be maintained and available for nearly 20 years, now they are becoming harder to get, with multiple companies saying that these, and their variants, have been end-of-lifed and will not be updated anymore.\nConcatinative synthesis is now starting to show promise as a replacement as the responsiveness and smoothness is improving. However, most if not all of the acceptable quality synthesizers are commercial and are rather expensive.\nBoth Dectalk and Eloquence were closed-source commercial products themselves. However, there is a substantial amount of source code and research material on Klatt synthesis available to the community. NV Speech Player tries to take advantage of this by being a modern prototype of a Klatt synthesizer, in the hopes to either be a replacement for synthesizers like Dectalk or Eloquence, or at least restart research and conversation around this synthesis method.\nThe eSpeak synthesizer, itself a free and open-source product has proved well as a replacement to a certain number of people in the community, but many people who hear it are extremely quick to point out its \"metallic\" sound and cannot seem to continue to use it. Although the authors of NV Speech Player still prefer eSpeak as their synthesizer of choice, they would still hope to try and understand better this strange resistance to eSpeak which may have something to do with eSpeak's spectral frequency synthesis verses Klatt synthesis. It may also have to do with the fact that consonants are also gathered from recorded speech and can therefore be perceived as being injected into the speech stream.\nImplementation\nThe synthesis engine itself is written in C++ using modern idioms, but closely following the implementation of klsyn-88, found at http://linguistics.berkeley.edu/phonlab/resources/\neSpeak is used to parse text into phonemes represented in IPA, making use of existing eSpeak dictionary processing. eSpeak can be found at: http://espeak.sourceforge.net/\nThe Klatt formant data for each individual phoneme was collected mostly from a project called PyKlatt: http://code.google.com/p/pyklatt/ However it has been further tweaked based on testing and matching with eSpeak's own data.\nThe rules for phoneme lengths, gaps, speed and intonation have been coded by hand in Python, though eSpeak's own intonation data was tried to be copied as much as possible.\nBuilding NV Speech Player\nYou will need: - Python 3.7: http://www.python.org - SCons 3: http://www.scons.org/ - Visual Studio 2019 Community\nTo build: run scons\nAfter building, there will be a nvSpeechPlayer_xxx.nvda-addon file in the root directory, where xxx is the git revision or hardcoded version number. Installing this add-on into NVDA will allow you to use the Speech Player synthesizer in NVDA. Note everything you need is in the add-on, no extra dlls or files need to be copied.",
  "https://addons.nvda-project.org/files/get.php?file=nvsp",
  "https://addons.nvda-project.org/addons/nvSpeechPlayer.\"lng\".html"
 ],
 "Quick Books 2014 support": [
  "unknown",
  "This add-on makes it possible to use NVDA with the Intuit Quickbooks 2014 accounting software.\nFeatures\n• Automatic enabling of QuickBooks accessibility mode.\n• Labeling of many input fields.\n• Tracking of focus and highlighting for lists such as the Chart of Accounts.\n• Correct control type identification of custom check boxes, radio buttons and buttons.\n• Automatic reporting of messages in custom message dialogs.",
  "https://addons.nvda-project.org/files/get.php?file=qb-dev",
  "https://addons.nvda-project.org/addons/quickBooks2014.\"lng\".html"
 ],
 "TeamViewer": [
  "unknown",
  "This add-on improves accessibility of TeamViewer with NVDA.\nIt's based on TeamViewerNVDASupport add-on, developed by the same author. You should uninstall that old add-on to use this one, since both have common keystrokes and features.\nTested on TeamViewer 9, trial version.\nKey Commands:\n• nvda+shift+C: Copies the ID and current password to the clipboard, so that they can be pasted and sent via chat for example when remote control is required.\n• control+tab and control+shift+tab: Switch to other tab in the TeamViewer main dialog.\nChanges for 2.0\n• Add-on help is available from the Add-ons Manager.",
  "https://addons.nvda-project.org/files/get.php?file=tv",
  "https://addons.nvda-project.org/addons/teamViewer.\"lng\".html"
 ],
 "Bit Che": [
  "unknown",
  "Bit Che is a simple tool that quickly searches popular bit torrent sites for files. You can get more information about this program at this page.\nThis NVDA addon improves the accessibility of the software. It adds the following features:\n• Makes the search results list accessible.\n• Enables you to use the Application key to activate the context menu on the focused result.\nNotes\n• You can use the up and down arrow keys to focus the search result which should be interacted with.\n• When the first search performed after starting Bit Che is finished, the first result will be focused, though it may not be selected properly. NVDA will speak the selected result. Use the usual commands or the arrow keys to ensure the right item is selected before performing other actions.\nKey Commands\n• Application key, or shift+f10, open context menu for search result item.",
  "https://addons.nvda-project.org/files/get.php?file=bc",
  "https://addons.nvda-project.org/addons/bitChe.\"lng\".html"
 ],
 "Read Feeds": [
  "2019.3 +",
  "This addon provides a straightforward way to read feeds in Atom or RSS formats using NVDA. The feeds will not be refreshed automatically. Below when we mention feeds, we mean both RSS and ATOM feeds.\nInstallation or Update\nIf you used a previous version of this addon, and there is an RSS or personalFeeds folder in your personal NVDA configuration folder, when installing the current version, a dialog will ask if you want to upgrade or install. Choose update to preserve your saved feeds and to continue using them in the new installed version of readFeeds.\nCommands\nRead Feeds menu\nYou can access the Read Feeds submenu from the nvda menu, Tools submenu, where the following menu options are available:\nFeeds\nOpens a dialog with the following controls:\n• Filter by: An edit box to search previously saved feeds.\n• A list of the saved feeds, focused when the dialog is opened.\n• List of articles: Opens a dialog which presents the articles list from your current feed. Select the article you want to read and press Enter or Open web page of selected article button to open the corresponding page in your browser. Press About article button to open a dialog showing title and link of the selected article; from this dialog, you'll be able to copy this info to the clipboard.\n• Open feed: Opens the selected feed in the default application.\n• Open feed as HTML: Opens the selected feed in the default web browser. You will be able to show or hide publication dates and buttons to copy information about articles to clipboard.\n• Copy feed address: Opens a dialog to confirm if you want to copy the feed address to clipboard.\n• New: Opens a dialog with an edit box to enter the address of a new feed. If the address is valid and the feed can be saved, its name, based on the feed title, will appear at the bottom of the feeds list.\n• Rename: Opens a dialog with an edit box to rename the selected feed.\n• Delete: Opens a dialog to delete the selected feed after confirmation.\n• Set default: Sets the selected feed as the default, so that its articles can be accessed with NVDA's gestures.\n• Open folder containing a backup of feeds: Opens a folder which may contain a backup of feeds. This can be useful to explore and delete feeds which shouldn't be imported when the add-on is updated.\n• Preferences: Opens the settings dialog for readFeeds, also available in NVDA's menu, Preferences, settings, readFeeds category.\n• Close: Closes the Feeds dialog.\nNotes\n• If a feed named tempFeed is created, please rename it, as this file could be replaced when needed to create a feed whose name already exists.\n• The feed set as the default can't be removed. The addressFile feed will be use as the default when the configuration is reset, so it can't be deleted.\n• The Filter by edit box can be placed after the Open article button from NVDA's menu, Preferences, Settings, Read feeds category, or pressing the Preferences button of the Feeds dialog.\nCopy feeds folder\nOpens a dialog to choose a folder where you can save the personalFeeds directory of your feeds. By default the selected folder is the NVDA's configuration directory, which will create the personalFeeds directory.\nRestore feeds\nOpens a dialog to select a folder which replaces your feeds in the personalFeeds folder. Make sure you load a folder containing feeds URLs.\nKeyboard commands\n• Ctrl+Shift+NVDA+Space: Announces current article's URL. Pressing twice will open the web page.\n• Ctrl+Shift+NVDA+8: Refreshes the selected feed and announces its most recent title.\n• Ctrl+Shift+NVDA+I: Announces current feed title and link. Pressing twice will copy the title and related link to clipboard.\n• Ctrl+Shift+NVDA+U: Announces previous feed title.\n• Ctrl+Shift+NVDA+O: Announces next feed title.\nNotifications\n• When the title or URL have been copied.\n• When unable to connect/refresh a feed, or the URL does not correspond to a valid feed.\n• NVDA will display an error message if it was not possible to backup or restore the personalFeeds folder, and if a new feed cannot be created.\n• The title of the articles list dialog displays the selected feed name and number of items available.",
  "https://addons.nvda-project.org/files/get.php?file=rf",
  "https://addons.nvda-project.org/addons/readFeeds.\"lng\".html"
 ],
 "GoldWave": [
  "2021.2 +",
  "This app module enhances access and usage of GoldWave audio editor.\nShortcuts\n• NVDA+Shift+C: Toggles speaking of commands during audio editing.\n• Control+Shift+P: Announces current track position.\n• NVDA+Shift+R: Announces remaining time for the currently editing track.\n• Control+NVDA+1: Announces the channel you are editing.\n• Control+NVDA+2: Announces the total length of the audio file.\n• Control+NVDA+3: announces a summary on audio selection information.\n• Control+NVDA+4: Announces the zoom level.",
  "https://addons.nvda-project.org/files/get.php?file=gwv",
  "https://addons.nvda-project.org/addons/goldwave.\"lng\".html"
 ],
 "Emoticons": [
  "2019.3 +",
  "Using this add-on, spoken text containing emoticon characters will be replaced by its more human friendly description.\nFor example: the sequence \":)\" will be spoken as \"smiling smiley\", or for example NVDA will recognize the meaning of each emoji.\nYou can take advantage of the following features:\nInsert Emoticon\nSometimes an image is worth a 1000 words: use the new emoji to liven up your instant message and to let your friends know how you’re feeling.\nWhen you are unsure of the characters for a particular smiley, this addon enables you to select and insert it into your text such as in a chat.\nPress NVDA+I, or from menu Tools -> Emoticons > Insert emoticon, to open a dialog with the provided emoticons or emoji.\nThis dialog allows you to choose an emoticon and to view the emoticons that interest you:\n• An editable field allows you to filter the search for the desired emoticon among the emoticons available.\n• Through a set of radio buttons, you can choose to view only emoji category (alt+E) or view only standard emoticon category (alt+s) or view all emoticons available (alt+A).\n• In the list of emoticons (alt+L) are displayed on three columns respectively: the name of emoticon, the type of emoticon (standard emoticon or emoji), the corresponding character.\nWhen you press OK, the characters for the chosen emoticon will be copied to your clipboard, ready for pasting.\nInsert symbol\nThis dialog allows you to choose one of the symbols available in the Punctuation/symbol pronunciation dialog of NVDA. You can use the Filter edit box or the arrow keys to select an item from the symbols list. Then, press OK and the selected emoji or symbol will be copied to your clipboard, ready for pasting.\nEmoticons dictionary\nEmoticons add-on allows to have differents speech-dictionaries using configuration profiles.\nThis means that you can create or edit a specific speech-dictionary for each your custom profile.\nFrom NVDA MENU, Preferences -> Speech dictionaries -> Emoticons dictionary, you can open a dialog to add or to edit available emoticons.\nSaving your customizations, the new reading settings of emoticons will only apply to the profile you are currently editing.\nFor example, you may wish that NVDA spoken custom emoticons only in XxChat program, but not in other chat programs: you can do this by creating a profile for the XxChat application and assign to it a speech dictionary from Speech dictionaries menu, Emoticons dictionary option. See below for Emoticons settings in relation to the configuration profiles.\nYou can also export each custom speech-dictionary pressing \"Save and export dictionary\" button: in this way your speech-dictionaries will be saved in your user config folder, speechDicts/emoticons subfolder.\nThe exact name and location of the dictionary file will be based on the editing configuration profile, which will be shown in the title of the Emoticons dictionary dialog.\nEmoticons settings\nFrom menu Preferences -> Settings -> Emoticons opens a panel to configure the activation of your speech-dictionaries for each profile.\nIn Emoticons settings panel you can choose whether or not speech-dictionary should automatically activate when NVDA switches to the profile you are currently editing. By default it is disabled in normal configuration of NVDA and in all your new profiles.\nMoreover, it's possible to determine if the add-on emojis should be spoken. This could be useful to preserve symbols speaking if emojis are included in NVDA's configuration.\nIf you may wish to keep clean your configuration folders, in this dialog it is also possible to choose if dictionaries not used (associated with non existing profiles) will be removed from the add-on when it is unloaded.\nKey Commands:\nThese are the key commands available by default, you can edit those or add new key to open Emoticons settings panel or Emoticon Dictionary dialog:\n• NVDA+E: speaking emoticons on/off, toggles between speaking text as it is written, or with the emoticons replaced by the human description.\n• NVDA+I: show a dialog to select an emoticon you want to copy.\n• Not assigned: show a dialog to select an NVDA's symbol you want to copy.\n• Not assigned: open a browseable message showing the symbol where the review cursor is positioned, so that the whole description can be reviewed in browse mode.\n• Not assigned: open a browseable message showing the symbol where the caret is positioned, so that the whole description can be reviewed in browse mode.\nNote: On Windows 10, it's also possible to use the built-in emoji panel.",
  "https://addons.nvda-project.org/files/get.php?file=emo",
  "https://addons.nvda-project.org/addons/emoticons.\"lng\".html"
 ],
 "eMule": [
  "2019.3 +",
  "This add-on helps to improve accessibility of eMule with nVDA. It also provides additional keyboard commands for moving in different windows and gives Useful information about eMule.\nIt's based on the eMuleNVDASupport add-on, developed by the same author. You should uninstall that old add-on to use this one, since both have common keystrokes and features.\nTested on eMule 0.50a.\nKey Commands:\n• control+shift+h: Moves focus and mouse to main toolbar.\n• control+shift+t: Reads the current window.\n• control+shift+n: Moves the focus to the Name field in the Find window.\n• control+shift+p: In the Search window, moves focus and mouse to the list of search parameters, or edit field options.\n• control+shift+b: Move the focus to the list in the current window. For example usable in the Search window, downloads in Transfer window, etc.\n• control+shift+o: Move the focus to read-only edit boxes in the current window. For example the IRC received messages, available Servers, etc.\n• control+NVDA+f: If the caret is located in a read only edit box, opens a find dialog to use the commands for searching text available in NVDA.\n• control+shift+l: Moves the navigator object and mouse to the headers of the current list.\n• control+shift+q: Reads the first object in the status bar; provides information about recent activity.\n• control+shift+w: Reads the second object of the status bar; contains information about files and users on the current server.\n• control+shift+e: Reads the third object of the status bar; useful to know the UpLoad/DownLoad speed.\n• control+shift+r: Reads The fourth object of the status bar; reports on connecting of eD2K and Kad network.\nManaging columns.\nWhen within a list, you can move the caret between the rows and columns using alt+control+ Arrows. In this Add-on the following key commands are also available:\n• nvda+control+1-0: Reads the first 10 columns.\n• nvda+shift+1-0: Reads columns 11 to 20.\n• nvda+shift+C: Copies the contents of the last read column to the clipboard.",
  "https://addons.nvda-project.org/files/get.php?file=em",
  "https://addons.nvda-project.org/addons/eMule.\"lng\".html"
 ],
 "Focus Highlight": [
  "unknown",
  "By drawing a colored rectangle, this addon enables partially sighted users, sighted educators, or developers to track the location of the nvda navigator object and the focused object/control.\nThe following colors are used by this addon:\n• Green thin dashed-dotted line rectangle shows NVDA is in browse mode, and this is the navigator object.\n• Red thin rectangle shows NVDA is in browse mode, and this is the focused object/control.\n• Red thick rectangle shows NVDA is in browse mode, and this is both the navigator object and the focused object which are overlapping.\n• Blue thick dotted line rectangle indicates NVDA is in focus mode, i.e., key types are passed to the control.\nTo toggle object tracking, press NVDA+Alt+P. You can assign other gestures using the Input Gestures dialog. Note that it works with NVDA 2018.3 or later. Otherwise, you should disable or uninstall the addon itself for disabling object tracking.\nWhen Focus Highlight category of NVDA Settings dialog is available, following items can be used.\n• Make focus mode the default: This checkbox is enabled by default. When it is unchecked, this add-on behaves same as version 5.6 or previous versions, i.e., if browse mode is not available for an app, the focus is shown using the thick red rectangle.\n• \nFocus in focus mode, Focus in browse mode, Navigator object: Each of these groups contains Color, Thickness, and Style.\n• Color: This edit field allows you to type the HTML color code, i.e., six-character hexadecimal number. For example, \"ffffff\" is white, \"ff0000\" is red, and so on. Note that \"000000\" can not be used.\n• Thickness: This edit field allows you to type the thickness of the box. You can enter a value between 1 and 30.\n• Style: The choices are Solid, Dash, Dot, Dash dot, and Dash dot-dot.\n• \nRestore defaults: This button allows you to reset your settings to their original defaults.",
  "https://addons.nvda-project.org/files/get.php?file=fh",
  "https://addons.nvda-project.org/addons/focusHighlight.\"lng\".html"
 ],
 "NoBeepsSpeechMode": [
  "unknown",
  "This add-on excludes beeps in the speech mode when pressing NVDA+s. You can only toggle between off or talk.",
  "https://addons.nvda-project.org/files/get.php?file=nb",
  "https://addons.nvda-project.org/addons/noBeepsSpeechMode.\"lng\".html"
 ],
 "Virtual Review": [
  "2019.3 and beyond",
  "This Addon allows NVDA users to review a Window content in a text box, similar to window virtualization of JAWS for Windows. Note, however, that this is just a convenience for users and does not replace NVDA's excellent review modes and object navigation support.\nUsage\nPress NVDA+control+w to open the virtual revision Window. Then simply navigate the shown textbox as you do in any other text content. You can press Escape to close the virtual revision window.",
  "https://addons.nvda-project.org/files/get.php?file=VR",
  "https://addons.nvda-project.org/addons/virtualRevision.\"lng\".html"
 ],
 "placeMarkers": [
  "2021.1 +",
  "This addon is used for saving and searching specific text strings or bookmarks. It can be used  on web pages or documents in NVDA's browse mode. It can also be used for saving or searching strings of text in multi-line controls; in this case, if it's not possible to update the caret, the corresponding string will be copied to the clipboard, so that it can be searched using other tools. The plugin saves the specified strings and bookmarks to files whose name is based on the title and URL of the current document. This addon is based on SpecificSearch and Bookmark&Search, developed by the same author. You should uninstall them to use this one, since they have common keystrokes and features.\nKey Commands:\n• control+shift+NVDA+f: Opens a dialog with an edit box that shows the last saved search; in this dialog you can also select the previously saved searches from a combo box or remove the selected string from the history using a checkbox. You can choose if the text contained in the edit box will be added to the history of your saved texts. Finally, choose an action from the next group of radio buttons (between Search next, Search previous or Don't search), and specify if NVDA will make a case sensitive search. When you press okay, NVDA will search for this string.\n• control+shift+NVDA+k: Saves the current position as a bookmark. If you want to provide a name for this bookmark, select some text from this position before saving it.\n• control+shift+NVDA+delete: Deletes the bookmark corresponding to this position.\n• NVDA+k: Moves to the next bookmark.\n• shift+NVDA+k: Moves to the previous bookmark.\n• Not assigned: Shows the file name where the place markers data will be saved in browse mode, without an extension.\n• alt+NVDA+k: Opens a dialog with the bookmarks saved for this document. You can write a note for each bookmark; press Save note to save changes. Pressing Delete you can remove the selected bookmark. Pressing OK you can move to the selected position.\n• Not assigned: Saves a position as a temporary bookmark.\n• Not assigned: Moves to the temporary bookmark for the current document.\n• Not assigned: Finds the next occurrence of the last text searched for any specific document.\n• Not assigned: Finds the previous occurrence of the last text searched for any specific document.\nPlace markers Submenu (NVDA+N)\nUsing the Place markers submenu under NVDA's Preferences menu, you can access:\n• Specific search folder: opens a folder of specific searches previously saved.\n• Bookmarks folder: Opens a folder of the saved bookmarks.\n• Copy placeMarkers folder: You can save a copy of the bookmarks folder.\n• Restore placeMarkers: You can restore your bookmarks from a previously saved placeMarkers folder.\nNote: The bookmark position is based on the number of characters; and therefore in dynamic pages it is better to use the specific search, not bookmarks.",
  "https://addons.nvda-project.org/files/get.php?file=pm",
  "https://addons.nvda-project.org/addons/placeMarkers.\"lng\".html"
 ],
 "control Usage Assistant": [
  "2021.2 +",
  "Use this add-on to find out how to interact with the focused control. Press NVDA+H to obtain a short help message on interacting with the focused control, such as checkboxes, edit fields and so on.",
  "https://addons.nvda-project.org/files/get.php?file=cua",
  "https://addons.nvda-project.org/addons/controlUsageAssistant.\"lng\".html"
 ],
 "Resource Monitor": [
  "2021.2 +",
  "This add-on gives information about CPU load, memory usage and other resource usage information.\nShortcuts\n• NVDA+Shift+E: presents used ram, average processor load, and battery info if available.\n• NVDA+Shift+1: presents the average processor load and if multicore CPU's are present the load of each core.\n• NVDA+Shift+2/5: presents the used and total space for both physical and virtual ram.\n• NVDA+Shift+3: presents the used and total space of the static and removable drives.\n• NVDA+Shift+4: presents battery percentage, charging status, remaining time (if not charging), and a warning if the battery is low or critical.\n• NVDA+Shift+6: presents CPU Architecture 32/64-bit and Windows version and service pack numbers.\n• NVDA+Shift+7: presents the system's uptime.\nIf you have NVDA 2013.3 or later installed, you can change these shortcut keys via input gestures dialog.\nUsage notes\nThis add-on does not replace task manager and other system information programs for Windows. Also note the following:\n• CPU usage is given for logical processors, not physical cores. This is noticeable for processors which uses Hyper-Threading where number of CPU's is twice the number of CPU cores.\n• If there is heavy disk activity such as copying large files, there might be delays when obtaining disk usage information.\n• This add-on requires Windows 7 Service Pack 1 or later.\nNote on license: this add-on uses Psutil, licensed under 3-Clause BSD License which is compatible with GNU General Public License.",
  "https://addons.nvda-project.org/files/get.php?file=rm",
  "https://addons.nvda-project.org/addons/resourceMonitor.\"lng\".html"
 ],
 "UnicodeBrailleInput": [
  "unknown",
  "This add-on allows you to convert text from braille (E.G. 1345-1236-145-1) to Unicode braille characters. You can also convert text according to the currently selected input braille table.\nThe purpose of this specialized addon is to make it easier to help to improve liblouis tables and to add automatic tests for your language. With the addition of unicode braille table in NVDA 2017.3, this add-on is no longer required for this, as users can choose to input braille with the new table. However, this add-on can still aid in converting normal text to unicode braille according to a particular input table.\nUsage\n• Open a unicode aware text editor (for example Notepad++).\n• Press NVDA+Ctrl+U or choose Unicode Braille Input found under NVDA tools menu.\n• Select whether your input consists of braille dots (e.g. 1345-1236-145-1) or normal text according to the current braille table (e.g. Dutch (Netherlands).\n• Type your braille text in numeric form or your normal text, respectively.\n• Press OK.\n• The required unicode characters will be copied to your clipboard ready for you to paste.",
  "https://addons.nvda-project.org/files/get.php?file=ubi",
  "https://addons.nvda-project.org/addons/unicodeBrailleInput.\"lng\".html"
 ],
 "instantTranslate": [
  "unknown",
  "This add-on is used to translate selected and/or clipboard text from one language to another. This is done using the Google Translate service.\nConfiguring languages\nTo configure source, target and in case swap language, go to: NVDA Menu >> Preferences >> Instant Translate Settings.\nThere are two comboboxes labeled \"Source language\" and \"Target language\", and a checkbox to decide if it must copy the translation to clipboard.\nIn addition, if you selected auto option (the first choice) from \"Source language\" combobox, there are also a combobox labeled \"Language for swapping\" and a checkbox about the auto-swap.\nThe meaning of two first comboboxes and checkbox for copy is clear, but some words about the rest are necessary. Remember always that the explanations below assume the source language set on the auto option.\nThe \"Language for swapping\" combobox is useful when you swap via script (see below) the source and target language; in fact, a target language set on the auto option has no sense, so the addon sets it to value of combobox above.\nSo, imagine this situation: you usually translate into English (your main language), but sometimes (for example, when you write a document) you need to translate into Italian (your second language, suppose); you can set \"Language for swapping\" combobox to Italian, so you will translate from English to Italian without accessing directly to the addon settings. Obviously this function has a major or minor utility according to your more frequent needs.\nNow, the auto-swap checkbox: it appears if and only if you set the auto option in \"Source language\" combobox, and is directly connected with \"Language for swapping\" combobox. If you activate it, then the addon tries to commute automatically from your source and target configuration to a configuration where target becomes the source language, and language selected in \"Language for swapping\" combobox is the new target language; extremely useful if the source language of the text you want translate is the target language.\nA simple example: take again in mind the situation imagined previously; if you translate a text in a language different from English, there is no problem, you get the correct translation in English. But if you need to translate a text from English, normally you get a translation into English identical to original text, and this is a bit useless. Thanks to auto-swap function, however, assuming that you want to know how your text sounds into Italian, the addon commutes automatically the target language to Italian, so it returns a valid translation.\nAnyway, this is a temporary configuration; if this option has no effect (it's experimental), try to commute manually to a stable configuration, using the gesture for swapping described below. It's experimental because in some situations (with short texts, typically), Google does not recognize the real source language correctly, and you have to swap languages manually via script, so to force the source language to be the previous target language (English in our example).\nAt least, in the speech settings parameters dialog (NVDA Menu >> Preferences >> Speech), you may want to check the \"Automatic language switching (when supported)\" option. This way, if you are using a multi-lingual synthesizer, the translation will be announced using the target language voice of the synthesizer.\nUsing\nYou can use this add-on in three ways:\n1. Select some text using selection commands (shift with arrow keys, for example) and press associated key to translate. translation result will be read with synthesizer which you are using.\n2. You can also translate text from the Clipboard.\n3. Press the dedicated shortcut key to translate the last spoken text.\nShortcuts\nAll following commands must be pressed after modifier key \"NVDA+Shift+t\":\n• T: Translate selected text,\n• Shift+t: translate text from the Clipboard,\n• S: swap source and target languages,\n• A: announce current configuration,\n• C: copy last result to clipboard,\n• I: identify the language of selected text,\n• L: translate the last spoken text,\n• O: open translation settings dialog\n• H: announces all available layered commands.",
  "https://addons.nvda-project.org/files/get.php?file=it",
  "https://addons.nvda-project.org/addons/instantTranslate.\"lng\".html"
 ],
 "dropbox": [
  "2019.1 +",
  "This plugin add a shortcut to announce Dropbox status or open the Dropbox systray menu when pressed once or twice respectively. It also enhances DropBox item lists.\n• Shortcut: NVDA+Alt+D\nChanges for 4.6\n• Specify NVDA 2021.1 compatibility\nChanges for 4.4\n• Python 3 compatibility\n• Use the last addon template\n• Repository change to be built with Appveyor\n• Fixed wrong and removed unused shortcuts in the documentation\n• Update the description in the documentation which still referenced the announcement of the version\nChanges for 4.0\n• Add-on help is available from the Add-ons Manager.\n• The shortcut to get Dropbox status has been changed to Alt+NVDA+D to avoid conflict with audio ducking support.\nChanges for 3.1\n• Use another way to get cancel button and page tab. Now we don't have to focus them before using shortcuts.\n• When changing the active tab, the focus move to the tab page so when pressing tab, the first item of the tab is activated instead of staying to the previous used tab even if it is not activated anymore.\n• In the preferences dialog, it is now possible to press control+page up/down to switch between tabs. Control+tab and control+shift+tab still work.\n• All localized manifest files should now be OK.\n• Minor corrections.",
  "https://addons.nvda-project.org/files/get.php?file=dx",
  "https://addons.nvda-project.org/addons/dropbox.\"lng\".html"
 ],
 "Say Product Name and Version": [
  "2017.3 +",
  "This NVDA add-on add a shortcut to announce product name and version of the foreground application, or copy these informations to the clipboard.\n• Shortcut: NVDA+Shift+V\n• Press it twice to copy product name and version to the clipboard.",
  "https://addons.nvda-project.org/files/get.php?file=spnav",
  "https://addons.nvda-project.org/addons/sayProductNameAndVersion.\"lng\".html"
 ],
 "Speech History": [
  "unknown",
  "An updated version of the Clip Copy add-on, initially created by Tyler Spivey.  The add-on allows you to review the most recent 100 items spoken by NVDA, as well as copy the selected item to the clipboard.  By default, use Shift+F11 to move back through the history, Shift+F12 to move forwards and F12 on its own to copy the selected item.  These hotkeys can be updated from within the Speech category of NVDA's Input gestures dialog.",
  "https://addons.nvda-project.org/files/get.php?file=sps",
  "https://addons.nvda-project.org/addons/speech_history.\"lng\".html"
 ],
 "Classic Selection": [
  "unknown",
  "This addon reverts the behaviour of NVDA+f9 and NVDA+f10 that was introduced in NVDA 2016.3.\nThe old behaviour copies the selection to the clipboard on the first press of NVDA+f10, while the new one selects on the first press and copies on the second. The new behaviour has some disadvantages. Text can't be copied without being selected (and thus moving the cursor), where that's available. For places it's not (example the console), it adds an extra press of NVDA+f10.\nThe addon adds two new gestures under the Classic Selection category to start and end selection, which are bound to NVDA+f9 and NVDA+f10 by default.",
  "https://addons.nvda-project.org/files/get.php?file=clsel",
  "https://addons.nvda-project.org/addons/classicSelection.\"lng\".html"
 ],
 "Switch synth": [
  "unknown",
  "This addon allows easy switching of synthesizers via hotkeys. It is an improved version of my earlier switch_synth addon with an underscore, which must be uninstalled. Any preexisting synthesizer configurations will continue to work with this version.\nThere are 6 synthesizer slots, 1 through 6. By default, they are empty. Slots can be switched by pressing control+shift+NVDA+1 through control+shift+NVDA+6. Once a slot is switched to, its synthesizer and settings will be loaded if they exist. To save the current synthesizer and its settings to the currently active slot, press control+shift+NVDA+v.",
  "https://addons.nvda-project.org/files/get.php?file=sws",
  "https://addons.nvda-project.org/addons/switchSynth.\"lng\".html"
 ],
 "NVDA Remote Support": [
  "2019 +",
  "unknown",
  "https://nvdaremote.com/remote-2.4.nvda-addon",
  "https://addons.nvda-project.org/addons/nvdaremote.\"lng\".html"
 ],
 "TeamTalk Classic": [
  "unknown",
  "This add-on improves usage of TeamTalk with NVDA. ",
  "https://www.dlee.org/teamtalk/NVDA/TeamTalk%20Classic.nvda-addon",
  "https://addons.nvda-project.org/addons/teamtalk.\"lng\".html"
 ],
 "Newfon": [
  "unknown",
  "Newfon is a synthesizer by Sergey Shishmintzev which supports the Russian and Ukrainian languages.",
  "https://www.nvaccess.org/files/nvda-addons/newfon.nvda-addon",
  "https://addons.nvda-project.org/addons/newfon.\"lng\".html"
 ],
 "OCR": [
  "2019.3 and beyond",
  "Important: if you are using NVDA 2017.3 or later on Windows 10, please consider using built-in Windows 10 OCR.\nPerforms optical character recognition (OCR) to extract text from an object which is inaccessible. The Tesseract OCR engine is used. To perform OCR, move to the object in question using object navigation and press NVDA+r. You can set the OCR recognition language by going to the NVDA settings panel and selecting OCR settings. The keyboard shortcut can be reassigned from NVDA input gestures dialog in the \"Miscellaneous\" category.\nChange log:\nChanges for 2.1:\n• When recognition is performed on an edit field it is now possible to navigate it with the system caret without moving focus from it and back again.\n• Tesseract release info is no longer written to the focused console.\n• When no text is recognized this fact is announced to the user.\n• It is no longer possible to attempt recognition on an invisible object.\n• WX is now used to capture images instead of Pillow.\nChanges for 2.0:\n• Compatibility with NVDA 2019.3 and later.\n• It is possible to set different recognition languages for different configuration profiles.\n• OCR settings can now be changed from NVDA settings dialog rather than from a separate dialog in the tools menu.",
  "https://addons.nvda-project.org/files/get.php?file=ocr",
  "https://addons.nvda-project.org/addons/ocr.\"lng\".html"
 ],
 "Extended Winamp": [
  "2020.1 and beyond",
  "This add-on extends the original Winamp app module found in NVDA with some extra functionality.\n• S: toggle shuffle on/off\n• R: toggle repeat on/off\n• F5: mute playback\n• F6: set playback volume to 25%\n• F7: set playback volume to 50%\n• F8: set playback volume to 100%\n• Shift+Left arrow: pan Left\n• Shift+Right arrow: pan Right\n• Shift+Up arrow: pan Center\n• Control+Shift+T: speaks total Track Length\n• Control+Shift+E: speaks track Elapsed Time\n• Control+Shift+R: speaks track Remaining Time\n• Shift+R: Review the end of track \"last 6 seconds by default\"\n• Control+R: Set the review time \"in seconds\" for use with Review End of Track command\n• Shift+J: Set alternate jump time \"in seconds\"\n• Control+Right arrow: alternate Jump Forward \"6 seconds by default\"\n• Control+Left arrow: alternate Jump Backward \"6 seconds by default\"\nChanges for 2.0\n• Resolved many coding style issues and potential bugs with Flake8.\n• Made compatible with NVDA 2021.1.\nChanges for 1.2\n• Updated Addon to work on NVDA 2019.3 and above.\n• New languages: Croatian, Polish, Simplified Chinese.\nChanges for 1.1\n• New languages: Aragonese, Arabic, Dutch, German, Finnish, French, Galician, Hungarian, Italian, Japanese, Korean, Nepali, Portuguese (Brazil), Russian, Slovak, Slovenian, Spanish, Tamil, Turkish.\nChanges for 1.0\n• Initial Release",
  "https://addons.nvda-project.org/files/get.php?file=ew",
  "https://addons.nvda-project.org/addons/extendedWinamp.\"lng\".html"
 ],
 "systrayList": [
  "2019.3 and beyond",
  "This add-on allows you to read and activate icons on the system tray or the task bar, within a list box, for easy access and interaction to those items. With the add-on installed, press NVDA+f11 once for this dialog to pop-up with system tray elements, and press twice to display task bar elements, which are the currently running applications.\nNote that you can access the windows system tray in any screen reader software using the Windows+B, and the task bar by pressing Windows+T. This plugin is only useful to make the transition from JAWS for Windows smoother and to avoid some tooltips that may pop-up when cycling through the system tray with the windows keyboard means.\nChanges for 4.0 2020-01-03\n• Requires NVDA 2019.3 or later.\n• No more support for Windows versions earlier than Windows 7 Service Pack 1.\n• Add-on has been renamed to \"SysTrayList\".\n• Donation request dialog will no longer appear when installing or updating the add-on.\nChanges for 3.2 2018-12-24\n• More code changes to support Python 3.\nChanges for 3.1 2018-11-24\n• Internal changes to support future NVDA releases.\nChanges for 3.0 2018-10-25\nSupport for Windows releases earlier than Windows 7 Service Pack 1 will end in 2019.\n• Add-on is Python 3 compatible.\nChanges for 2.0 2017-05-20\n• Systray/taskbar dialog is now centered on screen.\n• Fixed various user interface issues.\n• New and updated translations.\nChanges for 1.5 2015-mm-dd\n• Corrected left/right click action.\n• Add-on help is now available from add-ons manger.\n• Translation updates.\nChanges for 1.4 - 2013-01-19\n• Requires NVDA 2012.3beta2 or greater.\n• Add donation request to installation procedure\n• Implemented taskbar support\n• New translations: Arabic, Bulgarian, Dutch, Finnish, Galician, Greek, Hungarian, Italian, Japanese, Korean, Nepali, Norwegian, Polish, Brazilian Portuguese, Russian, Slovak, Tamil, Traditional Chinese Hong Kong.\nChanges for 1.3 - 2012-05-25\n• Converted to an add-on package\n• French and Turkish Translations.\nChanges for 1.2 - 2012-04.25\n• Spanish and German translations. Thanks to all that contributed.\nChanges for 1.1 - 2012-03-20\n• Corrected a bug that was making it impossible to use the plugin when a gettext translation is not available\nChanges for 1.0 - 2012-03-19\n• Initial Release",
  "https://addons.nvda-project.org/files/get.php?file=st",
  "https://addons.nvda-project.org/addons/systrayList.\"lng\".html"
 ]
}