{
    "version": 0.4,
    "url": "http://blindgamers.net/easytoolkit/easy_toolkit0.4.exe",
    "discription": "تحديث جديد يحمل معه بعض التعديلات وحلًا لِبعض المشاكل.\tA new update brings with it some modifications and a solution to some problems.",
    "changes": "ملاحظة, قمت في هذا الإصدار بإزالة محول mp3 to mp4, نظرًا لِكثرة المشاكل فيه, فسأُعيدها إلى البرنامج في حال وجدت الحلول المناسبة للمشاكل.\n* حل مشكلة تثبيت البرنامج على القرص c:, الآن أصبح بإمكانكم تثبيته بدون أن تواجهكم مشاكل.\n*تم إضافة أداة جديدة, يمكنكم من خلالها تنزيل إضافات nvda, يمكنكم الوصول لها بالضغط على nvda+shift+n, أو مِن قائمة أدوات, اختيار أداة تحميل إضافات nvda\tctrl+shift+n\nبعد الدخول على الأداة, ستظهر لنا قائمة تحتوي على الإضافات مِن موقع nvda\nhttps://addons.nvda-project.org\nملاحظة, فقط الإضافات التي تدعم روابط مباشرة في التحميل متوفرة بالبرنامج.\nأما عن التفاصيل التي تخص إستخدام هذه الأداة.\nلتحميل إضافة يكفي الضغط عليها بمفتاح الإدخال enter, وسيبدأ بالتحميل, ويخبرك بنسبة التنزيل عن طريق شريط التقدم الموجود بالنافذة.\nأما عن مسار التنزيل, فهو الإفتراضي يكون بالمستندات, ويمكنكم تغيير المسار عن طريق الإعدادات/إعدادات أداة تنزيل إضافات nvda.\nبعد الوقوف على الإضافة يمكنكم الضغط على f1, لمعرفة معلومات عن الإضافة, الإصدار المطلوب مِن nvda لتشغيل الإضافة, وكذالك الوصف الخاص بالإضافة.\nملاحظة, قد يكون رقم الإصدار المطلوب مِن nvda, غير دقيق في المستقبل, وذالك لأن الوصف والإصدار بيانات مخزنة, أي تغييرها يتم بشكل يدويًا, أما إصدار الإضافة فهو محدث دائمًا, أي دائمًا يقم بتنزيل آخِر إصدار متوفر مِنها.\nهنالك بعض الخيارات في قائمة السياق بعد الوقوف على الإضافة وهي:\nفتح: لِفتح الإضافة, يظهر هذا الخيار في حال كانت الإضافة تم تنزيلها بالفعل.\nإظهار في المجلد: لِفتح المجلد الذي يحتوي على الإضافة, وينقل المؤشر للإضافة مباشرتًا, يظهر هذا الخيار في حال كانت الإضافة تم تنزيلها بالفعل.\nفتح بالمتصفح: لِفتح الإضافة بمتصفح الويب, أَي يذهب إلى صفحى الإضافة مِن موقع إضافات nvda.\nنسخ رابط التنزيل: لِنسخ رابط مباشر لِتنزيل الإضافة للحافِظة.\nنسخ رابط صفحة الإضافة: لِنسخ رابط صفحى الإضافة على موقع إضافات nvda.\nهذا كل ما يتعلق بِهذه الأداة.\n*إضافة أداة جديدة لتوليد كلمات المرور العشوائية.\nويمكنكم الوصول لها مِن خلال الضغط على control+shift+p, أو مِن قائمة أدوات نختر مولد كلمة سر عشوائية\tctrl+shift+p.\nأما عن طريقة إستخدامِها فهو سهل للغاية, بعد الدخول لها, نقم بتحديد طول كلمة المرور المُراد توليدها, 4/170\nونحدد على الخيارات المُرادة, كتضمين الأحرف الكبيرة, الرموز, والأرقام, ثم نضغط توليد, سينقلنا إلى حقل التحرير الذي يحتوي على كلمة المرور, يمكننا نسخها بتحديدها control+a ثم نسخها control+c.\n*في ملف دليل الإستخدام, والذي يمكن الوصول له بالضغط على f1, تم إضافة التغييرات التي تَتِم على تحديثات البرنامج, ويمكن التنقل بين الإصدارات بالضغط على رقم 4.\tNote, in this version I removed the mp3 to mp4 converter, due to the many problems with it, I will return it to the program if I find the appropriate solutions to the problems.\nAs for the new modifications / additions.\n* Solve the problem of installing the program on disk C:, now you can install it without having any problems.\n* A new tool has been added, through which you can download nvda add-ons, you can access it by pressing nvda+shift+n, or from the Tools menu, choose the download nvda addons tools ctrl+shift+n\nAfter entering the tool, a list of addons from the nvda site will appear\nhttps://addons.nvda-project.org\nNote, only addons that support direct download links are available in the program.\nAs for the details of using this tool.\nTo download an addon, just press enter, and it will start the download, and tell you the download percentage via the progress bar in the window.\nAs for the download path, the default is in Documents, and you can change the path in settings/download nvda addons tool settings\nAfter identifying the addon, you can press F1, to find out information about the addon, the required version of NVDA to run the add-on, as well as the description of the addon.\nNote, the required NVDA version number may be inaccurate in the future, because the description and version are stored data, i.e. manually changed, and the addons version is always up-to-date, i.e. always download the latest available version.\nThere are some options in the context menu after stopping the addition, which are:\nOpen: To open the addon, this option appears if the addon has already been downloaded.\nShow in folder: To open the folder that contains the addon and move the cursor to the addon directly, this option appears if the addon has already been downloaded.\nOpen with browser: To open the addon in a web browser, that is, go to the addon page of the nvda addons website.\nCopy Download Link: To copy a direct link to download the addon to clipboard.\nCopy addon Page Link: To copy the addon page url on the nvda addons website.\nThat's all about this tool.\n*Added a new tool, random password generator.\nYou can access it by pressing control+shift+p, or from the Tools menu select ctrl+shift+p random password generator.\nAs for how to use it, it is very easy, after entering it, we specify the length of the password to be generated, 4/170\nWe specify the desired options, such as including capital letters, symbols, and numbers, then press generate, it will take us to the edit field that contains the password, we can copy it by selecting control+a and then copying control+c.\n* In the user guide file, which can be accessed by pressing f1, the changes made to program updates have been added, and you can move between versions by pressing number. 4."
}